espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <vendor>ESPRESSIF SYSTEMS (SHANGHAI) CO., LTD.</vendor>
  <vendorID>ESPRESSIF</vendorID>
  <name>ESP32-H4</name>
  <series>ESP32 H-Series</series>
  <version>1</version>
  <description>32-bit RISC-V MCU &amp; Bluetooth 5.4 (LE) &amp; IEEE 802.15.4</description>
  <licenseText>Copyright 2026 Espressif Systems (Shanghai) PTE LTD

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.</licenseText>
  <cpu>
    <name>RV32IMAC</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>0</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>32</addressUnitBits>
  <width>32</width>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>CLINT</name>
      <description>Core Local Interrupts</description>
      <groupName>CLINT</groupName>
      <baseAddress>0x20000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MSIP</name>
          <description>Core-local machine software interrupt pending register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MSIP</name>
              <description>Configures the pending status of the machine software interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MTIMECMP</name>
          <description>Core-local machine timer compare value</description>
          <addressOffset>0x4000</addressOffset>
          <size>0x40</size>
          <fields>
            <field>
              <name>MTIMECMP</name>
              <description>Represents the value to compare with the system counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MTIMELOAD</name>
          <description>Core-local machine timer load value</description>
          <addressOffset>0x4008</addressOffset>
          <size>0x40</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MTIMELOAD</name>
              <description>Represents the value to be loaded to the system counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MTIMECTL</name>
          <description>Core-local machine timer interrupt control/status register</description>
          <addressOffset>0x4010</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>MTIME_EN</name>
              <description>Configures whether to enable the system counter. This bit is implemented in the CLINT of core 0 only.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MTIME_OVF</name>
              <description>Set by hardware when the system counter reaches its maximum value. Software can clear this bit by writing 0 to it.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MTIME_SAM</name>
              <description>Configures the sampling mode of MTIME, to allow reading the 64-bit counter value consistently.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>MTIME_SAM</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No sampling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_HIGH</name>
                  <description>Sample the upper half of the system counter when the lower half of MTIME is read</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_LOW</name>
                  <description>Sample the lower half of the system counter when the upper half of MTIME is read</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE_OTHER</name>
                  <description>Sample the other half of the system counter when either half of MTIME is read</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MTIME</name>
          <description>Core-local system counter value</description>
          <addressOffset>0xBFF8</addressOffset>
          <size>0x40</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MTIME</name>
              <description>Represents the current value of the system counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>64</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
