espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register derivedFrom="DMA.DATE">
          <name>DATE</name>
          <description>AES version control register</description>
          <addressOffset>0xB4</addressOffset>
        </register>
        <register>
          <name>DMA_EXIT</name>
          <description>Operation exit controlling register</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMA_EXIT</name>
              <description>Configures whether or not to exit AES operation. \\
0: No effect\\
1: Exit\\
Only valid for DMA-AES operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_RESET</name>
          <description>AES-DMA reset rx-fifo register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RX_RESET</name>
              <description>Set this bit to reset rx_fifo under dma_aes working mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_RESET</name>
          <description>AES-DMA reset tx-fifo register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_RESET</name>
              <description>Set this bit to reset tx_fifo under dma_aes working mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSEUDO</name>
          <description>AES PSEUDO function configure register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <resetValue>0x000003C4</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>This bit decides whether the pseudo round function is enable or not.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASE</name>
              <description>Those bits decides the basic number of pseudo round number.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INC</name>
              <description>Those bits decides the increment number of pseudo round number</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_CNT</name>
              <description>Those bits decides the update frequency of the pseudo-key.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>DMA (Direct Memory Access) Controller</description>
      <groupName>AHB_DMA</groupName>
      <baseAddress>0x6001F000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x370</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>5</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-4</dimIndex>
          <name>IN_INT_CH%s</name>
          <description>Cluster IN_INT_CH%s, containing IN_INT_RAW_CH?, IN_INT_ST_CH?, IN_INT_ENA_CH?, IN_INT_CLR_CH?</description>
          <addressOffset>0x0</addressOffset>
          <register>
            <name>RAW</name>
            <description>Raw interrupt status of RX channel 0</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_DONE</name>
                <description>The raw interrupt status of AHB_DMA_IN_DONE_CH0_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_SUC_EOF</name>
                <description>The raw interrupt status of AHB_DMA_IN_SUC_EOF_CH0_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_ERR_EOF</name>
                <description>The raw interrupt status of AHB_DMA_IN_ERR_EOF_CH0_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_DSCR_ERR</name>
                <description>The raw interrupt status of AHB_DMA_IN_DSCR_ERR_CH0_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_DSCR_EMPTY</name>
                <description>The raw interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH0_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INFIFO_OVF</name>
                <description>The raw interrupt status of AHB_DMA_INFIFO_OVF_CH0_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INFIFO_UDF</name>
                <description>The raw interrupt status of AHB_DMA_INFIFO_UDF_CH0_INT.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_AHBINF_RESP_ERR</name>
                <description>The raw interrupt status of AHB_DMA_IN_RESP_ERR_CH0_INT.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ST</name>
            <description>Masked interrupt status of RX channel 0</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_DONE</name>
                <description>The masked interrupt status of AHB_DMA_IN_DONE_CH%s_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_SUC_EOF</name>
                <description>The masked interrupt status of AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_ERR_EOF</name>
                <description>The masked interrupt status of AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_DSCR_ERR</name>
                <description>The masked interrupt status of AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_DSCR_EMPTY</name>
                <description>The masked interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_OVF</name>
                <description>The masked interrupt status of AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>INFIFO_UDF</name>
                <description>The masked interrupt status of AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>IN_AHBINF_RESP_ERR</name>
                <description>The masked interrupt status of AHB_DMA_IN_RESP_ERR_CH%s_INT.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENA</name>
            <description>Interrupt enable bits of RX channel 0</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_DONE</name>
                <description>Write 1 to enable AHB_DMA_IN_DONE_CH%s_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_SUC_EOF</name>
                <description>Write 1 to enable AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_ERR_EOF</name>
                <description>Write 1 to enable AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_DSCR_ERR</name>
                <description>Write 1 to enable AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_DSCR_EMPTY</name>
                <description>Write 1 to enable AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INFIFO_OVF</name>
                <description>Write 1 to enable AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>INFIFO_UDF</name>
                <description>Write 1 to enable AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_AHBINF_RESP_ERR</name>
                <description>Write 1 to enable AHB_DMA_IN_RESP_ERR_CH%s_INT.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CLR</name>
            <description>Interrupt clear bits of RX channel 0</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_DONE</name>
                <description>Write 1 to clear AHB_DMA_IN_DONE_CH%s_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>IN_SUC_EOF</name>
                <description>Write 1 to clear AHB_DMA_IN_SUC_EOF_CH%s_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>IN_ERR_EOF</name>
                <description>Write 1 to clear AHB_DMA_IN_ERR_EOF_CH%s_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>IN_DSCR_ERR</name>
                <description>Write 1 to clear AHB_DMA_IN_DSCR_ERR_CH%s_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>IN_DSCR_EMPTY</name>
                <description>Write 1 to clear AHB_DMA_IN_DSCR_EMPTY_CH%s_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>INFIFO_OVF</name>
                <description>Write 1 to clear AHB_DMA_INFIFO_OVF_CH%s_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>INFIFO_UDF</name>
                <description>Write 1 to clear AHB_DMA_INFIFO_UDF_CH%s_INT.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
              <field>
                <name>IN_AHBINF_RESP_ERR</name>
                <description>Write 1 to clear AHB_DMA_IN_RESP_ERR_CH%s_INT.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>5</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-4</dimIndex>
          <name>OUT_INT_CH%s</name>
          <description>Cluster OUT_INT_CH%s, containing OUT_INT_RAW_CH?, OUT_INT_ST_CH?, OUT_INT_ENA_CH?, OUT_INT_CLR_CH?</description>
          <addressOffset>0x50</addressOffset>
          <register>
            <name>RAW</name>
            <description>Raw interrupt status of TX channel 0</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_DONE</name>
                <description>The raw interrupt status of AHB_DMA_OUT_DONE_CH%s_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_EOF</name>
                <description>The raw interrupt status of AHB_DMA_OUT_EOF_CH%s_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_DSCR_ERR</name>
                <description>The raw interrupt status of AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_TOTAL_EOF</name>
                <description>The raw interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTFIFO_OVF</name>
                <description>The raw interrupt status of AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTFIFO_UDF</name>
                <description>The raw interrupt status of AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_AHBINF_RESP_ERR</name>
                <description>The raw interrupt status of AHB_DMA_OUT_RESP_ERR_CH%s_INT.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ST</name>
            <description>Masked interrupt status of TX channel 0</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_DONE</name>
                <description>The masked interrupt status of AHB_DMA_OUT_DONE_CH%s_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_EOF</name>
                <description>The masked interrupt status of AHB_DMA_OUT_EOF_CH%s_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_DSCR_ERR</name>
                <description>The masked interrupt status of AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_TOTAL_EOF</name>
                <description>The masked interrupt status of AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_OVF</name>
                <description>The masked interrupt status of AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_UDF</name>
                <description>The masked interrupt status of AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_AHBINF_RESP_ERR</name>
                <description>The masked interrupt status of AHB_DMA_OUT_RESP_ERR_CH%s_INT.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENA</name>
            <description>Interrupt enable bits of TX channel 0</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_DONE</name>
                <description>Write 1 to enable AHB_DMA_OUT_DONE_CH%s_INT.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_EOF</name>
                <description>Write 1 to enable AHB_DMA_OUT_EOF_CH%s_INT.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_DSCR_ERR</name>
                <description>Write 1 to enable AHB_DMA_OUT_DSCR_ERR_CH%s_INT.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_TOTAL_EOF</name>
                <description>Write 1 to enable AHB_DMA_OUT_TOTAL_EOF_CH%s_INT.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTFIFO_OVF</name>
                <description>Write 1 to enable AHB_DMA_OUTFIFO_OVF_CH%s_INT.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTFIFO_UDF</name>
                <description>Write 1 to enable AHB_DMA_OUTFIFO_UDF_CH%s_INT.</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_AHBINF_RESP_ERR</name>
                <description>Write 1 to enable AHB_DMA_OUT_RESP_ERR_CH%s_INT.</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
