espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
          <register>
            <name>OUT_CONF0</name>
            <description>Configuration register 0 of TX channel 0</description>
            <addressOffset>0x80</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000008</resetValue>
            <fields>
              <field>
                <name>OUT_RST</name>
                <description>Configures the reset state of AHB_DMA channel %s TX FSM and TX FIFO pointer.\\0: Release reset\\1: Reset\\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_LOOP_TEST</name>
                <description>Reserved.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_AUTO_WRBACK</name>
                <description>Configures whether to enable automatic outlink write-back when all the data in TX FIFO has been transmitted.\\0: Disable\\1: Enable\\</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_EOF_MODE</name>
                <description>Configures when to generate EOF flag.\\0: EOF flag for TX channel %s is generated when data to be transmitted has been pushed into FIFO in AHB_DMA.\\ 1: EOF flag for TX channel %s is generated when data to be transmitted has been popped from FIFO in AHB_DMA.\\</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTDSCR_BURST_EN</name>
                <description>Configures whether to enable INCR burst transfer for TX channel %s reading descriptors.\\0: Disable\\1: Enable\\</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_ETM_EN</name>
                <description>Configures whether to enable ETM control for TX channel %s.\\0: Disable\\1: Enable\\</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUT_DATA_BURST_MODE_SEL</name>
                <description>Configures max burst size for TX channel%s.\\2'b00: single\\ 2'b01: incr4\\ 2'b10: incr8\\ 2'b11: incr16\\</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_CONF1</name>
            <description>Configuration register 1 of TX channel 0</description>
            <addressOffset>0x84</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_CHECK_OWNER</name>
                <description>Configures whether to enable owner bit check for TX channel %s.\\0: Disable\\1: Enable\\</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUTFIFO_STATUS</name>
            <description>Transmit FIFO status of TX channel 0</description>
            <addressOffset>0x88</addressOffset>
            <size>0x20</size>
            <resetValue>0x07800002</resetValue>
            <fields>
              <field>
                <name>OUTFIFO_FULL</name>
                <description>Represents whether L1 TX FIFO is full.\\0: Not Full\\1: Full\\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_EMPTY</name>
                <description>Represents whether L1 TX FIFO is empty.\\0: Not empty\\1: Empty\\</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUTFIFO_CNT</name>
                <description>Represents the number of data bytes in L1 TX FIFO for TX channel %s.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>7</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_1B</name>
                <description>Reserved.</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_2B</name>
                <description>Reserved.</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_3B</name>
                <description>Reserved.</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_REMAIN_UNDER_4B</name>
                <description>Reserved.</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_PUSH</name>
            <description>Push control register of TX channel 0</description>
            <addressOffset>0x8C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTFIFO_WDATA</name>
                <description>Configures the data that need to be pushed into AHB_DMA FIFO.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>9</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>OUTFIFO_PUSH</name>
                <description>Configures whether to push data into AHB_DMA FIFO.\\0: Invalid. No effect\\1: Push\\</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_LINK</name>
            <description>Linked list descriptor configuration and control register of TX channel 0</description>
            <addressOffset>0x90</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000008</resetValue>
            <fields>
              <field>
                <name>OUTLINK_STOP</name>
                <description>Configures whether to stop AHB_DMA's TX channel %s from transmitting data.\\0: Invalid. No effect\\1: Stop\\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>OUTLINK_START</name>
                <description>Configures whether to enable AHB_DMA's TX channel %s for data transfer.\\0: Disable\\1: Enable\\</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>OUTLINK_RESTART</name>
                <description>Configures whether to restart TX channel %s for AHB_DMA transfer.\\0: Invalid. No effect\\1: Restart\\</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>write-only</access>
              </field>
              <field>
                <name>OUTLINK_PARK</name>
                <description>Represents the status of the transmit descriptor's FSM.\\0: Running\\1: Idle\\</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_LINK_ADDR</name>
            <description>Link list descriptor address configuration of TX channel 0</description>
            <addressOffset>0x94</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_ADDR</name>
                <description>Configures the 32 bits of the first receive descriptor's address.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_STATE</name>
            <description>Transmit status of TX channel 0</description>
            <addressOffset>0x98</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR_ADDR</name>
                <description>Represents the lower 18 bits of the address of the next transmit descriptor to be processed.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>18</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_DSCR_STATE</name>
                <description>reserved</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>OUT_STATE</name>
                <description>reserved</description>
                <bitOffset>20</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_EOF_DES_ADDR</name>
            <description>Transmit descriptor address when EOF occurs on TX channel 0</description>
            <addressOffset>0x9C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_EOF_DES_ADDR</name>
                <description>Represents the address of the transmit descriptor when the EOF bit in this descriptor is 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_EOF_BFR_DES_ADDR</name>
            <description>The last transmit descriptor address when EOF occurs on TX channel 0</description>
            <addressOffset>0xA0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_EOF_BFR_DES_ADDR</name>
                <description>Represents the address of the transmit descriptor before the last transmit descriptor.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_DSCR</name>
            <description>Current transmit descriptor address of TX channel 0</description>
            <addressOffset>0xA8</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR</name>
                <description>Represents the address of the next transmit descriptor y+1 pointed by the current transmit descriptor that has already been fetched.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_DSCR_BF0</name>
            <description>The last transmit descriptor address of TX channel 0</description>
            <addressOffset>0xAC</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR_BF0</name>
                <description>Represents the address of the current transmit descriptor y that has already been fetched.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_DSCR_BF1</name>
            <description>The second-to-last transmit descriptor address of TX channel 0</description>
            <addressOffset>0xB0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUTLINK_DSCR_BF1</name>
                <description>Represents the address of the previous transmit descriptor y-1 that has already been fetched.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_PRI</name>
            <description>Priority register of TX channel 0</description>
            <addressOffset>0xB4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>TX_PRI</name>
                <description>Configures the priority of TX channel %s.The larger of the value, the higher of the priority.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_PERI_SEL</name>
            <description>Peripheral selection register of TX channel 0</description>
            <addressOffset>0xB8</addressOffset>
            <size>0x20</size>
            <resetValue>0x0000003F</resetValue>
            <fields>
              <field>
                <name>PERI_OUT_SEL</name>
                <description>Configures the peripheral connected to TX channel %s.\\ 0: SPI3\\ 1: SPI2\\ 2: UHCI0\\ 3: I2S0\\ 4: AES\\ 5: Sample_rate_convert-0\\ 6:  Sample_rate_convert-1\\ 7: SHA\\ 8: ADC_DAC\\ 9: PARL_IO\\ 10: Dummy\\ 11~15: Dummy\\</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IN_DONE_DES_ADDR</name>
            <description>RX_done Inlink descriptor address of RX channel 0</description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>IN_DONE_DES_ADDR</name>
                <description>Represents the address of the inlink descriptor when  this descriptor is completed .</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RX_CH_ARB_WEIGH</name>
            <description>RX channel 0 arbitration weight configuration register</description>
            <addressOffset>0x3C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>RX_CH_ARB_WEIGH</name>
                <description>Configures the weight(i.e the number of tokens) of RX channel%s</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RX_ARB_WEIGH_OPT_DIR</name>
            <description>RX channel 0 weight arbitration optimization enable register</description>
            <addressOffset>0x40</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>RX_ARB_WEIGH_OPT_DIR</name>
                <description>reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OUT_DONE_DES_ADDR</name>
            <description>TX done outlink descriptor address of TX channel 0</description>
            <addressOffset>0xA4</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>OUT_DONE_DES_ADDR</name>
                <description>Represents the address of the outlink descriptor when this descriptor is completed.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TX_CH_ARB_WEIGH</name>
            <description>TX channel 0 arbitration weight configuration register</description>
            <addressOffset>0xBC</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>TX_CH_ARB_WEIGH</name>
                <description>Configures the weight(i.e the number of tokens) of TX channel%s</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TX_ARB_WEIGH_OPT_DIR</name>
            <description>TX channel 0 weight arbitration optimization enable register</description>
            <addressOffset>0xC0</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>TX_ARB_WEIGH_OPT_DIR</name>
                <description>reserved</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>INTR_MEM_START_ADDR</name>
          <description>Accessible address space start address configuration register</description>
          <addressOffset>0x600</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_START_ADDR</name>
              <description>Configures the start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_END_ADDR</name>
          <description>Accessible address space end address configuration register</description>
          <addressOffset>0x604</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_END_ADDR</name>
              <description>Configures the end address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_TIMEOUT</name>
          <description>TX arbitration timeout configuration register</description>
          <addressOffset>0x608</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ARB_TIMEOUT</name>
              <description>Configures the time slot. Measurement unit: AHB bus clock cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WEIGHT_EN</name>
          <description>TX weight arbitration enable register</description>
          <addressOffset>0x610</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WEIGHT_EN</name>
              <description>Configures whether to enable weight arbitration.\\0: Disable\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
