espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register derivedFrom="DMA.DATE">
          <name>CTRL_DATE</name>
          <description>version</description>
          <addressOffset>0x3FC</addressOffset>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ASRC</name>
      <description>ASRC Peripheral</description>
      <groupName>ASRC</groupName>
      <baseAddress>0x60028000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CHNL0_CFG0</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>CHNL0_RS2_STG1_BYPASS</name>
              <description>Set this bit to bypass stage 1 re-sampler in channel0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_RS2_STG0_BYPASS</name>
              <description>Set this bit to bypass stage 0 re-sampler in channel0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_FRAC_BYPASS</name>
              <description>Set this bit to bypass fractional re-sampler in channel0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_RS2_STG1_MODE</name>
              <description>Write this bit to configure stage 1 re-sampler mode in channel0, 0: interpolation by  factor of 2, 1: decimation by  factor of 2.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_RS2_STG0_MODE</name>
              <description>Write this bit to configure stage 0 re-sampler mode in channel0, 0: interpolation by  factor of 2, 1: decimation by  factor of 2.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_FRAC_AHEAD</name>
              <description>Set this bit to move fraction re-sampler to the first stage in channel0, it should be 1 when input frequency is higher the output.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_RS2_SELPHASE0</name>
              <description>Set this bit to disable shift phase when 2 interpolation by factor of 2 in channel0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_MODE</name>
              <description>Write the bit to configure the channel mode,0: in and out are both mono, 1: in and out is both dual, 2: in is mono, out is dual, 3, in is dual, out is mono.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_SEL</name>
              <description>Write the bit to configure which 16bits data will be processing.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL0_CFG1</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL0_FRAC_M</name>
              <description>Write the bits to specify the denominator of factor of fraction re-sampler in channel0, reg_chnl0_frac_m and reg_chnl0_frac_l are relatively prime.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_FRAC_L</name>
              <description>Write the bits to specify the nominator of factor of fraction re-sampler in channel0, reg_chnl0_frac_l and reg_chnl0_frac_m are relatively prime.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL0_CFG2</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL0_FRAC_RECIPL</name>
              <description>Write the bits with ((2^19+L)/(2L)) round down in channel0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL0_CFG3</name>
          <description>Control and configuration registers</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL0_RESET</name>
              <description>Set this bit to reset channel0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL0_CFG4</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL0_START</name>
              <description>Set this bit to start channel0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL0_CFG5</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL0_IN_CNT_ENA</name>
              <description>Set this bit to enable in data byte counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_IN_CNT_CLR</name>
              <description>Set this bit to clear in data byte counter.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL0_IN_LEN</name>
              <description>Write the bits to specify the data byte number of data from the DMA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL0_CFG6</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL0_OUT_EOF_GEN_MODE</name>
              <description>Write the bits to specify the which eof will be written to DMA. 0:  counter eof, 1: DMA ineof, 2: both counter eof and DMA ineof, 3 none.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_OUT_CNT_ENA</name>
              <description>Set this bit to enable out data byte counter.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_OUT_CNT_CLR</name>
              <description>Set this bit to clear out data byte counter.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL0_OUT_LEN_COMP</name>
              <description>Set this bit to enable out data byte counter compensation when using fractional re-sampler and decimation by factor of 2 which results in reg_chnl0_out_cnt &gt;= reg_chnl0_out_len</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_OUT_LEN</name>
              <description>Write the bits to specify the data byte number of data to the DMA, the counter eof will be set when the counter approaches.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL0_FIFO_CTRL</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL0_INFIFO_RESET</name>
              <description>Set this bit to reset outfifo.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL0_OUTFIFO_RESET</name>
              <description>Set this bit to reset infifo.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL0_INT_RAW</name>
          <description>Raw interrupt status</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL0_OUTCNT_EOF_INT_RAW</name>
              <description>This interrupt raw bit turns to high level when the counter approach to reg_out_len.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_OUTFIFO_EOF_INT_RAW</name>
              <description>This interrupt raw bit turns to high level when getting the eof from DMA and write the several data to DMA.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL0_INT_ST</name>
          <description>Masked interrupt status</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL0_OUTCNT_EOF_INT_ST</name>
              <description>This is the status bit for reg_out_cnt_eof_int_raw when reg_out_cnt_eof_int_ena is set to 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHNL0_OUTFIFO_EOF_INT_ST</name>
              <description>This is the status bit for reg_outfifo_eof_int_raw when reg_outfifo_eof_int_ena is set to 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL0_INT_ENA</name>
          <description>Interrupt enable bits</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL0_OUTCNT_EOF_INT_ENA</name>
              <description>This is the enable bit for reg_out_cnt_eof_int_st register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL0_OUTFIFO_EOF_INT_ENA</name>
              <description>This is the enable bit for reg_outfifo_eof_int_st register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL0_INT_CLR</name>
          <description>Interrupt clear bits</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL0_OUTCNT_EOF_INT_CLR</name>
              <description>Set this bit to clear the reg_out_cnt_eof_int_raw interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL0_OUTFIFO_EOF_INT_CLR</name>
              <description>Set this bit to clear the reg_outfifo_eof_int_raw interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL0_OUT_CNT</name>
          <description>Status Registers</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL0_OUT_CNT</name>
              <description>Represents the bytes numbers send to the DMA when EOF occurs.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL0_TRACE0</name>
          <description>Status Registers</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL0_FRAC_FSM_CS</name>
              <description>Represents fractional re-sampler status in channel1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHNL0_RS2_STG1_FSM_CS</name>
              <description>Represents re-sampler 2 stag1 status in channel1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHNL0_RS2_STG0_FSM_CS</name>
              <description>Represents re-sampler 2 stag0 status in channel1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL0_TRACE1</name>
          <description>Debug Register1</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL0_OUT_INC</name>
              <description>Represents the samples numbers send to the DMA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_CFG0</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>CHNL1_RS2_STG1_BYPASS</name>
              <description>Set this bit to bypass stage 1 re-sampler in channel1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_RS2_STG0_BYPASS</name>
              <description>Set this bit to bypass stage 0 re-sampler in channel1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_FRAC_BYPASS</name>
              <description>Set this bit to bypass fractional re-sampler in channel1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_RS2_STG1_MODE</name>
              <description>Write this bit to configure stage 1 re-sampler mode in channel1, 0: interpolation by  factor of 2, 1: decimation by  factor of 2.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_RS2_STG0_MODE</name>
              <description>Write this bit to configure stage 0 re-sampler mode in channel1, 0: interpolation by  factor of 2, 1: decimation by  factor of 2.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_FRAC_AHEAD</name>
              <description>Set this bit to move fraction re-sampler to the first stage in channel1, it should be 1 when input frequency is higher the output.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_RS2_SELPHASE0</name>
              <description>Set this bit to disable shift phase when 2 interpolation by factor of 2 in channel1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_MODE</name>
              <description>Write the bit to configure the channel mode,0: in and out are both mono, 1: in and out is both dual, 2: in is mono, out is dual, 3, in is dual, out is mono.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_SEL</name>
              <description>Write the bit to configure which 16bits data will be processing.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_CFG1</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL1_FRAC_M</name>
              <description>Write the bits to specify the denominator of factor of fraction re-sampler in channel1, reg_chnl0_frac_m and reg_chnl0_frac_l are relatively prime.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_FRAC_L</name>
              <description>Write the bits to specify the nominator of factor of fraction re-sampler in channel1, reg_chnl0_frac_l and reg_chnl0_frac_m are relatively prime.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_CFG2</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL1_FRAC_RECIPL</name>
              <description>Write the bits with ((2^19+L)/(2L)) round down in channel1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_CFG3</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL1_RESET</name>
              <description>Set this bit to reset channel1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_CFG4</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL1_START</name>
              <description>Set this bit to start channel1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHNL1_CFG5</name>
          <description>Control and configuration registers</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHNL1_IN_CNT_ENA</name>
              <description>Set this bit to enable in data byte counter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHNL1_IN_CNT_CLR</name>
              <description>Set this bit to clear in data byte counter.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CHNL1_IN_LEN</name>
              <description>Write the bits to specify the data byte numbers of data from the DMA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
