espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>CORE_1_INTR_ENA</name>
          <description>core1 monitor interrupt enable register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_0_RD_INTR_ENA</name>
              <description>Core1 dram0 area0 read monitor interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_0_WR_INTR_ENA</name>
              <description>Core1 dram0 area0 write monitor interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_1_RD_INTR_ENA</name>
              <description>Core1 dram0 area1 read monitor interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_1_WR_INTR_ENA</name>
              <description>Core1 dram0 area1 write monitor interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_0_RD_INTR_ENA</name>
              <description>Core1 PIF area0 read monitor interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_0_WR_INTR_ENA</name>
              <description>Core1 PIF area0 write monitor interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_1_RD_INTR_ENA</name>
              <description>Core1 PIF area1 read monitor interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_1_WR_INTR_ENA</name>
              <description>Core1 PIF area1 write monitor interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_SP_SPILL_MIN_INTR_ENA</name>
              <description>Core1 stackpoint underflow monitor interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_SP_SPILL_MAX_INTR_ENA</name>
              <description>Core1 stackpoint overflow monitor interrupt enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_EXCEPTION_MONITOR_INTR_ENA</name>
              <description>IBUS busy monitor interrupt enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_DRAM0_EXCEPTION_MONITOR_INTR_ENA</name>
              <description>DBUS busy monitor interrupt enbale</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_INTR_CLR</name>
          <description>core1 monitor interrupt clear register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_0_RD_CLR</name>
              <description>Write 1 to clear the interrupt for read operations in region 0 by Data bus.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_0_WR_CLR</name>
              <description>Write 1 to clear the interrupt for write operations in region 0 by Data bus.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_1_RD_CLR</name>
              <description>Write 1 to clear the interrupt for read operations in region 1 by Data bus.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_AREA_DRAM0_1_WR_CLR</name>
              <description>Write 1 to clear the interrupt for write operations in region 1 by Data bus.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_0_RD_CLR</name>
              <description>Write 1 to clear the interrupt for read operations in region 0 by Peripheral bus.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_0_WR_CLR</name>
              <description>Write 1 to clear the interrupt for write operations in region 0 by Peripheral bus.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_1_RD_CLR</name>
              <description>Write 1 to clear the interrupt for read operations in region 1 by Peripheral bus.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_AREA_PIF_1_WR_CLR</name>
              <description>Write 1 to clear the interrupt for write operations in region 1 by Peripheral bus.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_SP_SPILL_MIN_CLR</name>
              <description>Write 1 to clear the interrupt for SP exceeding the lower bound address of SP monitored region.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_SP_SPILL_MAX_CLR</name>
              <description>Write 1 to clear the interrupt for SP exceeding the upper bound address of SP monitored region.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_EXCEPTION_MONITOR_CLR</name>
              <description>IBUS busy monitor interrupt clr</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CORE_1_DRAM0_EXCEPTION_MONITOR_CLR</name>
              <description>DBUS busy monitor interrupt clr</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_DRAM0_0_MIN</name>
          <description>Configures lower boundary address of region 0 monitored on Data bus</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_0_MIN</name>
              <description>Configures the lower bound address of Data bus region 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_DRAM0_0_MAX</name>
          <description>Configures upper boundary address of region 0 monitored on Data bus</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_0_MAX</name>
              <description>Configures the upper bound address of Data bus region 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_DRAM0_1_MIN</name>
          <description>Configures lower boundary address of region 1 monitored on Data bus</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_1_MIN</name>
              <description>Configures the lower bound address of Data bus region 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_DRAM0_1_MAX</name>
          <description>Configures upper boundary address of region 1 monitored on Data bus</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_DRAM0_1_MAX</name>
              <description>Configures the upper bound address of Data bus region 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PIF_0_MIN</name>
          <description>Configures lower boundary address of region 0 monitored on Peripheral bus</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_AREA_PIF_0_MIN</name>
              <description>Configures the lower bound address of Peripheral bus region 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PIF_0_MAX</name>
          <description>Configures upper boundary address of region 0 monitored on Peripheral bus</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_PIF_0_MAX</name>
              <description>Configures the upper bound address of Peripheral bus region 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PIF_1_MIN</name>
          <description>Configures lower boundary address of region 1 monitored on Peripheral bus</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_AREA_PIF_1_MIN</name>
              <description>Configures the lower bound address of Peripheral bus region 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PIF_1_MAX</name>
          <description>Configures upper boundary address of region 1 monitored on Peripheral bus</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_PIF_1_MAX</name>
              <description>Configures the upper bound address of Peripheral bus region 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_PC</name>
          <description>Region monitoring HP CPU PC status register</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_PC</name>
              <description>Represents the PC value when an interrupt is triggered during region monitoring.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_AREA_SP</name>
          <description>Region monitoring HP CPU SP status register</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_AREA_SP</name>
              <description>Represents the SP value when an interrupt is triggered during region monitoring.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_SP_MIN</name>
          <description>Configures stack monitoring lower boundary address</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_SP_MIN</name>
              <description>Configures the lower bound address of SP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_SP_MAX</name>
          <description>Configures stack monitoring upper boundary address</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CORE_1_SP_MAX</name>
              <description>Configures the upper bound address of SP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_SP_PC</name>
          <description>Stack monitoring HP CPU PC status register</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_SP_PC</name>
              <description>Represents the PC value during stack monitoring.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_EN</name>
          <description>HP CPU PC logging enable register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_RCD_RECORDEN</name>
              <description>Configures whether to enable PC logging.\\
0: Disable\\
1: ASSIST_DEBUG_CORE_1_RCD_PDEBUGPC_REG starts to record PC in real time\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE_1_RCD_PDEBUGEN</name>
              <description>Configures whether to enable HP CPU debugging.\\
0: Disable\\
1: HP CPU outputs PC\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_PDEBUGPC</name>
          <description>PC logging register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_RCD_PDEBUGPC</name>
              <description>Represents the PC value at HP CPU reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_RCD_PDEBUGSP</name>
          <description>PC logging register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_RCD_PDEBUGSP</name>
              <description>Represents SP.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_IRAM0_EXCEPTION_MONITOR_0</name>
          <description>exception monitor status register0</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_IRAM0_RECORDING_ADDR_0</name>
              <description>reg_core_1_iram0_recording_addr_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_RECORDING_WR_0</name>
              <description>reg_core_1_iram0_recording_wr_0</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_IRAM0_RECORDING_LOADSTORE_0</name>
              <description>reg_core_1_iram0_recording_loadstore_0</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DRAM0_EXCEPTION_MONITOR_0</name>
          <description>exception monitor status register2</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_DRAM0_RECORDING_WR_0</name>
              <description>reg_core_1_dram0_recording_wr_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_DRAM0_RECORDING_BYTEEN_0</name>
              <description>reg_core_1_dram0_recording_byteen_0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DRAM0_EXCEPTION_MONITOR_1</name>
          <description>exception monitor status register3</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_DRAM0_RECORDING_ADDR_0</name>
              <description>reg_core_1_dram0_recording_addr_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DRAM0_EXCEPTION_MONITOR_2</name>
          <description>exception monitor status register4</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_DRAM0_RECORDING_PC_0</name>
              <description>reg_core_1_dram0_recording_pc_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_LASTPC_BEFORE_EXCEPTION</name>
          <description>cpu status register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_LASTPC_BEFORE_EXC</name>
              <description>Represents the PC of the last command before the HP CPU enters exception.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_DEBUG_MODE</name>
          <description>cpu status register</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_DEBUG_MODE</name>
              <description>Represents whether RISC-V CPU (HP CPU) is in debugging mode.\\
1: In debugging mode\\
0: Not in debugging mode\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE_1_DEBUG_MODULE_ACTIVE</name>
              <description>Represents the status of the RISC-V CPU (HP CPU) debug module.\\
1: Active status\\
Other: Inactive status\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_1_TRACE_LOCKUP_CAUSE_0</name>
          <description>TRACE lockup cause logging register</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE_1_TRACE_LOCKUP_RECORDING_CAUSE_0</name>
              <description>Represents the latest lockup cause</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
