espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>L1_CACHE_ACS_CNT_CTRL</name>
          <description>Cache Access Counter enable and clear register</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS0_CNT_ENA</name>
              <description>The bit is used to enable ibus0 counter in L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS1_CNT_ENA</name>
              <description>The bit is used to enable ibus1 counter in L1-ICache1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS2_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS3_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS0_CNT_ENA</name>
              <description>The bit is used to enable dbus0 counter in L1-DCache.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS1_CNT_ENA</name>
              <description>The bit is used to enable dbus1 counter in L1-DCache.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS2_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DBUS3_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_IBUS0_CNT_CLR</name>
              <description>The bit is used to clear ibus0 counter in L1-ICache0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_IBUS1_CNT_CLR</name>
              <description>The bit is used to clear ibus1 counter in L1-ICache1.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_IBUS2_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_IBUS3_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_DBUS0_CNT_CLR</name>
              <description>The bit is used to clear dbus0 counter in L1-DCache.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_DBUS1_CNT_CLR</name>
              <description>The bit is used to clear dbus1 counter in L1-DCache.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_DBUS2_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L1_DBUS3_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS0_ACS_HIT_CNT</name>
          <description>L1-ICache bus0 Hit-Access Counter register</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS0_HIT_CNT</name>
              <description>The register records the number of hits when bus0 accesses L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS0_ACS_MISS_CNT</name>
          <description>L1-ICache bus0 Miss-Access Counter register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS0_MISS_CNT</name>
              <description>The register records the number of missing when bus0 accesses L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS0_ACS_CONFLICT_CNT</name>
          <description>L1-ICache bus0 Conflict-Access Counter register</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS0_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus0 accesses L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS0_ACS_NXTLVL_RD_CNT</name>
          <description>L1-ICache bus0 Next-Level-Access Counter register</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS0_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-ICache accesses L2-Cache due to bus0 accessing L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS1_ACS_HIT_CNT</name>
          <description>L1-ICache bus1 Hit-Access Counter register</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS1_HIT_CNT</name>
              <description>The register records the number of hits when bus1 accesses L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS1_ACS_MISS_CNT</name>
          <description>L1-ICache bus1 Miss-Access Counter register</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS1_MISS_CNT</name>
              <description>The register records the number of missing when bus1 accesses L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS1_ACS_CONFLICT_CNT</name>
          <description>L1-ICache bus1 Conflict-Access Counter register</description>
          <addressOffset>0x19C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS1_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus1 accesses L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS1_ACS_NXTLVL_RD_CNT</name>
          <description>L1-ICache bus1 Next-Level-Access Counter register</description>
          <addressOffset>0x1A0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS1_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-ICache accesses L2-Cache due to bus1 accessing L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS2_ACS_HIT_CNT</name>
          <description>L1-ICache bus2 Hit-Access Counter register</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS2_HIT_CNT</name>
              <description>The register records the number of hits when bus2 accesses L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS2_ACS_MISS_CNT</name>
          <description>L1-ICache bus2 Miss-Access Counter register</description>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS2_MISS_CNT</name>
              <description>The register records the number of missing when bus2 accesses L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS2_ACS_CONFLICT_CNT</name>
          <description>L1-ICache bus2 Conflict-Access Counter register</description>
          <addressOffset>0x1AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS2_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus2 accesses L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS2_ACS_NXTLVL_RD_CNT</name>
          <description>L1-ICache bus2 Next-Level-Access Counter register</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS2_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-ICache accesses L2-Cache due to bus2 accessing L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS3_ACS_HIT_CNT</name>
          <description>L1-ICache bus3 Hit-Access Counter register</description>
          <addressOffset>0x1B4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS3_HIT_CNT</name>
              <description>The register records the number of hits when bus3 accesses L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS3_ACS_MISS_CNT</name>
          <description>L1-ICache bus3 Miss-Access Counter register</description>
          <addressOffset>0x1B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS3_MISS_CNT</name>
              <description>The register records the number of missing when bus3 accesses L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS3_ACS_CONFLICT_CNT</name>
          <description>L1-ICache bus3 Conflict-Access Counter register</description>
          <addressOffset>0x1BC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS3_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus3 accesses L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_IBUS3_ACS_NXTLVL_RD_CNT</name>
          <description>L1-ICache bus3 Next-Level-Access Counter register</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_IBUS3_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-ICache accesses L2-Cache due to bus3 accessing L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS0_ACS_HIT_CNT</name>
          <description>L1-DCache bus0 Hit-Access Counter register</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS0_HIT_CNT</name>
              <description>The register records the number of hits when bus0 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS0_ACS_MISS_CNT</name>
          <description>L1-DCache bus0 Miss-Access Counter register</description>
          <addressOffset>0x1C8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS0_MISS_CNT</name>
              <description>The register records the number of missing when bus0 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS0_ACS_CONFLICT_CNT</name>
          <description>L1-DCache bus0 Conflict-Access Counter register</description>
          <addressOffset>0x1CC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS0_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus0 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS0_ACS_NXTLVL_RD_CNT</name>
          <description>L1-DCache bus0 Next-Level-Access Counter register</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS0_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-DCache accesses L2-Cache due to bus0 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS0_ACS_NXTLVL_WR_CNT</name>
          <description>L1-DCache bus0 WB-Access Counter register</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS0_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus0 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS1_ACS_HIT_CNT</name>
          <description>L1-DCache bus1 Hit-Access Counter register</description>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS1_HIT_CNT</name>
              <description>The register records the number of hits when bus1 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS1_ACS_MISS_CNT</name>
          <description>L1-DCache bus1 Miss-Access Counter register</description>
          <addressOffset>0x1DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS1_MISS_CNT</name>
              <description>The register records the number of missing when bus1 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS1_ACS_CONFLICT_CNT</name>
          <description>L1-DCache bus1 Conflict-Access Counter register</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS1_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus1 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS1_ACS_NXTLVL_RD_CNT</name>
          <description>L1-DCache bus1 Next-Level-Access Counter register</description>
          <addressOffset>0x1E4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS1_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-DCache accesses L2-Cache due to bus1 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS1_ACS_NXTLVL_WR_CNT</name>
          <description>L1-DCache bus1 WB-Access Counter register</description>
          <addressOffset>0x1E8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS1_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus1 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS2_ACS_HIT_CNT</name>
          <description>L1-DCache bus2 Hit-Access Counter register</description>
          <addressOffset>0x1EC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS2_HIT_CNT</name>
              <description>The register records the number of hits when bus2 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS2_ACS_MISS_CNT</name>
          <description>L1-DCache bus2 Miss-Access Counter register</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS2_MISS_CNT</name>
              <description>The register records the number of missing when bus2 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS2_ACS_CONFLICT_CNT</name>
          <description>L1-DCache bus2 Conflict-Access Counter register</description>
          <addressOffset>0x1F4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS2_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when bus2 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS2_ACS_NXTLVL_RD_CNT</name>
          <description>L1-DCache bus2 Next-Level-Access Counter register</description>
          <addressOffset>0x1F8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS2_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L1-DCache accesses L2-Cache due to bus2 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DBUS2_ACS_NXTLVL_WR_CNT</name>
          <description>L1-DCache bus2 WB-Access Counter register</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L1_DBUS2_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when bus2 accesses L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
