espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>L2_CACHE_CACHESIZE_CONF</name>
          <description>L2 Cache CacheSize mode configure register</description>
          <addressOffset>0x27C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000400</resetValue>
          <fields>
            <field>
              <name>L2_CACHE_CACHESIZE_256</name>
              <description>The field is used to configure cachesize of L2-Cache as 256 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_CACHESIZE_512</name>
              <description>The field is used to configure cachesize of L2-Cache as 512 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_CACHESIZE_1K</name>
              <description>The field is used to configure cachesize of L2-Cache as 1k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_CACHESIZE_2K</name>
              <description>The field is used to configure cachesize of L2-Cache as 2k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_CACHESIZE_4K</name>
              <description>The field is used to configure cachesize of L2-Cache as 4k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_CACHESIZE_8K</name>
              <description>The field is used to configure cachesize of L2-Cache as 8k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_CACHESIZE_16K</name>
              <description>The field is used to configure cachesize of L2-Cache as 16k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_CACHESIZE_32K</name>
              <description>The field is used to configure cachesize of L2-Cache as 32k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_CACHESIZE_64K</name>
              <description>The field is used to configure cachesize of L2-Cache as 64k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_CACHESIZE_128K</name>
              <description>The field is used to configure cachesize of L2-Cache as 128k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_CACHESIZE_256K</name>
              <description>The field is used to configure cachesize of L2-Cache as 256k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_CACHESIZE_512K</name>
              <description>The field is used to configure cachesize of L2-Cache as 512k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_CACHESIZE_1024K</name>
              <description>The field is used to configure cachesize of L2-Cache as 1024k bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_BLOCKSIZE_CONF</name>
          <description>L2 Cache BlockSize mode configure register</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>L2_CACHE_BLOCKSIZE_8</name>
              <description>The field is used to configureblocksize of L2-Cache as 8 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_BLOCKSIZE_16</name>
              <description>The field is used to configureblocksize of L2-Cache as 16 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_BLOCKSIZE_32</name>
              <description>The field is used to configureblocksize of L2-Cache as 32 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_BLOCKSIZE_64</name>
              <description>The field is used to configureblocksize of L2-Cache as 64 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_BLOCKSIZE_128</name>
              <description>The field is used to configureblocksize of L2-Cache as 128 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_BLOCKSIZE_256</name>
              <description>The field is used to configureblocksize of L2-Cache as 256 bytes. This field and all other fields within this register is onehot.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_WRAP_AROUND_CTRL</name>
          <description>Cache wrap around control register</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_WRAP</name>
              <description>Set this bit as 1 to enable L2-Cache wrap around mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_MISS_ACCESS_CTRL</name>
          <description>Cache wrap around control register</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_MISS_DISABLE_ACCESS</name>
              <description>Set this bit as 1 to disable early restart of  L2-Cache</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_FREEZE_CTRL</name>
          <description>Cache Freeze control register</description>
          <addressOffset>0x28C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_FREEZE_EN</name>
              <description>The bit is used to enable freeze operation on L2-Cache. It can be cleared by software.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_FREEZE_MODE</name>
              <description>The bit is used to configure mode of freeze operation L2-Cache. 0: a miss-access will not stuck. 1: a miss-access will stuck.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_FREEZE_DONE</name>
              <description>The bit is used to indicate whether freeze operation on L2-Cache is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_DATA_MEM_ACS_CONF</name>
          <description>Cache data memory access configure register</description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <resetValue>0x00300000</resetValue>
          <fields>
            <field>
              <name>L2_CACHE_DATA_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L2-Cache data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_DATA_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L2-Cache data memoryory. 0: disable, 1: enable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_TAG_MEM_ACS_CONF</name>
          <description>Cache tag memory access configure register</description>
          <addressOffset>0x294</addressOffset>
          <size>0x20</size>
          <resetValue>0x00300000</resetValue>
          <fields>
            <field>
              <name>L2_CACHE_TAG_MEM_RD_EN</name>
              <description>The bit is used to enable config-bus read L2-Cache tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_TAG_MEM_WR_EN</name>
              <description>The bit is used to enable config-bus write L2-Cache tag memoryory. 0: disable, 1: enable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_PRELOCK_CONF</name>
          <description>L2 Cache prelock configure register</description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_PRELOCK_SCT0_EN</name>
              <description>The bit is used to enable the first section of prelock function on L2-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_PRELOCK_SCT1_EN</name>
              <description>The bit is used to enable the second section of prelock function on L2-Cache.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_PRELOCK_RGID</name>
              <description>The bit is used to set  the gid of l2 cache prelock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_PRELOCK_SCT0_ADDR</name>
          <description>L2 Cache prelock section0 address configure register</description>
          <addressOffset>0x29C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_PRELOCK_SCT0_ADDR</name>
              <description>Those bits are used to configure the start address of the first section of prelock on L2-Cache, which should be used together with L2_CACHE_PRELOCK_SCT0_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_PRELOCK_SCT1_ADDR</name>
          <description>L2 Cache prelock section1 address configure register</description>
          <addressOffset>0x2A0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_PRELOCK_SCT1_ADDR</name>
              <description>Those bits are used to configure the start address of the second section of prelock on L2-Cache, which should be used together with L2_CACHE_PRELOCK_SCT1_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_PRELOCK_SCT_SIZE</name>
          <description>L2 Cache prelock section size configure register</description>
          <addressOffset>0x2A4</addressOffset>
          <size>0x20</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>L2_CACHE_PRELOCK_SCT0_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on L2-Cache, which should be used together with L2_CACHE_PRELOCK_SCT0_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_PRELOCK_SCT1_SIZE</name>
              <description>Those bits are used to configure the size of the second section of prelock on L2-Cache, which should be used together with L2_CACHE_PRELOCK_SCT1_ADDR_REG</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_PRELOAD_CTRL</name>
          <description>L2 Cache preload-operation control register</description>
          <addressOffset>0x2A8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>L2_CACHE_PRELOAD_ENA</name>
              <description>The bit is used to enable preload operation on L2-Cache. It will be cleared by hardware automatically after preload operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L2_CACHE_PRELOAD_DONE</name>
              <description>The bit is used to indicate whether preload operation is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_PRELOAD_ORDER</name>
              <description>The bit is used to configure the direction of preload operation. 0: ascending, 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_PRELOAD_RGID</name>
              <description>The bit is used to set  the gid of l2 cache preload.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_PRELOAD_MODE</name>
              <description>Configures the mode of l2 cache preload, 0: load data from next level memory, 1: not load data from next level memory.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_PRELOAD_ADDR</name>
          <description>L2 Cache preload address configure register</description>
          <addressOffset>0x2AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_PRELOAD_ADDR</name>
              <description>Those bits are used to configure the start address of preload on L2-Cache, which should be used together with L2_CACHE_PRELOAD_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_PRELOAD_SIZE</name>
          <description>L2 Cache preload size configure register</description>
          <addressOffset>0x2B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_PRELOAD_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on L2-Cache, which should be used together with L2_CACHE_PRELOAD_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_AUTOLOAD_CTRL</name>
          <description>L2 Cache autoload-operation control register</description>
          <addressOffset>0x2B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>L2_CACHE_AUTOLOAD_ENA</name>
              <description>The bit is used to enable and disable autoload operation on L2-Cache.  1: enable, 0: disable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_DONE</name>
              <description>The bit is used to indicate whether autoload operation on L2-Cache is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_ORDER</name>
              <description>The bit is used to configure the direction of autoload operation on L2-Cache. 0: ascending. 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_TRIGGER_MODE</name>
              <description>The field is used to configure trigger mode of autoload operation on L2-Cache. 0/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT0_ENA</name>
              <description>The bit is used to enable the first section for autoload operation on L2-Cache.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT1_ENA</name>
              <description>The bit is used to enable the second section for autoload operation on L2-Cache.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT2_ENA</name>
              <description>The bit is used to enable the third section for autoload operation on L2-Cache.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT3_ENA</name>
              <description>The bit is used to enable the fourth section for autoload operation on L2-Cache.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_CACHE_AUTOLOAD_RGID</name>
              <description>The bit is used to set  the gid of l2 cache autoload.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_CACHE_AUTOLOAD_SCT0_ADDR</name>
          <description>L2 Cache autoload section 0 address configure register</description>
          <addressOffset>0x2B8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_CACHE_AUTOLOAD_SCT0_ADDR</name>
              <description>Those bits are used to configure the start address of the first section for autoload operation on L2-Cache. Note that it should be used together with L2_CACHE_AUTOLOAD_SCT0_SIZE and L2_CACHE_AUTOLOAD_SCT0_ENA.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
