espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>L2_CACHE_ACS_CNT_CTRL</name>
          <description>Cache Access Counter enable and clear register</description>
          <addressOffset>0x2FC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS0_CNT_ENA</name>
              <description>The bit is used to enable ibus0 counter in L2-Cache.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS1_CNT_ENA</name>
              <description>The bit is used to enable ibus1 counter in L2-Cache.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS2_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS3_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS0_CNT_ENA</name>
              <description>The bit is used to enable dbus0 counter in L2-Cache.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS1_CNT_ENA</name>
              <description>The bit is used to enable dbus1 counter in L2-Cache.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS2_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS3_CNT_ENA</name>
              <description>Reserved</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS0_CNT_CLR</name>
              <description>The bit is used to clear ibus0 counter in L2-Cache.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L2_IBUS1_CNT_CLR</name>
              <description>The bit is used to clear ibus1 counter in L2-Cache.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L2_IBUS2_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_IBUS3_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS0_CNT_CLR</name>
              <description>The bit is used to clear dbus0 counter in L2-Cache.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L2_DBUS1_CNT_CLR</name>
              <description>The bit is used to clear dbus1 counter in L2-Cache.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>L2_DBUS2_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L2_DBUS3_CNT_CLR</name>
              <description>Reserved</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS0_ACS_HIT_CNT</name>
          <description>L2-Cache bus0 Hit-Access Counter register</description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS0_HIT_CNT</name>
              <description>The register records the number of hits when L1-ICache0 accesses L2-Cache due to bus0 accessing L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS0_ACS_MISS_CNT</name>
          <description>L2-Cache bus0 Miss-Access Counter register</description>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS0_MISS_CNT</name>
              <description>The register records the number of missing when L1-ICache0 accesses L2-Cache due to bus0 accessing L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS0_ACS_CONFLICT_CNT</name>
          <description>L2-Cache bus0 Conflict-Access Counter register</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS0_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when L1-ICache0 accesses L2-Cache due to bus0 accessing L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS0_ACS_NXTLVL_RD_CNT</name>
          <description>L2-Cache bus0 Next-Level-Access Counter register</description>
          <addressOffset>0x30C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS0_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L2-Cache accesses external memory due to L1-ICache0 accessing L2-Cache due to bus0 accessing L1-ICache0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS1_ACS_HIT_CNT</name>
          <description>L2-Cache bus1 Hit-Access Counter register</description>
          <addressOffset>0x310</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS1_HIT_CNT</name>
              <description>The register records the number of hits when L1-ICache1 accesses L2-Cache due to bus1 accessing L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS1_ACS_MISS_CNT</name>
          <description>L2-Cache bus1 Miss-Access Counter register</description>
          <addressOffset>0x314</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS1_MISS_CNT</name>
              <description>The register records the number of missing when L1-ICache1 accesses L2-Cache due to bus1 accessing L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS1_ACS_CONFLICT_CNT</name>
          <description>L2-Cache bus1 Conflict-Access Counter register</description>
          <addressOffset>0x318</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS1_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when L1-ICache1 accesses L2-Cache due to bus1 accessing L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS1_ACS_NXTLVL_RD_CNT</name>
          <description>L2-Cache bus1 Next-Level-Access Counter register</description>
          <addressOffset>0x31C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS1_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L2-Cache accesses external memory due to L1-ICache1 accessing L2-Cache due to bus1 accessing L1-ICache1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS2_ACS_HIT_CNT</name>
          <description>L2-Cache bus2 Hit-Access Counter register</description>
          <addressOffset>0x320</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS2_HIT_CNT</name>
              <description>The register records the number of hits when L1-ICache2 accesses L2-Cache due to bus2 accessing L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS2_ACS_MISS_CNT</name>
          <description>L2-Cache bus2 Miss-Access Counter register</description>
          <addressOffset>0x324</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS2_MISS_CNT</name>
              <description>The register records the number of missing when L1-ICache2 accesses L2-Cache due to bus2 accessing L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS2_ACS_CONFLICT_CNT</name>
          <description>L2-Cache bus2 Conflict-Access Counter register</description>
          <addressOffset>0x328</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS2_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when L1-ICache2 accesses L2-Cache due to bus2 accessing L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS2_ACS_NXTLVL_RD_CNT</name>
          <description>L2-Cache bus2 Next-Level-Access Counter register</description>
          <addressOffset>0x32C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS2_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L2-Cache accesses external memory due to L1-ICache2 accessing L2-Cache due to bus2 accessing L1-ICache2.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS3_ACS_HIT_CNT</name>
          <description>L2-Cache bus3 Hit-Access Counter register</description>
          <addressOffset>0x330</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS3_HIT_CNT</name>
              <description>The register records the number of hits when L1-ICache3 accesses L2-Cache due to bus3 accessing L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS3_ACS_MISS_CNT</name>
          <description>L2-Cache bus3 Miss-Access Counter register</description>
          <addressOffset>0x334</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS3_MISS_CNT</name>
              <description>The register records the number of missing when L1-ICache3 accesses L2-Cache due to bus3 accessing L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS3_ACS_CONFLICT_CNT</name>
          <description>L2-Cache bus3 Conflict-Access Counter register</description>
          <addressOffset>0x338</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS3_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when L1-ICache3 accesses L2-Cache due to bus3 accessing L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_IBUS3_ACS_NXTLVL_RD_CNT</name>
          <description>L2-Cache bus3 Next-Level-Access Counter register</description>
          <addressOffset>0x33C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_IBUS3_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L2-Cache accesses external memory due to L1-ICache3 accessing L2-Cache due to bus3 accessing L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS0_ACS_HIT_CNT</name>
          <description>L2-Cache bus0 Hit-Access Counter register</description>
          <addressOffset>0x340</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS0_HIT_CNT</name>
              <description>The register records the number of hits when L1-DCache accesses L2-Cache due to bus0 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS0_ACS_MISS_CNT</name>
          <description>L2-Cache bus0 Miss-Access Counter register</description>
          <addressOffset>0x344</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS0_MISS_CNT</name>
              <description>The register records the number of missing when L1-DCache accesses L2-Cache due to bus0 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS0_ACS_CONFLICT_CNT</name>
          <description>L2-Cache bus0 Conflict-Access Counter register</description>
          <addressOffset>0x348</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS0_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when L1-DCache accesses L2-Cache due to bus0 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS0_ACS_NXTLVL_RD_CNT</name>
          <description>L2-Cache bus0 Next-Level-Access Counter register</description>
          <addressOffset>0x34C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS0_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L2-Cache accesses external memory due to L1-DCache accessing L2-Cache due to bus0 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS0_ACS_NXTLVL_WR_CNT</name>
          <description>L2-Cache bus0 WB-Access Counter register</description>
          <addressOffset>0x350</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS0_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when L1-DCache accesses L2-Cache due to bus0 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS1_ACS_HIT_CNT</name>
          <description>L2-Cache bus1 Hit-Access Counter register</description>
          <addressOffset>0x354</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS1_HIT_CNT</name>
              <description>The register records the number of hits when L1-DCache accesses L2-Cache due to bus1 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS1_ACS_MISS_CNT</name>
          <description>L2-Cache bus1 Miss-Access Counter register</description>
          <addressOffset>0x358</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS1_MISS_CNT</name>
              <description>The register records the number of missing when L1-DCache accesses L2-Cache due to bus1 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS1_ACS_CONFLICT_CNT</name>
          <description>L2-Cache bus1 Conflict-Access Counter register</description>
          <addressOffset>0x35C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS1_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when L1-DCache accesses L2-Cache due to bus1 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS1_ACS_NXTLVL_RD_CNT</name>
          <description>L2-Cache bus1 Next-Level-Access Counter register</description>
          <addressOffset>0x360</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS1_NXTLVL_RD_CNT</name>
              <description>The register records the number of times that L2-Cache accesses external memory due to L1-DCache accessing L2-Cache due to bus1 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS1_ACS_NXTLVL_WR_CNT</name>
          <description>L2-Cache bus1 WB-Access Counter register</description>
          <addressOffset>0x364</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS1_NXTLVL_WR_CNT</name>
              <description>The register records the number of write back when L1-DCache accesses L2-Cache due to bus1 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS2_ACS_HIT_CNT</name>
          <description>L2-Cache bus2 Hit-Access Counter register</description>
          <addressOffset>0x368</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS2_HIT_CNT</name>
              <description>The register records the number of hits when L1-DCache accesses L2-Cache due to bus2 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS2_ACS_MISS_CNT</name>
          <description>L2-Cache bus2 Miss-Access Counter register</description>
          <addressOffset>0x36C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS2_MISS_CNT</name>
              <description>The register records the number of missing when L1-DCache accesses L2-Cache due to bus2 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L2_DBUS2_ACS_CONFLICT_CNT</name>
          <description>L2-Cache bus2 Conflict-Access Counter register</description>
          <addressOffset>0x370</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L2_DBUS2_CONFLICT_CNT</name>
              <description>The register records the number of access-conflicts when L1-DCache accesses L2-Cache due to bus2 accessing L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
