espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register derivedFrom="DMA.DATE">
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x7FC</addressOffset>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ECC</name>
      <description>ECC (ECC Hardware Accelerator)</description>
      <groupName>ECC</groupName>
      <baseAddress>0x600A8000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x138</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MULT_INT_RAW</name>
          <description>ECC raw interrupt status register</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALC_DONE</name>
              <description>The raw interrupt status of the ECC_CALC_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULT_INT_ST</name>
          <description>ECC masked interrupt status register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALC_DONE</name>
              <description>The masked interrupt status of the ECC_CALC_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULT_INT_ENA</name>
          <description>ECC interrupt enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALC_DONE</name>
              <description>Write 1 to enable the ECC_CALC_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULT_INT_CLR</name>
          <description>ECC interrupt clear register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALC_DONE</name>
              <description>Write 1 to clear the ECC_CALC_DONE_INT interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MULT_CONF</name>
          <description>ECC configuration register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>START</name>
              <description>Configures whether to start calculation of ECC Accelerator. This bit will be self-cleared after the calculation is done. \\
0: No effect\\
1: Start calculation of ECC Accelerator\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Configures whether to reset ECC Accelerator. \\
0: No effect\\
1: Reset\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEY_LENGTH</name>
              <description>Configures the key length mode bit of ECC Accelerator. \\
0: P-192\\
1: P-256\\
2: P-384\\
3: SM2.\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>KEY_LENGTH</name>
                <enumeratedValue>
                  <name>P192</name>
                  <description>P-192 elliptic curve</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P256</name>
                  <description>P-256 elliptic curve</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P384</name>
                  <description>P-384 elliptic curve</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOD_BASE</name>
              <description>Configures the mod base of mod operation, only valid in work_mode 8-11. \\
0: n(order of curve)\\
1: p(mod base of curve)\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WORK_MODE</name>
              <description>Configures the work mode of ECC Accelerator.\\
0: Point Multi mode\\
1: Reserved\\
2: Point Verif mode\\
3: Point Verif + Multi mode\\
4: Jacobian Point Multi mode\\
5: Reserved\\
6: Jacobian Point Verif mode\\
7: Point Verif + Jacobian Point Multi mode\\
8: Mod Add mode\\
9. Mod Sub mode\\
10: Mod Multi mode\\
11: Mod Div mode\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECURITY_MODE</name>
              <description>Configures the security mode of ECC Accelerator.\\
0: no secure function enabled.\\
1: enable constant-time calculation in all point multiplication modes.\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VERIFICATION_RESULT</name>
              <description>Represents the verification result of ECC Accelerator, valid only when calculation is done.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to force on register clock gate. \\
0: No effect\\
1: Force on\\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_CLOCK_GATE_FORCE_ON</name>
              <description>Configures whether to force on ECC memory clock gate. \\
0: No effect\\
1: Force on\\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
