espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register derivedFrom="DMA.DATE">
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xFC</addressOffset>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>K_MEM%s</name>
          <description>The memory that stores k.</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PX_MEM%s</name>
          <description>The memory that stores Px.</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PY_MEM%s</name>
          <description>The memory that stores Py.</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>QX_MEM%s</name>
          <description>The memory that stores Qx.</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>QY_MEM%s</name>
          <description>The memory that stores Qy.</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>QZ_MEM%s</name>
          <description>The memory that stores Qz.</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ECDSA</name>
      <description>ECDSA (Elliptic Curve Digital Signature Algorithm) Accelerator</description>
      <groupName>ECDSA</groupName>
      <baseAddress>0x600AA000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x168</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CONF</name>
          <description>ECDSA configure register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WORK_MODE</name>
              <description>The work mode bits of ECDSA Accelerator. 0: Signature Verify Mode. 1: Signature Generate Mode. 2: Export Public Key Mode. 3: invalid.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_CURVE</name>
              <description>The ecc curve select bit of ECDSA Accelerator.  0: P-192. 1: P-256. 2: P-384 3: SM2.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTWARE_SET_K</name>
              <description>The source of k select bit. 0: k is automatically generated by hardware. 1: k is written by software.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTWARE_SET_Z</name>
              <description>The source of z select bit. 0: z is generated from SHA result. 1: z is written by software.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DETERMINISTIC_K</name>
              <description>The source of hardware generated k. 0: k is generated by TRNG. 1: k is generated by deterministic derivation algorithm.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK</name>
          <description>ECDSA clock gate register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GATE_FORCE_ON</name>
              <description>Write 1 to force on register clock gate.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>ECDSA interrupt raw register, valid in level.</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PREP_DONE</name>
              <description>The raw interrupt status bit  for the ecdsa_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROC_DONE</name>
              <description>The raw interrupt status bit  for the ecdsa_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POST_DONE</name>
              <description>The raw interrupt status bit  for the ecdsa_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHA_RELEASE</name>
              <description>The raw interrupt status bit  for the ecdsa_sha_release_int interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>ECDSA interrupt status register.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PREP_DONE</name>
              <description>The masked interrupt status bit  for the ecdsa_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROC_DONE</name>
              <description>The masked interrupt status bit  for the ecdsa_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POST_DONE</name>
              <description>The masked interrupt status bit  for the ecdsa_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHA_RELEASE</name>
              <description>The masked interrupt status bit  for the ecdsa_sha_release_int interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>ECDSA interrupt enable register.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PREP_DONE</name>
              <description>The interrupt enable bit  for the ecdsa_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC_DONE</name>
              <description>The interrupt enable bit  for the ecdsa_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POST_DONE</name>
              <description>The interrupt enable bit  for the ecdsa_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA_RELEASE</name>
              <description>The interrupt enable bit  for the ecdsa_sha_release_int interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>ECDSA interrupt clear register.</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PREP_DONE</name>
              <description>Set this bit to clear the ecdsa_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PROC_DONE</name>
              <description>Set this bit to clear the ecdsa_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>POST_DONE</name>
              <description>Set this bit to clear the ecdsa_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SHA_RELEASE</name>
              <description>Set this bit to clear the ecdsa_sha_release_int interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>START</name>
          <description>ECDSA start register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>START</name>
              <description>Write 1 to start caculation of ECDSA Accelerator. This bit will be self-cleared after configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LOAD_DONE</name>
              <description>Write 1 to input load done signal of ECDSA Accelerator. This bit will be self-cleared after configuration.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GET_DONE</name>
              <description>Write 1 to input get done signal of ECDSA Accelerator. This bit will be self-cleared after configuration.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>ECDSA status register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUSY</name>
              <description>The status bits of ECDSA Accelerator. ECDSA is at 0: IDLE, 1: LOAD, 2: GET, 3: BUSY state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>ECDSA result register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OPERATION_RESULT</name>
              <description>The operation result bit of ECDSA Accelerator, only valid when ECDSA calculation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
