espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>RD_REPEAT_DATA_ERR0</name>
          <description>Represents rd_repeat_data_err</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RD_DIS_ERR</name>
              <description>Represents the programming error of EFUSE_RD_DIS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_JTAG_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_USB_JTAG</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_SERIAL_JTAG_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_USB_SERIAL_JTAG</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_FORCE_DOWNLOAD_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_FORCE_DOWNLOAD</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DOWNLOAD_MSPI_DIS_ERR</name>
              <description>Represents the programming error of EFUSE_SPI_DOWNLOAD_MSPI_DIS</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_TWAI_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_TWAI</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>JTAG_SEL_ENABLE_ERR</name>
              <description>Represents the programming error of EFUSE_JTAG_SEL_ENABLE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_PAD_JTAG_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_PAD_JTAG</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_DOWNLOAD_MANUAL_ENCRYPT_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_DOWNLOAD_MANUAL_ENCRYPT</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVT_GLITCH_EN_ERR</name>
              <description>Represents the programming error of EFUSE_PVT_GLITCH_EN</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVT_GLITCH_MODE_ERR</name>
              <description>Represents the programming error of EFUSE_PVT_GLITCH_MODE</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_CORE1_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_CORE1</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_BOOT_CRYPT_CNT_ERR</name>
              <description>Represents the programming error of EFUSE_SPI_BOOT_CRYPT_CNT</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE0_ERR</name>
              <description>Represents the programming error of EFUSE_SECURE_BOOT_KEY_REVOKE0</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE1_ERR</name>
              <description>Represents the programming error of EFUSE_SECURE_BOOT_KEY_REVOKE1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE2_ERR</name>
              <description>Represents the programming error of EFUSE_SECURE_BOOT_KEY_REVOKE2</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA_ERR1</name>
          <description>Represents rd_repeat_data_err</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>KEY_PURPOSE_0_ERR</name>
              <description>Represents the programming error of EFUSE_KEY_PURPOSE_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_1_ERR</name>
              <description>Represents the programming error of EFUSE_KEY_PURPOSE_1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_2_ERR</name>
              <description>Represents the programming error of EFUSE_KEY_PURPOSE_2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_3_ERR</name>
              <description>Represents the programming error of EFUSE_KEY_PURPOSE_3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_4_ERR</name>
              <description>Represents the programming error of EFUSE_KEY_PURPOSE_4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_5_ERR</name>
              <description>Represents the programming error of EFUSE_KEY_PURPOSE_5</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEC_DPA_LEVEL_ERR</name>
              <description>Represents the programming error of EFUSE_SEC_DPA_LEVEL</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA_ERR2</name>
          <description>Represents rd_repeat_data_err</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XTS_DPA_PSEUDO_LEVEL_ERR</name>
              <description>Represents the programming error of EFUSE_XTS_DPA_PSEUDO_LEVEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XTS_DPA_CLK_ENABLE_ERR</name>
              <description>Represents the programming error of EFUSE_XTS_DPA_CLK_ENABLE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECC_FORCE_CONST_TIME_ERR</name>
              <description>Represents the programming error of EFUSE_ECC_FORCE_CONST_TIME</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECDSA_P384_ENABLE_ERR</name>
              <description>Represents the programming error of EFUSE_ECDSA_P384_ENABLE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_EN_ERR</name>
              <description>Represents the programming error of EFUSE_SECURE_BOOT_EN</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_AGGRESSIVE_REVOKE_ERR</name>
              <description>Represents the programming error of EFUSE_SECURE_BOOT_AGGRESSIVE_REVOKE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KM_DISABLE_DEPLOY_MODE_ERR</name>
              <description>Represents the programming error of EFUSE_KM_DISABLE_DEPLOY_MODE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KM_RND_SWITCH_CYCLE_ERR</name>
              <description>Represents the programming error of EFUSE_KM_RND_SWITCH_CYCLE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KM_DEPLOY_ONLY_ONCE_ERR</name>
              <description>Represents the programming error of EFUSE_KM_DEPLOY_ONLY_ONCE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_USE_KEY_MANAGER_KEY_ERR</name>
              <description>Represents the programming error of EFUSE_FORCE_USE_KEY_MANAGER_KEY</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_DISABLE_SW_INIT_KEY_ERR</name>
              <description>Represents the programming error of EFUSE_FORCE_DISABLE_SW_INIT_KEY</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KM_XTS_KEY_LENGTH_256_ERR</name>
              <description>Represents the programming error of EFUSE_KM_XTS_KEY_LENGTH_256</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK_KM_KEY_ERR</name>
              <description>Represents the programming error of EFUSE_LOCK_KM_KEY</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_TPUW_ERR</name>
              <description>Represents the programming error of EFUSE_FLASH_TPUW</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_DOWNLOAD_MODE_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_DOWNLOAD_MODE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA_ERR3</name>
          <description>Represents rd_repeat_data_err</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DIS_DIRECT_BOOT_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_DIRECT_BOOT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_SERIAL_JTAG_ROM_PRINT_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_USB_SERIAL_JTAG_ROM_PRINT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE_ERR</name>
              <description>Represents the programming error of EFUSE_DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE_SECURITY_DOWNLOAD_ERR</name>
              <description>Represents the programming error of EFUSE_ENABLE_SECURITY_DOWNLOAD</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_PRINT_CONTROL_ERR</name>
              <description>Represents the programming error of EFUSE_UART_PRINT_CONTROL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_SEND_RESUME_ERR</name>
              <description>Represents the programming error of EFUSE_FORCE_SEND_RESUME</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_VERSION_ERR</name>
              <description>Represents the programming error of EFUSE_SECURE_VERSION</description>
              <bitOffset>7</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HUK_GEN_STATE_ERR</name>
              <description>Represents the programming error of EFUSE_HUK_GEN_STATE</description>
              <bitOffset>23</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_LDO_EFUSE_SEL_ERR</name>
              <description>Represents the programming error of EFUSE_FLASH_LDO_EFUSE_SEL</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA_ERR4</name>
          <description>Represents rd_repeat_data_err</description>
          <addressOffset>0x18C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>USB_DREFH_ERR</name>
              <description>Represents the programming error of EFUSE_USB_DREFH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_DREFL_ERR</name>
              <description>Represents the programming error of EFUSE_USB_DREFL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_OTG_FS_DREFH_ERR</name>
              <description>Represents the programming error of EFUSE_USB_OTG_FS_DREFH</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_OTG_FS_DREFL_ERR</name>
              <description>Represents the programming error of EFUSE_USB_OTG_FS_DREFL</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_EXCHG_PINS_ERR</name>
              <description>Represents the programming error of EFUSE_USB_EXCHG_PINS</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_OTG_FS_EXCHG_PINS_ERR</name>
              <description>Represents the programming error of EFUSE_USB_OTG_FS_EXCHG_PINS</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB_PHY_SEL_ERR</name>
              <description>Represents the programming error of EFUSE_USB_PHY_SEL</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SOFT_DIS_JTAG_ERR</name>
              <description>Represents the programming error of EFUSE_SOFT_DIS_JTAG</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IO_LDO_ADJUST_ERR</name>
              <description>Represents the programming error of EFUSE_IO_LDO_ADJUST</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IO_LDO_1P8_ERR</name>
              <description>Represents the programming error of EFUSE_IO_LDO_1P8</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDC_CCM_EN_ERR</name>
              <description>Represents the programming error of EFUSE_DCDC_CCM_EN</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
