espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register derivedFrom="DMA.DATE">
          <name>DATE</name>
          <description>eFuse version register.</description>
          <addressOffset>0x198</addressOffset>
        </register>
        <register>
          <name>CLK</name>
          <description>eFuse clcok configuration register.</description>
          <addressOffset>0x1C8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>MEM_FORCE_PD</name>
              <description>Configures whether to force power down eFuse SRAM.\\ 1: Force\\ 0: No effect\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_CLK_FORCE_ON</name>
              <description>Configures whether to force activate clock signal of eFuse SRAM.\\ 1: Force activate\\ 0: No effect\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_FORCE_PU</name>
              <description>Configures whether to force power up eFuse SRAM.\\ 1: Force\\ 0: No effect\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Configures whether to force enable eFuse register configuration clock signal.\\ 1: Force\\ 0: The clock is enabled only during the reading and writing of registers\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>eFuse operation mode configuraiton register</description>
          <addressOffset>0x1CC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OP_CODE</name>
              <description>Configures operation command type.\\ 0x5A5A: Program operation command\\ 0x5AA5: Read operation command\\ Other values: No effect\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECDSA</name>
          <description>eFuse status register.</description>
          <addressOffset>0x1D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CFG_ECDSA_P192_BLK</name>
              <description>Configures which block to use for ECDSA P192 key output.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_ECDSA_P256_BLK</name>
              <description>Configures which block to use for ECDSA P256 key output.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_ECDSA_P384_L_BLK</name>
              <description>Configures which block to use for ECDSA P384 key low part output.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFG_ECDSA_P384_H_BLK</name>
              <description>Configures which block to use for ECDSA P256 key high part output.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUR_ECDSA_P192_BLK</name>
              <description>Represents which block is used for ECDSA P192 key output.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CUR_ECDSA_P256_BLK</name>
              <description>Represents which block is used for ECDSA P256 key output.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CUR_ECDSA_P384_L_BLK</name>
              <description>Represents which block is used for ECDSA P384 key low part output.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CUR_ECDSA_P384_H_BLK</name>
              <description>Represents which block is used for ECDSA P384 key high part output.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>eFuse status register.</description>
          <addressOffset>0x1D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATE</name>
              <description>Represents the state of the eFuse state machine.\\ 0: Reset state, the initial state after power-up\\ 1: Idle state\\ Other values: Non-idle state\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTP_LOAD_SW</name>
              <description>Represents the value of OTP_LOAD_SW.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTP_VDDQ_C_SYNC2</name>
              <description>Represents the value of OTP_VDDQ_C_SYNC2.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTP_STROBE_SW</name>
              <description>Represents the value of OTP_STROBE_SW.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTP_CSB_SW</name>
              <description>Represents the value of OTP_CSB_SW.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTP_PGENB_SW</name>
              <description>Represents the value of OTP_PGENB_SW.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTP_VDDQ_IS_SW</name>
              <description>Represents the value of OTP_VDDQ_IS_SW.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BLK0_VALID_BIT_CNT</name>
              <description>Represents the number of block valid bit.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>eFuse command register.</description>
          <addressOffset>0x1D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>READ_CMD</name>
              <description>Configures whether to send read commands.\\ 1: Send\\ 0: No effect\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGM_CMD</name>
              <description>Configures whether to send programing commands.\\ 1: Send\\ 0: No effect\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLK_NUM</name>
              <description>Configures the serial number of the block to be programmed. Value 0-10 corresponds to block number 0-10, respectively.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>eFuse raw interrupt register.</description>
          <addressOffset>0x1DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>READ_DONE</name>
              <description>The raw interrupt status of EFUSE_READ_DONE_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PGM_DONE</name>
              <description>The raw interrupt status of EFUSE_PGM_DONE_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>eFuse interrupt status register.</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>READ_DONE</name>
              <description>The masked interrupt status of EFUSE_READ_DONE_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PGM_DONE</name>
              <description>The masked interrupt status of EFUSE_PGM_DONE_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>eFuse interrupt enable register.</description>
          <addressOffset>0x1E4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>READ_DONE</name>
              <description>Write 1 to enable EFUSE_READ_DONE_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PGM_DONE</name>
              <description>Write 1 to enable EFUSE_PGM_DONE_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>eFuse interrupt clear register.</description>
          <addressOffset>0x1E8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>READ_DONE</name>
              <description>Write 1 to clear EFUSE_READ_DONE_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PGM_DONE</name>
              <description>Write 1 to clear EFUSE_PGM_DONE_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_CONF</name>
          <description>Controls the eFuse programming voltage.</description>
          <addressOffset>0x1EC</addressOffset>
          <size>0x20</size>
          <resetValue>0x0001FE13</resetValue>
          <fields>
            <field>
              <name>DAC_CLK_DIV</name>
              <description>Configures the division factor of the rising clock of the programming voltage.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_CLK_PAD_SEL</name>
              <description>Don't care.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_NUM</name>
              <description>Configures clock cycles for programming voltage to rise. Measurement unit: a clock cycle divided by EFUSE_DAC_CLK_DIV.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OE_CLR</name>
              <description>Configures whether to reduce the power supply of programming voltage.\\ 0: Not reduce\\ 1: Reduce\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_TIM_CONF</name>
          <description>Configures read timing parameters.</description>
          <addressOffset>0x1F0</addressOffset>
          <size>0x20</size>
          <resetValue>0x12010201</resetValue>
          <fields>
            <field>
              <name>THR_A</name>
              <description>Configures the read hold time. Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRD</name>
              <description>Configures the read time. Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSUR_A</name>
              <description>Configures the read setup time. Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_INIT_NUM</name>
              <description>Configures the waiting time of reading eFuse memory. Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_TIM_CONF1</name>
          <description>Configurarion register 1 of eFuse programming timing parameters.</description>
          <addressOffset>0x1F4</addressOffset>
          <size>0x20</size>
          <resetValue>0x01266701</resetValue>
          <fields>
            <field>
              <name>TSUP_A</name>
              <description>Configures the programming setup time. Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWR_ON_NUM</name>
              <description>Configures the power up time for VDDQ. Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THP_A</name>
              <description>Configures the programming hold time. Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_TIM_CONF2</name>
          <description>Configurarion register 2 of eFuse programming timing parameters.</description>
          <addressOffset>0x1F8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00A00140</resetValue>
          <fields>
            <field>
              <name>PWR_OFF_NUM</name>
              <description>Configures the power outage time for VDDQ. Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TPGM</name>
              <description>Configures the active programming time. Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_TIM_CONF0_RS_BYPASS</name>
          <description>Configurarion register0 of eFuse programming time parameters and rs bypass operation.</description>
          <addressOffset>0x1FC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00002000</resetValue>
          <fields>
            <field>
              <name>BYPASS_RS_CORRECTION</name>
              <description>Configures whether to bypass the Reed-Solomon (RS) correction step.\\ 0: Not bypass\\ 1: Bypass\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_RS_BLK_NUM</name>
              <description>Configures which block number to bypass the Reed-Solomon (RS) correction step.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATE</name>
              <description>Configures whether to update multi-bit register signals.\\ 1: Update\\ 0: No effect\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TPGM_INACTIVE</name>
              <description>Configures the inactive programming time. Measurement unit: One cycle of the eFuse core clock.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_WR_DIS</name>
          <description>eFuse apb2otp block0 data register1.</description>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_WR_DIS</name>
              <description>Otp block0 write disable data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W1</name>
          <description>eFuse apb2otp block0 data register2.</description>
          <addressOffset>0x504</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W1</name>
              <description>Otp block0 backup1 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W2</name>
          <description>eFuse apb2otp block0 data register3.</description>
          <addressOffset>0x508</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W2</name>
              <description>Otp block0 backup1 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W3</name>
          <description>eFuse apb2otp block0 data register4.</description>
          <addressOffset>0x50C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W3</name>
              <description>Otp block0 backup1 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W4</name>
          <description>eFuse apb2otp block0 data register5.</description>
          <addressOffset>0x510</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W4</name>
              <description>Otp block0 backup1 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP1_W5</name>
          <description>eFuse apb2otp block0 data register6.</description>
          <addressOffset>0x514</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP1_W5</name>
              <description>Otp block0 backup1 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP2_W1</name>
          <description>eFuse apb2otp block0 data register7.</description>
          <addressOffset>0x518</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP2_W1</name>
              <description>Otp block0 backup2 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
