espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>APB2OTP_BLK3_W11</name>
          <description>eFuse apb2otp block3 data register11.</description>
          <addressOffset>0x5CC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W11</name>
              <description>Otp block3 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W1</name>
          <description>eFuse apb2otp BLOCK7 data register1.</description>
          <addressOffset>0x5D0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W1</name>
              <description>Otp block4 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W2</name>
          <description>eFuse apb2otp block4 data register2.</description>
          <addressOffset>0x5D4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W2</name>
              <description>Otp block4 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W3</name>
          <description>eFuse apb2otp block4 data register3.</description>
          <addressOffset>0x5D8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W3</name>
              <description>Otp block4 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W4</name>
          <description>eFuse apb2otp block4 data register4.</description>
          <addressOffset>0x5DC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W4</name>
              <description>Otp block4 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W5</name>
          <description>eFuse apb2otp block4 data register5.</description>
          <addressOffset>0x5E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W5</name>
              <description>Otp block4 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W6</name>
          <description>eFuse apb2otp block4 data register6.</description>
          <addressOffset>0x5E4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W6</name>
              <description>Otp block4 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W7</name>
          <description>eFuse apb2otp block4 data register7.</description>
          <addressOffset>0x5E8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W7</name>
              <description>Otp block4 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W8</name>
          <description>eFuse apb2otp block4 data register8.</description>
          <addressOffset>0x5EC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W8</name>
              <description>Otp block4 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W9</name>
          <description>eFuse apb2otp block4 data register9.</description>
          <addressOffset>0x5F0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W9</name>
              <description>Otp block4 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W10</name>
          <description>eFuse apb2otp block4 data registe10.</description>
          <addressOffset>0x5F4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W10</name>
              <description>Otp block4 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W11</name>
          <description>eFuse apb2otp block4 data register11.</description>
          <addressOffset>0x5F8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W11</name>
              <description>Otp block4 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W1</name>
          <description>eFuse apb2otp block5 data register1.</description>
          <addressOffset>0x5FC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W1</name>
              <description>Otp block5 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W2</name>
          <description>eFuse apb2otp block5 data register2.</description>
          <addressOffset>0x600</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W2</name>
              <description>Otp block5 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W3</name>
          <description>eFuse apb2otp block5 data register3.</description>
          <addressOffset>0x604</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W3</name>
              <description>Otp block5 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W4</name>
          <description>eFuse apb2otp block5 data register4.</description>
          <addressOffset>0x608</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W4</name>
              <description>Otp block5 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W5</name>
          <description>eFuse apb2otp block5 data register5.</description>
          <addressOffset>0x60C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W5</name>
              <description>Otp block5 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W6</name>
          <description>eFuse apb2otp block5 data register6.</description>
          <addressOffset>0x610</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W6</name>
              <description>Otp block5 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W7</name>
          <description>eFuse apb2otp block5 data register7.</description>
          <addressOffset>0x614</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W7</name>
              <description>Otp block5 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W8</name>
          <description>eFuse apb2otp block5 data register8.</description>
          <addressOffset>0x618</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W8</name>
              <description>Otp block5 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W9</name>
          <description>eFuse apb2otp block5 data register9.</description>
          <addressOffset>0x61C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W9</name>
              <description>Otp block5 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W10</name>
          <description>eFuse apb2otp block5 data register10.</description>
          <addressOffset>0x620</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W10</name>
              <description>Otp block5 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK5_W11</name>
          <description>eFuse apb2otp block5 data register11.</description>
          <addressOffset>0x624</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK5_W11</name>
              <description>Otp block5 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W1</name>
          <description>eFuse apb2otp block6 data register1.</description>
          <addressOffset>0x628</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W1</name>
              <description>Otp block6 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W2</name>
          <description>eFuse apb2otp block6 data register2.</description>
          <addressOffset>0x62C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W2</name>
              <description>Otp block6 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W3</name>
          <description>eFuse apb2otp block6 data register3.</description>
          <addressOffset>0x630</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W3</name>
              <description>Otp block6 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W4</name>
          <description>eFuse apb2otp block6 data register4.</description>
          <addressOffset>0x634</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W4</name>
              <description>Otp block6 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W5</name>
          <description>eFuse apb2otp block6 data register5.</description>
          <addressOffset>0x638</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W5</name>
              <description>Otp block6 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W6</name>
          <description>eFuse apb2otp block6 data register6.</description>
          <addressOffset>0x63C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W6</name>
              <description>Otp block6 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W7</name>
          <description>eFuse apb2otp block6 data register7.</description>
          <addressOffset>0x640</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W7</name>
              <description>Otp block6 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W8</name>
          <description>eFuse apb2otp block6 data register8.</description>
          <addressOffset>0x644</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W8</name>
              <description>Otp block6 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W9</name>
          <description>eFuse apb2otp block6 data register9.</description>
          <addressOffset>0x648</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W9</name>
              <description>Otp block6 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W10</name>
          <description>eFuse apb2otp block6 data register10.</description>
          <addressOffset>0x64C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W10</name>
              <description>Otp block6 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK6_W11</name>
          <description>eFuse apb2otp block6 data register11.</description>
          <addressOffset>0x650</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK6_W11</name>
              <description>Otp block6 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W1</name>
          <description>eFuse apb2otp block7 data register1.</description>
          <addressOffset>0x654</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W1</name>
              <description>Otp block7 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W2</name>
          <description>eFuse apb2otp block7 data register2.</description>
          <addressOffset>0x658</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W2</name>
              <description>Otp block7 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W3</name>
          <description>eFuse apb2otp block7 data register3.</description>
          <addressOffset>0x65C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W3</name>
              <description>Otp block7 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W4</name>
          <description>eFuse apb2otp block7 data register4.</description>
          <addressOffset>0x660</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W4</name>
              <description>Otp block7 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W5</name>
          <description>eFuse apb2otp block7 data register5.</description>
          <addressOffset>0x664</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W5</name>
              <description>Otp block7 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W6</name>
          <description>eFuse apb2otp block7 data register6.</description>
          <addressOffset>0x668</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W6</name>
              <description>Otp block7 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W7</name>
          <description>eFuse apb2otp block7 data register7.</description>
          <addressOffset>0x66C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W7</name>
              <description>Otp block7 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W8</name>
          <description>eFuse apb2otp block7 data register8.</description>
          <addressOffset>0x670</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W8</name>
              <description>Otp block7 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W9</name>
          <description>eFuse apb2otp block7 data register9.</description>
          <addressOffset>0x674</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W9</name>
              <description>Otp block7 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK7_W10</name>
          <description>eFuse apb2otp block7 data register10.</description>
          <addressOffset>0x678</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK7_W10</name>
              <description>Otp block7 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
