espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register derivedFrom="DMA.DATE">
          <name>DATE</name>
          <description>GPIO version register</description>
          <addressOffset>0xDFC</addressOffset>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO_SD</name>
      <description>Sigma-Delta Modulation</description>
      <groupName>GPIOSD</groupName>
      <baseAddress>0x60093E00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock Gating Configure Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Clock enable bit of configuration registers for sigma delta modulation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGMADELTA_MISC</name>
          <description>MISC Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FUNCTION_CLK_EN</name>
              <description>Configures whether or not to enable the clock for sigma delta modulation.\\
0: Not enable\\
1: Enable\\%\label{fielddesc:GPIOSDSPISWAP}- [GPIOSD_SPI_SWAP] Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SIGMADELTA%s</name>
          <description>Duty cycle configuration register for SDM channel %s</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000FF00</resetValue>
          <fields>
            <field>
              <name>IN</name>
              <description>Configures the duty cycle of sigma delta modulation output. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESCALE</name>
              <description>Configures the divider value to divide IO MUX operating clock. \\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GLITCH_FILTER_CH%s</name>
          <description>Glitch Filter Configure Register of Channel%s</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Configures whether or not to enable channel %s of Glitch Filter.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_IO_NUM</name>
              <description>Configures to select the input GPIO for Glitch Filter. \\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
38: Select GPIO38\\
39: Select GPIO39\\
40 ~ 63: Reserved\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WINDOW_THRES</name>
              <description>Configures the window threshold for Glitch Filter. The window threshold should be less than or equal to GPIOSD_FILTER_CH%s_WINDOW_WIDTH.\\  %see DOC-4768\\
Measurement unit: IO MUX operating clock cycle\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WINDOW_WIDTH</name>
              <description>Configures the window width for Glitch Filter. The effective value of window width is 0 ~ 63. \\
Measurement unit: IO MUX operating clock cycle\\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ETM_EVENT_CH%s_CFG</name>
          <description>ETM configuration register for channel %s</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ETM_CH_EVENT_SEL</name>
              <description>Configures to select GPIO for ETM event channel.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
38: Select GPIO38\\
39: Select GPIO39\\
40 ~ 63: Reserved\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_CH_EVENT_EN</name>
              <description>Configures whether or not to enable ETM event send.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P0_CFG</name>
          <description>GPIO selection register 0 for ETM</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>0-4</dimIndex>
              <name>GPIO%s_SEL</name>
              <description>Select GPIO%s for ETM task</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>0-4</dimIndex>
              <name>GPIO%s_EN</name>
              <description>Enable GPIO%s for ETM task</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P1_CFG</name>
          <description>GPIO selection register 1 for ETM</description>
          <addressOffset>0x15C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>5-9</dimIndex>
              <name>GPIO%s_SEL</name>
              <description>Select GPIO%s for ETM task</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>5-9</dimIndex>
              <name>GPIO%s_EN</name>
              <description>Enable GPIO%s for ETM task</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P2_CFG</name>
          <description>GPIO selection register 2 for ETM</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>10-14</dimIndex>
              <name>GPIO%s_SEL</name>
              <description>Select GPIO%s for ETM task</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>10-14</dimIndex>
              <name>GPIO%s_EN</name>
              <description>Enable GPIO%s for ETM task</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P3_CFG</name>
          <description>GPIO selection register 3 for ETM</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>15-19</dimIndex>
              <name>GPIO%s_SEL</name>
              <description>Select GPIO%s for ETM task</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>15-19</dimIndex>
              <name>GPIO%s_EN</name>
              <description>Enable GPIO%s for ETM task</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P4_CFG</name>
          <description>GPIO selection register 4 for ETM</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>20-24</dimIndex>
              <name>GPIO%s_SEL</name>
              <description>Select GPIO%s for ETM task</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>20-24</dimIndex>
              <name>GPIO%s_EN</name>
              <description>Enable GPIO%s for ETM task</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P5_CFG</name>
          <description>GPIO selection register 5 for ETM</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>25-29</dimIndex>
              <name>GPIO%s_SEL</name>
              <description>Select GPIO%s for ETM task</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>25-29</dimIndex>
              <name>GPIO%s_EN</name>
              <description>Enable GPIO%s for ETM task</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P6_CFG</name>
          <description>GPIO selection register 6 for ETM</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>30-34</dimIndex>
              <name>GPIO%s_SEL</name>
              <description>Select GPIO%s for ETM task</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>30-34</dimIndex>
              <name>GPIO%s_EN</name>
              <description>Enable GPIO%s for ETM task</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_TASK_P7_CFG</name>
          <description>GPIO selection register 7 for ETM</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>35-39</dimIndex>
              <name>GPIO%s_SEL</name>
              <description>Select GPIO%s for ETM task</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>5</dim>
              <dimIncrement>0x6</dimIncrement>
              <dimIndex>35-39</dimIndex>
              <name>GPIO%s_EN</name>
              <description>Enable GPIO%s for ETM task</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PIN_CTRL</name>
          <description>Clock Output Configuration Register</description>
          <addressOffset>0x1E0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLK_OUT1</name>
              <description>If you want to output clock for I2S to CLK_OUT_out1, set this register to 0x0. CLK_OUT_out1 can be found in peripheral output signals.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_OUT2</name>
              <description>If you want to output clock for I2S to CLK_OUT_out2, set this register to 0x0. CLK_OUT_out2 can be found in peripheral output signals.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_OUT3</name>
              <description>If you want to output clock for I2S to CLK_OUT_out3, set this register to 0x0. CLK_OUT_out3 can be found in peripheral output signals.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
