espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>BCK_CNT</name>
          <description>I2S sync counter register</description>
          <addressOffset>0x7C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_BCK_CNT</name>
              <description>tx bck counter value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_BCK_CNT_RST</name>
              <description>Set this bit to reset tx bck counter.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT_DIFF</name>
          <description>I2S sync counter register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_CNT_DIFF</name>
              <description>tx bck counter value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_CNT_DIFF_RST</name>
              <description>Set this bit to reset fifo counter difference.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_SW_THRES</name>
          <description>I2S sync counter register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_CNT_DIFF_SW_THRES</name>
              <description>tx fifo counter difference software threshold value, when difference larger than this threshold, interrupt will occur and hardware sync will not be executed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_HW_THRES</name>
          <description>I2S sync counter register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_CNT_DIFF_HW_THRES</name>
              <description>tx fifo counter difference hardware threshold value, which means that only when difference larger than this threshold will hardware start hardware sync.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HW_SYNC_CONF</name>
          <description>I2S TX hardware sync function configuration register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_HW_SYNC_EN</name>
              <description>Configure whether enable i2s tx hardware sync function. 1: Enable. 0: Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_HW_SYNC_SUPPL_MODE</name>
              <description>Configure the i2s tx hardware sync supplementation mode. 1: Supplement the data configured in I2S_TX_HW_SYNC_SUPPL_DATA[31:0]. 0: Supplement the last data.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HW_SYNC_DATA</name>
          <description>I2S TX hardware sync function configuration register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TX_HW_SYNC_SUPPL_DATA</name>
              <description>Configure the i2s tx hardware sync supplementation data when  I2S_TX_HW_SYNC_SUPPL_MODE is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_GATE</name>
          <description>Clock gate register</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>set this bit to enable clock gate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="DMA.DATE">
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xFC</addressOffset>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>INTERRUPT_CORE0</name>
      <description>Interrupt Controller (Core 0)</description>
      <groupName>INTERRUPT_CORE0</groupName>
      <baseAddress>0x6009A000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1B8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WIFI_MAC</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>WIFI_MAC_NMI</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>WIFI_PWR</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>WIFI_BB</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>BT_MAC</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>BT_BB</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>BT_BB_NMI</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>LP_TIMER</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>COEX</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>BLE_TIMER</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>BLE_SEC</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>I2C_MST</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>ZB_MAC</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>MODEM_APB_TIMEOUT</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>BT_MAC_INT1</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>PMU</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>EFUSE</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>LP_RTC_TIMER</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>LP_RTC_BLE_TIMER</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>LP_WDT</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>TOUCH</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>HUK</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>LP_PERI_PMS</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR0</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR1</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR2</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR3</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>BUS_MONITOR</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>CORE0_TRACE</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>CORE1_TRACE</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>CACHE</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>CPU_PERI_TIMEOUT</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>GPIO</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>GPIO_INT1</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>PAU</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>HP_PERI_TIMEOUT</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>HP_APM_M0</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>HP_APM_M1</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>HP_APM_M2</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>HP_APM_M3</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>HP_APM_M4</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>HP_MEM_APM_M0</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>HP_MEM_APM_M1</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>HP_MEM_APM_M2</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>HP_MEM_APM_M3</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>CPU_APM_M0</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>CPU_APM_M1</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>CPU_APM_M2</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>CPU_APM_M3</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>HP_PERI_PMS</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>MODEM_PERI_PMS</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>CPU_PERI_PMS</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>MSPI</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>I2S</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>UHCI0</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>UART0</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>UART1</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>LEDC</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>TWAI0</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>TWAI0_TIMER</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>USB_DEVICE</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>RMT</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>I2C_EXT0</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>I2C_EXT1</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>TG0_T0_LEVEL</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>TG0_WDT_LEVEL</name>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>TG1_T0_LEVEL</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>TG1_WDT_LEVEL</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>SYSTIMER_TARGET0</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>SYSTIMER_TARGET1</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>SYSTIMER_TARGET2</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>APB_ADC</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>TEMPERATURE_SENSOR</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>MCPWM0</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>MCPWM1</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>PCNT</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>PARL_IO_TX</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>PARL_IO_RX</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>USB_OTG11</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>ASRC_CHNL0</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>ASRC_CHNL1</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>ZERO_DET</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>DMA_IN_CH0</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>DMA_IN_CH1</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>DMA_IN_CH2</name>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>DMA_IN_CH3</name>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>DMA_IN_CH4</name>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>DMA_OUT_CH0</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>DMA_OUT_CH1</name>
        <value>87</value>
      </interrupt>
      <interrupt>
        <name>DMA_OUT_CH2</name>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>DMA_OUT_CH3</name>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>DMA_OUT_CH4</name>
        <value>90</value>
      </interrupt>
      <interrupt>
        <name>GPSPI2</name>
        <value>91</value>
      </interrupt>
      <interrupt>
        <name>GPSPI3</name>
        <value>92</value>
      </interrupt>
      <interrupt>
        <name>AES</name>
        <value>93</value>
      </interrupt>
      <interrupt>
        <name>SHA</name>
        <value>94</value>
      </interrupt>
      <interrupt>
        <name>ECC</name>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>ECDSA</name>
        <value>96</value>
      </interrupt>
      <interrupt>
        <name>KM</name>
        <value>97</value>
      </interrupt>
      <registers>
        <register>
          <dim>98</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CORE_0_INTR_MAP%s</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PASS_IN_SEC</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-2</dimIndex>
          <name>CORE_0_INTR_STATUS%s</name>
          <description>Status of interrupt sources within a 32-bit window</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_STATUS_0</name>
              <description>Represents the status of the interrupt sources within interrupt-index-range 0 ~ 31. Each bit corresponds to one interrupt source
0:The corresponding interrupt source triggered an interrupt
1:No interrupt triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_INTR_STATUS3</name>
          <description>Status register for interrupt sources 96 ~ 97</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_STATUS_3</name>
              <description>Represents the status of the interrupt sources within interrupt-index-range 96 ~ 97. Each bit corresponds to one interrupt source
0:The corresponding interrupt source triggered an interrupt
1:No interrupt triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-2</dimIndex>
          <name>CORE_0_SRC_PASS_IN_SEC_STATUS%s</name>
          <description>PASS_IN_SEC status for interrupt sources</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_SRC_PASS_IN_SEC_STATUS_0</name>
              <description>Represents the PASS_IN_SEC status of the interrupt sources within interrupt-index-range 0 ~ 31. Each bit corresponds to one interrupt source
0:The corresponding interrupt source is not PASS_IN_SEC.
1:The corresponding interrupt source is PASS_IN_SEC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_0_SRC_PASS_IN_SEC_STATUS3</name>
          <description>PASS_IN_SEC status register for interrupt sources 96 ~ 97</description>
          <addressOffset>0x1A4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_SRC_PASS_IN_SEC_STATUS_3</name>
              <description>Represents the PASS_IN_SEC status of the interrupt sources with interrupt-index-range 96 ~ 97. Each bit corresponds to one interrupt source
0:The corresponding interrupt source is not PASS_IN_SEC.
1:The corresponding interrupt source is PASS_IN_SEC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIG_IDX_ASSERT_IN_SEC</name>
          <description>reserved</description>
          <addressOffset>0x1A8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_SIG_IDX_ASSERT_IN_SEC</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SECURE_STATUS</name>
          <description>reserved</description>
          <addressOffset>0x1AC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INT_SECURE_STATUS</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Interrupt clock gating configure register</description>
          <addressOffset>0x1B0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REG_CLK_EN</name>
              <description>Interrupt clock gating configure register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
