espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register derivedFrom="DMA.DATE">
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x17C</addressOffset>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x40</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>CH%s_FADE_PARAM</name>
          <description>LEDC channel %s fade parameter register</description>
          <addressOffset>0x400</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DUTY_INC</name>
              <description>Configures whether the duty cycle increases or decreases.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DUTY_CYCLE</name>
              <description>Configures the duty cycle fading clock cycles between each duty change.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>SCALE</name>
              <description>Configures the step size scaled for each duty cycle fading step.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>DUTY_NUM</name>
              <description>Configures the number of times the duty cycle will be changed.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_PERI</name>
      <description>LP_PERI Peripheral</description>
      <groupName>LPPERI</groupName>
      <baseAddress>0x600B3400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLK_EN</name>
          <description>configure peri in lp system clk enable</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x4F800000</resetValue>
          <fields>
            <field>
              <name>RNG_APB_CK_EN</name>
              <description>lp rng apb clk enable
1: enable clock
0: disable clock</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RNG_CK_EN</name>
              <description>lp rng clk enable
1: enable clock
0: disable clock</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTP_DBG_CK_EN</name>
              <description>lp optdebug clk enable
1: enable clock
0: disable clock</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_TOUCH_CK_EN</name>
              <description>lp touch clk enable
1: enable clock
0: disable clock</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_IO_CK_EN</name>
              <description>lp io clk enable
1: enable clock
0: disable clock</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EFUSE_CK_EN</name>
              <description>efuse core clk enable
1: enable clock
0: disable clock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESET_EN</name>
          <description>configure peri in lp system reset enable</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUS_RESET_EN</name>
              <description>lp bus reset enable
1: enable reset
0: disable reset</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_RNG_APB_RESET_EN</name>
              <description>lp rng apb reset enable
1: enable reset
0: disable reset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTP_DBG_RESET_EN</name>
              <description>lp optdebug reset enable
1: enable reset
0: disable reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_TOUCH_RESET_EN</name>
              <description>lp touch reset enable
1: enable reset
0: disable reset</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_IO_RESET_EN</name>
              <description>lp io reset enable
1: enable reset
0: disable reset</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EFUSE_RESET_EN</name>
              <description>efuse core reset enable
1: enable reset
0: disable reset</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_PERI_PMS_CONF</name>
          <description>LP Peripherals PMS configuration register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_PERI_PMS_EXCEPTION_CLR</name>
              <description>Configures whether or not to clear lp peri_pms_record_reg.\\
0: No clear\\
1: Clear peri_pms_record_reg\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_PERI_PMS_EXCEPTION_INFO</name>
          <description>LP Peripherals PMS exception info record register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_PERI_PMS_EXCEPTION_DET</name>
              <description>Represents whether the lp peripheral pms has been triggered.\\
0: No triggered\\
1: Has been triggered\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_PERI_PMS_EXCEPTION_ID</name>
              <description>Represents the master id when lp peripheral pms has been triggered.\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_PERI_PMS_EXCEPTION_MODE</name>
              <description>Represents the security mode when lp peripheral pms has been triggered.\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_PERI_PMS_EXCEPTION_ADDR</name>
              <description>Represents the access address (bit23~bit0) when lp peripheral pms has been triggered.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERI_PMS_INT_EN</name>
          <description>APM interrupt enable register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_PERI_PMS_INT_EN</name>
              <description>Configures to enable lp peri pms interrupt.\\
0: disable \\
1: enable  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_SOURCE</name>
          <description>record the lp cpu interrupt</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_INTERRUPT_SOURCE</name>
              <description>BIT4~BIT0: pmu_lp_int, modem_lp_int, lp_timer_lp_int, lp_analog_peri_int, lp_io_int</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
