espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>XTAL32K</name>
          <description>Configures the XTAL32K parameter</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x66C00000</resetValue>
          <fields>
            <field>
              <name>RTC_SEL_POWER_XTAL32K</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DRES_XTAL32K</name>
              <description>Configures DRES</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DGM_XTAL32K</name>
              <description>Configures DGM</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBUF_XTAL32K</name>
              <description>Configures DBUF</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC_XTAL32K</name>
              <description>Configures DAC</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALI0</name>
          <description>need_des</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>LP_CALI_DIV_CYCLE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CALI_FULL_CNT_DONE</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_CALI_DIV_CALI_CNT</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_CALI_DIV_NUMERATOR_TYPE</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_CALI_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALI1</name>
          <description>need_des</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_CALI_DIV_NUMERATOR</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_CALI_DIV_DENOMINATOR</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALI2</name>
          <description>need_des</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x000080FF</resetValue>
          <fields>
            <field>
              <name>LP_CALI_DIV_WAIT_PWR_GOOD</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CALI_DIV_SLP_VAL</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_CALI_DIV_TIMER_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPPERI</name>
          <description>need_des</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000800</resetValue>
          <fields>
            <field>
              <name>HUK_CLK_SEL</name>
              <description>Configures the source clk of HUK
0: 0: RC_FAST_CLK
1: XTAL_D2_CLK</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_BLETIMER_DIV_NUM</name>
              <description>need_des</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_BLETIMER_32K_SEL</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SEL_OSC_SLOW</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SEL_OSC_FAST</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SEL_XTAL</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SEL_XTAL32K</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
