espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
          <register>
            <name>DT_CFG</name>
            <description>Dead time type selection and configuration</description>
            <addressOffset>0x1C</addressOffset>
            <size>0x20</size>
            <resetValue>0x00018000</resetValue>
            <fields>
              <field>
                <name>DB_FED_UPMETHOD</name>
                <description>Configures update method for FED (Falling edge delay) active register.\\0: Immediate\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is set to 1: Sync\\Bit3 is set to 1: Disable the update</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DB_RED_UPMETHOD</name>
                <description>Configures update method for RED (rising edge delay) active register.\\0: Immediate\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is set to 1: Sync\\Bit3 is set to 1: Disable the update</description>
                <bitOffset>4</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DB_DEB_MODE</name>
                <description>Configures S8 in table, dual-edge B mode.\\0: fed/red take effect on different path separately\\1: fed/red take effect on B path, A out is in bypass or dulpB mode</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DB_A_OUTSWAP</name>
                <description>Configures S6 in table.</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DB_B_OUTSWAP</name>
                <description>Configures S7 in table.</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DB_RED_INSEL</name>
                <description>Configures S4 in table.</description>
                <bitOffset>11</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DB_FED_INSEL</name>
                <description>Configures S5 in table.</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DB_RED_OUTINVERT</name>
                <description>Configures S2 in table.</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DB_FED_OUTINVERT</name>
                <description>Configures S3 in table.</description>
                <bitOffset>14</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DB_A_OUTBYPASS</name>
                <description>Configures S1 in table.</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DB_B_OUTBYPASS</name>
                <description>Configures S0 in table.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>DB_CLK_SEL</name>
                <description>Configures dead time generator %s clock selection.\\0: PWM_clk\\1: PT_clk</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DT_FED_CFG</name>
            <description>Shadow register for falling edge delay (FED).</description>
            <addressOffset>0x20</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DB_FED</name>
                <description>Configures shadow register for FED.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DT_RED_CFG</name>
            <description>Shadow register for rising edge delay (RED).</description>
            <addressOffset>0x24</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>DB_RED</name>
                <description>Configures shadow register for RED.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CARRIER_CFG</name>
            <description>Carrier enable and configuratoin</description>
            <addressOffset>0x28</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>CHOPPER_EN</name>
                <description>Configures whether or not to enable carrier%s.\\0: Bypassed\\1: Enabled</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CHOPPER_PRESCALE</name>
                <description>Configures the prescale value of PWM carrier%s clock (PC_clk), so that period of PC_clk = period of PWM_clk * (PWM_CARRIER%s_PRESCALE + 1)</description>
                <bitOffset>1</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CHOPPER_DUTY</name>
                <description>Configures carrier duty. Duty = PWM_CARRIER%s_DUTY / 8</description>
                <bitOffset>5</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CHOPPER_OSHTWTH</name>
                <description>Configures width of the first pulse. Measurement unit: Periods of the carrier.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CHOPPER_OUT_INVERT</name>
                <description>Configures whether or not to invert the output of PWM%s A and PWM%s B for this submodule.\\0: Normal\\1: Invert</description>
                <bitOffset>12</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CHOPPER_IN_INVERT</name>
                <description>Configures whether or not to invert the input of PWM%s A and PWM%s B for this submodule.\\0: Normal\\1: Invert</description>
                <bitOffset>13</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FH_CFG0</name>
            <description>Actions on PWM0A and PWM0B trip events</description>
            <addressOffset>0x2C</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>TZ_SW_CBC</name>
                <description>Configures whether or not to enable software force cycle-by-cycle mode action.\\0: Disable\\1: Enable</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_F2_CBC</name>
                <description>Configures whether or not event_f2 will trigger cycle-by-cycle mode action.\\0: Disable\\1: Enable</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_F1_CBC</name>
                <description>Configures whether or not event_f1 will trigger cycle-by-cycle mode action.\\0: Disable\\1: Enable</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_F0_CBC</name>
                <description>Configures whether or not event_f0 will trigger cycle-by-cycle mode action.\\0: Disable\\1: Enable</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_SW_OST</name>
                <description>Configures whether or not to enable software force one-shot mode action.\\0: Disable\\1: Enable</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_F2_OST</name>
                <description>Configures whether or not event_f2 will trigger one-shot mode action.\\0: Disable\\1: Enable</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_F1_OST</name>
                <description>Configures whether or not event_f1 will trigger one-shot mode action.\\0: Disable\\1: Enable</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_F0_OST</name>
                <description>Configures whether or not event_f0 will trigger one-shot mode action.\\0: Disable\\1: Enable</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_A_CBC_D</name>
                <description>Configures cycle-by-cycle mode action on PWM%s A when fault event occurs and timer is decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle</description>
                <bitOffset>8</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_A_CBC_U</name>
                <description>Configures cycle-by-cycle mode action on PWM%s A when fault event occurs and timer is increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle</description>
                <bitOffset>10</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_A_OST_D</name>
                <description>Configures one-shot mode action on PWM%s A when fault event occurs and timer is decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle</description>
                <bitOffset>12</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_A_OST_U</name>
                <description>Configures one-shot mode action on PWM%s A when fault event occurs and timer is increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle</description>
                <bitOffset>14</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_B_CBC_D</name>
                <description>Configures cycle-by-cycle mode action on PWM%s B when fault event occurs and timer is decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_B_CBC_U</name>
                <description>Configures cycle-by-cycle mode action on PWM%s B when fault event occurs and timer is increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle</description>
                <bitOffset>18</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_B_OST_D</name>
                <description>Configures one-shot mode action on PWM%s B when fault event occurs and timer is decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_B_OST_U</name>
                <description>Configures one-shot mode action on PWM%s B when fault event occurs and timer is increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle</description>
                <bitOffset>22</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FH_CFG1</name>
            <description>Software triggers for fault handler actions</description>
            <addressOffset>0x30</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>TZ_CLR_OST</name>
                <description>Configures the generation of software one-shot mode action clear. A toggle (software negate its value) triggers a clear for on going one-shot mode action.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_CBCPULSE</name>
                <description>Configures the refresh moment selection of cycle-by-cycle mode action.\\0: Select nothing, will not refresh\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP</description>
                <bitOffset>1</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_FORCE_CBC</name>
                <description>Configures the generation of software cycle-by-cycle mode action. A toggle (software negate its value) triggers a cycle-by-cycle mode action.</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>TZ_FORCE_OST</name>
                <description>Configures the generation of software one-shot mode action. A toggle (software negate its value) triggers a one-shot mode action.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FH_STATUS</name>
            <description>Status of fault events.</description>
            <addressOffset>0x34</addressOffset>
            <size>0x20</size>
            <fields>
              <field>
                <name>TZ_CBC_ON</name>
                <description>Represents whether or not an cycle-by-cycle mode action is on going.\\0:No action\\1: On going</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>TZ_OST_ON</name>
                <description>Represents whether or not an one-shot mode action is on going.\\0:No action\\1: On going</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>FAULT_DETECT</name>
          <description>Fault detection configuration and status register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <dim>3</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-2</dimIndex>
              <name>F%s_EN</name>
              <description>Configures whether or not to enable event_f%s generation.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <dim>3</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>0-2</dimIndex>
              <name>F%s_POLE</name>
              <description>Configures the polarity of the fault trigger on FAULT%s source from GPIO matrix.\0: Level low\1: Level high</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EVENT_F0</name>
              <description>Represents whether or not an event_f0 is on going.\\0: No action\\1: On going</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EVENT_F1</name>
              <description>Represents whether or not an event_f1 is on going.\\0: No action\\1: On going</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EVENT_F2</name>
              <description>Represents whether or not an event_f2 is on going.\\0: No action\\1: On going</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_TIMER_CFG</name>
          <description>Capture timer configuration register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIMER_EN</name>
              <description>Configures whether or not to enable capture timer increment.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCI_EN</name>
              <description>Configures whether or not to enable capture timer sync.\\0: Disable\\1: Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCI_SEL</name>
              <description>Configures the selection of capture module sync input.\\0: None\\1: Timer0 sync_out\\2: Timer1 sync_out\\3: Timer2 sync_out\\4: SYNC0 from GPIO matrix\\5: SYNC1 from GPIO matrix\\6: SYNC2 from GPIO matrix\\7: None</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_SW</name>
              <description>Configures the generation of a capture timer sync when reg_cap_synci_en is 1.\\0: Invalid, No effect\\1: Trigger a capture timer sync, capture timer is loaded with value in phase register</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAP_TIMER_PHASE</name>
          <description>Capture timer sync phase register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PHASE</name>
              <description>Configures phase value for capture timer sync operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
