espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>INTMTX_CONF</name>
          <description>INTMTX configuration register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000039</resetValue>
          <fields>
            <field>
              <name>INTMTX_CORE0_CLK_EN</name>
              <description>Set 1 to enable core0 intmtx clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTMTX_CORE0_RST_EN</name>
              <description>Set 1 to reset core0 intmtx module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTMTX_CORE1_CLK_EN</name>
              <description>Set 1 to enable core1 intmtx clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTMTX_CORE1_RST_EN</name>
              <description>Set 1 to reset core1 intmtx module</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTMTX_CORE0_READY</name>
              <description>Query this field after reset intmtx module</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTMTX_CORE1_READY</name>
              <description>Query this field after reset intmtx module</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNT_CONF</name>
          <description>PCNT configuration register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PCNT_CLK_EN</name>
              <description>Set 1 to enable pcnt clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT_RST_EN</name>
              <description>Set 1 to reset pcnt module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT_REG_CLK_EN</name>
              <description>Set 1 to enable pcnt reg clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT_REG_RST_EN</name>
              <description>Set 1 to reset pcnt reg module</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT_READY</name>
              <description>Query this field after reset pcnt module</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCNT_CLK_SEL</name>
              <description>Configures the clock source of the pcnt.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F32M_CLK\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT_CLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the pcnt function clock.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_CONF</name>
          <description>ETM configuration register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>ETM_CLK_EN</name>
              <description>Set 1 to enable etm clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_RST_EN</name>
              <description>Set 1 to reset etm module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_READY</name>
              <description>Query this field after reset etm module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM0_CONF</name>
          <description>PWM0 configuration register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PWM0_CLK_EN</name>
              <description>Set 1 to enable pwm0 clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM0_RST_EN</name>
              <description>Set 1 to reset pwm0 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM0_READY</name>
              <description>Query this field after reset pwm0 module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM0_CLK_CONF</name>
          <description>PWM0_CLK configuration register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00004000</resetValue>
          <fields>
            <field>
              <name>PWM0_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the pwm0 function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM0_CLKM_SEL</name>
              <description>Configures the clock source of MCPWM0.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F160M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM0_CLKM_EN</name>
              <description>set this field as 1 to activate pwm0 clkm.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARL_IO_CONF</name>
          <description>PARL_IO configuration register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PARL_CLK_EN</name>
              <description>Set 1 to enable parl apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_RST_EN</name>
              <description>Set 1 to reset parl apb reg</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_READY</name>
              <description>Query this field after reset parl module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARL_CLK_RX_CONF</name>
          <description>PARL_CLK_RX configuration register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARL_CLK_RX_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the parl rx clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_CLK_RX_SEL</name>
              <description>Configures the clock source of Paraller IO RX\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F240M_CLK\\
3: Use the clock from chip pin\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_CLK_RX_EN</name>
              <description>Set 1 to enable parl rx clock</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_RX_RST_EN</name>
              <description>Set 1 to reset parl rx module</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARL_CLK_TX_CONF</name>
          <description>PARL_CLK_TX configuration register</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PARL_CLK_TX_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the parl tx clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_CLK_TX_SEL</name>
              <description>Configures the clock source of Paraller IO RX\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F240M_CLK\\
3: Use the clock from chip pin\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_CLK_TX_EN</name>
              <description>Set 1 to enable parl tx clock</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_TX_RST_EN</name>
              <description>Set 1 to reset parl tx module</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PVT_MONITOR_CONF</name>
          <description>PVT_MONITOR configuration register</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000001C</resetValue>
          <fields>
            <field>
              <name>PVT_MONITOR_CLK_EN</name>
              <description>Set 1 to enable apb clock of pvt module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_RST_EN</name>
              <description>Set 1 to reset all pvt monitor module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_SITE1_CLK_EN</name>
              <description>Set 1 to enable function clock of modem pvt module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_SITE2_CLK_EN</name>
              <description>Set 1 to enable function clock of cpu pvt module</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_SITE3_CLK_EN</name>
              <description>Set 1 to enable function clock of hp_peri pvt module</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PVT_MONITOR_FUNC_CLK_CONF</name>
          <description>PVT_MONITOR function clock configuration register</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00100000</resetValue>
          <fields>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the pvt_monitor function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_SEL</name>
              <description>Configures the clock source of PVT MONITER.\\
0: XTAL_CLK\\
1(default): PLL_F160M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_EN</name>
              <description>Set 1 to enable source clock of pvt sitex</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GDMA_CONF</name>
          <description>GDMA configuration register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>GDMA_CLK_EN</name>
              <description>Set 1 to enable gdma clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GDMA_RST_EN</name>
              <description>Set 1 to reset gdma module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2_CONF</name>
          <description>SPI2 configuration register</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>SPI2_CLK_EN</name>
              <description>Set 1 to enable spi2 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_RST_EN</name>
              <description>Set 1 to reset spi2 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_READY</name>
              <description>Query this field after reset spi2 module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2_CLKM_CONF</name>
          <description>SPI2_CLKM configuration register</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00400000</resetValue>
          <fields>
            <field>
              <name>SPI2_CLKM_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the spi2_mst clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_CLKM_SEL</name>
              <description>Configures the clock source of SPI2.\\
0 (default): XTAL_CLK\\
1: PLL_F160M_CLK\\
2: RC_FAST_CLK\\
3: PLL_F120M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_CLKM_EN</name>
              <description>Set 1 to enable spi2 function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_CONF</name>
          <description>AES configuration register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>AES_CLK_EN</name>
              <description>Set 1 to enable aes clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AES_RST_EN</name>
              <description>Set 1 to reset aes module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AES_READY</name>
              <description>Query this field after reset aes module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_CONF</name>
          <description>SHA configuration register</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>SHA_CLK_EN</name>
              <description>Set 1 to enable sha clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA_RST_EN</name>
              <description>Set 1 to reset sha module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA_READY</name>
              <description>Query this field after reset sha module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSA_CONF</name>
          <description>RSA configuration register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>RSA_CLK_EN</name>
              <description>Set 1 to enable rsa clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSA_RST_EN</name>
              <description>Set 1 to reset rsa module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSA_READY</name>
              <description>Query this field after reset rsa module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_CONF</name>
          <description>ECC configuration register</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>ECC_CLK_EN</name>
              <description>Set 1 to enable ecc clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_RST_EN</name>
              <description>Set 1 to reset ecc module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_READY</name>
              <description>Query this field after reset ecc module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_MEM_LP_CTRL</name>
          <description>HP CORE0 &amp; HP CORE1 memory power control register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>ECC_MEM_LP_MODE</name>
              <description>Configures ecc memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_MEM_LP_EN</name>
              <description>Set this bit to power down ecc memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control ecc memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
