espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>PLL_DIV_CLK_EN</name>
          <description>SPLL DIV clock-gating configuration register</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000003F</resetValue>
          <fields>
            <field>
              <name>PLL_96M_CLK_EN</name>
              <description>This field is used to open 96 MHz clock  drived from SPLL 96M. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_64M_CLK_EN</name>
              <description>This field is used to open 64 MHz clock drived from SPLL 64M. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_48M_CLK_EN</name>
              <description>This field is used to open 48 MHz clock (div2 of SPLL) drived from SPLL 96M. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_32M_CLK_EN</name>
              <description>This field is used to open 32 MHz clock (div2  of SPLL) drived from SPLL 64M. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_16M_CLK_EN</name>
              <description>This field is used to open 16 MHz clock (div6 of SPLL) drived from SPLL 96M. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_8M_CLK_EN</name>
              <description>This field is used to open   8 MHz clock (div12 of SPLL) drived from SPLL 96M. 0: close, 1: open(default). Only avaliable when high-speed clock-source SPLL is active.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_CLK_OUT_EN</name>
          <description>CLK_OUT_EN configuration register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000007F</resetValue>
          <fields>
            <field>
              <name>CLK8_OEN</name>
              <description>Set 1 to enable 8m clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK16_OEN</name>
              <description>Set 1 to enable 16m clock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK32_OEN</name>
              <description>Set 1 to enable 32m clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_ADC_INF_OEN</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_DFM_INF_OEN</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SDM_MOD_OEN</name>
              <description>Reserved</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_XTAL_OEN</name>
              <description>Set 1 to enable xtal clock</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMG_CALI_CLK_CONF</name>
          <description>timergrout calibrate clock configuration register</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000770</resetValue>
          <fields>
            <field>
              <name>TIMG_CALI_CLK_SEL</name>
              <description>Configures the 32KHz clock for TIMER_GROUP.\\
0 (default): RC32K_CLK\\
1: XTAL32K_CLK\\
2: OSC_SLOW_CLK\\
3: RC_SLOW_CLK\\
4: TIMG_SECURE_CLK\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMG_SECURE_CLK_SEL</name>
              <description>Configures the clock source for the TIMG_SECURE_CLK.\\
0 (default):CPU_CLK\\
1: AHB_CLK\\
2: APB_CLK\\
3: sec function clock\\
4: mspi function clock\\
5: iomux function clock\\
6: parl io rx function clock\\
7: parl io tx function clock\\
8: spi2 function clock\\
9: spi3 function clock\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMG_SECURE_CLK_DIV_NUM</name>
              <description>When PCR_TIMG_CALI_CLK_SEL set as 4, This field PCR_TIMG_SECURE_CLK_DIV_NUM is used to set the divider number of TIMG_SECURE_CLK.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROM_MEM_LP_CTRL</name>
          <description>rom power control register</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTERNAL_ROM_MEM_LP_MODE</name>
              <description>Configures rom low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERNAL_ROM_MEM_LP_EN</name>
              <description>Set this bit to power down rom.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERNAL_ROM_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control rom, disbale hardware control.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROM_CLKGATE_FORCE_ON</name>
              <description>1: Force to open the clock and bypass the gate-clock when accessing the ROM. 0: A gate-clock will be used when accessing the ROM.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM_POWER_CONF_1</name>
          <description>HP SRAM/ROM configuration register</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SRAM_CLKGATE_FORCE_ON</name>
              <description>1: Force to open the clock and bypass the gate-clock when accessing the SRAM. 0: A gate-clock will be used when accessing the SRAM.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_CONF</name>
          <description>Clock source configuration register for External Memory Encryption and Decryption</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEC_CLK_SEL</name>
              <description>Configures the clock source for the External Memory Encryption and Decryption module.\\
0(default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F64M_CLK\\
3: PLL_F96M_CLK\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_RST_EN</name>
              <description>Set 1 to reset sec module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_DIV_NUMINATOR</name>
              <description>The  denominator of the frequency divider factor of the sec function clock.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_DIV_DENOMINATOR</name>
              <description>The numerator of the frequency divider factor of the sec function clock.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the sec function clock.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC_INV_PHASE_CONF</name>
          <description>xxxx</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLK_ADC_INV_PHASE_ENA</name>
              <description>xxxx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_CLK_UPDATE</name>
          <description>Configuration register for applying updated high-performance system clock sources</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUS_CLOCK_UPDATE</name>
              <description>Configures whether or not to update configurations for CPU_CLK division, AHB_CLK division and HP_ROOT_CLK clock source selection.\\
0: Not update configurations\\
1: Update configurations\\
This bit is automatically cleared when configurations have been updated.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_CLK_DIV</name>
          <description>SAR ADC clock divisor configuration register</description>
          <addressOffset>0x14C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000F0F</resetValue>
          <fields>
            <field>
              <name>SAR2_CLK_DIV_NUM</name>
              <description>Configures the divisor for SAR ADC 2  clock to generate ADC analog control signals.\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR1_CLK_DIV_NUM</name>
              <description>Configures the divisor for SAR ADC 1  clock to generate ADC analog control signals.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWDET_SAR_CLK_CONF</name>
          <description>xxxx</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000107</resetValue>
          <fields>
            <field>
              <name>PWDET_SAR_CLK_DIV_NUM</name>
              <description>xxxx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWDET_SAR_READER_EN</name>
              <description>xxxx</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP_WDT_CONF</name>
          <description>TIMERGROUP_WDT configuration register</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TG0_WDT_RST_EN</name>
              <description>Set 1 to reset timer_group0 wdt module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_WDT_RST_EN</name>
              <description>Set 1 to reset timer_group1 wdt module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERGROUP_XTAL_CONF</name>
          <description>TIMERGROUP1 configuration register</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>TG0_XTAL_RST_EN</name>
              <description>Set 1 to reset timer_group0 xtal clock domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_XTAL_RST_EN</name>
              <description>Set 1 to reset timer_group1 xtal clock domain</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_XTAL_CLK_EN</name>
              <description>Set 1 to enable tg0 xtal clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KM_CONF</name>
          <description>Key Manager configuration register</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>KM_CLK_EN</name>
              <description>Set 1 to enable km clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KM_RST_EN</name>
              <description>Set 1 to reset km module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KM_READY</name>
              <description>Query this field after reset km module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KM_MEM_LP_CTRL</name>
          <description>KM memory power control register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>KM_MEM_LP_MODE</name>
              <description>Configures km memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KM_MEM_LP_EN</name>
              <description>Set this bit to power down km memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KM_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control km memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCM_MEM_MONITOR_CONF</name>
          <description>TCM_MEM_MONITOR configuration register</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>TCM_MEM_MONITOR_CLK_EN</name>
              <description>Set 1 to enable tcm_mem_monitor clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCM_MEM_MONITOR_RST_EN</name>
              <description>Set 1 to reset tcm_mem_monitor module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCM_MEM_MONITOR_READY</name>
              <description>Query this field after reset tcm_mem_monitor module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_MEM_MONITOR_CONF</name>
          <description>PSRAM_MEM_MONITOR configuration register</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>PSRAM_MEM_MONITOR_CLK_EN</name>
              <description>Set 1 to enable psram_mem_monitor clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_MEM_MONITOR_RST_EN</name>
              <description>Set 1 to reset psram_mem_monitor module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_MEM_MONITOR_READY</name>
              <description>Query this field after reset psram_mem_monitor module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
