espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>HP_SLEEP_BACKUP</name>
          <description>need_des</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HP_MODEM2SLEEP_BACKUP_MODEM_CLK_CODE</name>
              <description>need_des</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE2SLEEP_BACKUP_MODEM_CLK_CODE</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM2SLEEP_BACKUP_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE2SLEEP_BACKUP_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM2SLEEP_BACKUP_MODE</name>
              <description>need_des</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE2SLEEP_BACKUP_MODE</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MODEM2SLEEP_BACKUP_EN</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_ACTIVE2SLEEP_BACKUP_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_BACKUP_CLK</name>
          <description>need_des</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HP_SLEEP_BACKUP_ICG_FUNC_EN</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_SYSCLK</name>
          <description>need_des</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HP_SLEEP_DIG_SYS_CLK_NO_DIV</name>
              <description>need_des</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_ICG_SYS_CLOCK_EN</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_SYS_CLK_SLP_SEL</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_ICG_SLP_SEL</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_DIG_SYS_CLK_SEL</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_HP_REGULATOR0</name>
          <description>need_des</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x84470000</resetValue>
          <fields>
            <field>
              <name>HP_SLEEP_HP_POWER_DET_BYPASS</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_SLP_MEM_XPD</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_SLP_LOGIC_XPD</name>
              <description>need_des</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_XPD</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_SLP_MEM_DBIAS</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_SLP_LOGIC_DBIAS</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_DBIAS</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_HP_REGULATOR1</name>
          <description>need_des</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001000</resetValue>
          <fields>
            <field>
              <name>HP_SLEEP_HP_REGULATOR_DRV_B</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_XTAL</name>
          <description>need_des</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <resetValue>0xC0000000</resetValue>
          <fields>
            <field>
              <name>HP_SLEEP_XPD_XTALX2</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_XPD_XTAL</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_LP_REGULATOR0</name>
          <description>need_des</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <resetValue>0x04600000</resetValue>
          <fields>
            <field>
              <name>HP_SLEEP_LP_REGULATOR_SLP_XPD</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_LP_REGULATOR_XPD</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_LP_REGULATOR_SLP_DBIAS</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_LP_REGULATOR_DBIAS</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_LP_REGULATOR1</name>
          <description>need_des</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HP_SLEEP_LP_REGULATOR_DRV_B</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_LP_DCDC_RESERVE</name>
          <description>need_des</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HP_SLEEP_LP_DCDC_RESERVE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_LP_DIG_POWER</name>
          <description>need_des</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HP_SLEEP_VDD_IO_MODE</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_BOD_SOURCE_SEL</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_VDDBAT_MODE</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_LP_MEM_DSLP</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_PD_LP_PERI_PD_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_SLEEP_LP_CK_POWER</name>
          <description>need_des</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>HP_SLEEP_XPD_LPPLL</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_XPD_XTAL32K</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_XPD_RC32K</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_XPD_FOSC_CLK</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SLEEP_PD_OSC_CLK</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SLEEP_LP_BIAS_RESERVE</name>
          <description>need_des</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_SLEEP_LP_BIAS_RESERVE</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SLEEP_LP_REGULATOR0</name>
          <description>need_des</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <resetValue>0x04600000</resetValue>
          <fields>
            <field>
              <name>LP_SLEEP_LP_REGULATOR_SLP_XPD</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_LP_REGULATOR_XPD</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_LP_REGULATOR_SLP_DBIAS</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_LP_REGULATOR_DBIAS</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SLEEP_LP_REGULATOR1</name>
          <description>need_des</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_SLEEP_LP_REGULATOR_DRV_B</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SLEEP_XTAL</name>
          <description>need_des</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <resetValue>0xC0000000</resetValue>
          <fields>
            <field>
              <name>LP_SLEEP_XPD_XTALX2</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_XPD_XTAL</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SLEEP_LP_DIG_POWER</name>
          <description>need_des</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LP_SLEEP_VDD_IO_MODE</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_BOD_SOURCE_SEL</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_VDDBAT_MODE</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_LP_MEM_DSLP</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_PD_LP_PERI_PD_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SLEEP_LP_CK_POWER</name>
          <description>need_des</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>LP_SLEEP_XPD_LPPLL</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_XPD_XTAL32K</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_XPD_RC32K</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_XPD_FOSC_CLK</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_PD_OSC_CLK</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_SLEEP_BIAS</name>
          <description>need_des</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <resetValue>0x002E8A00</resetValue>
          <fields>
            <field>
              <name>LP_SLEEP_DCDC_CCM_ENB</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_DCDC_CLEAR_RDY</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_DIG_PMU_DPCUR_BIAS</name>
              <description>need_des</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_DIG_PMU_DSFMOS</name>
              <description>need_des</description>
              <bitOffset>13</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_DCM_VSET</name>
              <description>need_des</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_DCM_MODE</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_XPD_BIAS</name>
              <description>need_des</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_DISCNNT_DIG_RTC</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_SLEEP_PD_CUR</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEP</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
