espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>TOUCH_PWR_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x1C0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TOUCH_SLEEP_CYCLES</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_WAIT_CYCLES</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_SLEEP_TIMER_EN</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_FORCE_DONE</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_BANDGAP_CTRL</name>
          <description>need_des</description>
          <addressOffset>0x1C4</addressOffset>
          <size>0x20</size>
          <resetValue>0x3C000000</resetValue>
          <fields>
            <field>
              <name>EXT_OCODE</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_FORCE_OCODE</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register derivedFrom="DMA.DATE">
          <name>DATE</name>
          <description>need_des</description>
          <addressOffset>0x3FC</addressOffset>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PVT</name>
      <description>PVT Peripheral</description>
      <groupName>PVT</groupName>
      <baseAddress>0x60026000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1F4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PMUP_BITMAP_HIGH0</name>
          <description>select valid pvt channel</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PUMP_BITMAP_HIGH0</name>
              <description>select valid high channel0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMUP_BITMAP_HIGH1</name>
          <description>select valid pvt channel</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PUMP_BITMAP_HIGH1</name>
              <description>select valid high channel1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMUP_BITMAP_HIGH2</name>
          <description>select valid pvt channel</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PUMP_BITMAP_HIGH2</name>
              <description>select valid high channel2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMUP_BITMAP_HIGH3</name>
          <description>select valid pvt channel</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PUMP_BITMAP_HIGH3</name>
              <description>select valid high channel3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMUP_BITMAP_HIGH4</name>
          <description>select valid pvt channel</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PUMP_BITMAP_HIGH4</name>
              <description>select valid high channel4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMUP_BITMAP_LOW0</name>
          <description>select valid pvt channel</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PUMP_BITMAP_LOW0</name>
              <description>select valid low channel0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMUP_BITMAP_LOW1</name>
          <description>select valid pvt channel</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PUMP_BITMAP_LOW1</name>
              <description>select valid low channel1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMUP_BITMAP_LOW2</name>
          <description>select valid pvt channel</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PUMP_BITMAP_LOW2</name>
              <description>select valid low channel2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMUP_BITMAP_LOW3</name>
          <description>select valid pvt channel</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PUMP_BITMAP_LOW3</name>
              <description>select valid low channel3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMUP_BITMAP_LOW4</name>
          <description>select valid pvt channel</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PUMP_BITMAP_LOW4</name>
              <description>select valid low channel4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMUP_DRV_CFG</name>
          <description>configure pump drv</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>BYPASS_EFUSE_CTRL</name>
              <description>needs desc</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMP_EN</name>
              <description>configure pvt charge xpd</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>force register clken</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMP_DRV4</name>
              <description>configure cmd4 drv</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMP_DRV3</name>
              <description>configure cmd3 drv</description>
              <bitOffset>15</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMP_DRV2</name>
              <description>configure cmd2 drv</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMP_DRV1</name>
              <description>configure cmd1 drv</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMP_DRV0</name>
              <description>configure cmd0 drv</description>
              <bitOffset>27</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMUP_CHANNEL_CFG</name>
          <description>configure the code of valid pump channel code</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PUMP_CHANNEL_CODE4</name>
              <description>configure cmd4 code</description>
              <bitOffset>7</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMP_CHANNEL_CODE3</name>
              <description>configure cmd3 code</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMP_CHANNEL_CODE2</name>
              <description>configure cmd2 code</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMP_CHANNEL_CODE1</name>
              <description>configure cmd1 code</description>
              <bitOffset>22</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUMP_CHANNEL_CODE0</name>
              <description>configure cmd0 code</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_CFG</name>
          <description>configure pvt clk</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PUMP_CLK_DIV_NUM</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MONITOR_CLK_PVT_EN</name>
              <description>needs field desc</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SEL</name>
              <description>select pvt clk</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_CHANNEL_SEL0</name>
          <description>needs desc</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x81020400</resetValue>
          <fields>
            <field>
              <name>DBIAS_CHANNEL3_SEL</name>
              <description>needs field desc</description>
              <bitOffset>4</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBIAS_CHANNEL2_SEL</name>
              <description>needs field desc</description>
              <bitOffset>11</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBIAS_CHANNEL1_SEL</name>
              <description>needs field desc</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBIAS_CHANNEL0_SEL</name>
              <description>needs field desc</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_CHANNEL_SEL1</name>
          <description>needs desc</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>DBIAS_CHANNEL4_SEL</name>
              <description>needs field desc</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_CHANNEL0_SEL</name>
          <description>needs desc</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBIAS_CHANNEL0_CFG</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_CHANNEL1_SEL</name>
          <description>needs desc</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBIAS_CHANNEL1_CFG</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_CHANNEL2_SEL</name>
          <description>needs desc</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBIAS_CHANNEL2_CFG</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_CHANNEL3_SEL</name>
          <description>needs desc</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBIAS_CHANNEL3_CFG</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_CHANNEL4_SEL</name>
          <description>needs desc</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBIAS_CHANNEL4_CFG</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_CMD0</name>
          <description>needs desc</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBIAS_CMD0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_CMD1</name>
          <description>needs desc</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBIAS_CMD1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_CMD2</name>
          <description>needs desc</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBIAS_CMD2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_CMD3</name>
          <description>needs desc</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBIAS_CMD3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_CMD4</name>
          <description>needs desc</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBIAS_CMD4</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBIAS_TIMER</name>
          <description>needs desc</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <resetValue>0x7FFF8000</resetValue>
          <fields>
            <field>
              <name>TIMER_TARGET</name>
              <description>needs field desc</description>
              <bitOffset>15</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER_EN</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT0_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE0_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE0_UNIT1_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x6C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE0_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
