espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>SPI_SMEM_DDR</name>
          <description>SPI0 external RAM DDR mode control register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00003020</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>1: in DDR mode,  0 in SDR mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_VAR_DUMMY</name>
              <description>Set the bit to enable variable dummy cycle in spi DDR mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDAT_SWP</name>
              <description>Set the bit to reorder rx data of the word in spi DDR mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDAT_SWP</name>
              <description>Set the bit to reorder tx data of the word in spi DDR mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_DIS</name>
              <description>the bit is used to disable dual edge in command phase when DDR mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_OUTMINBYTELEN</name>
              <description>It is the minimum output data length in the DDR psram.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_TX_DDR_MSK_EN</name>
              <description>Set this bit to mask the first or the last byte in SPI0 ECC DDR write mode, when accesses to external RAM.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_RX_DDR_MSK_EN</name>
              <description>Set this bit to mask the first or the last byte in SPI0 ECC DDR read mode, when accesses to external RAM.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_USR_DDR_DQS_THD</name>
              <description>The delay number of data strobe which from memory based on SPI clock.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DQS_LOOP</name>
              <description>1: Do not need the input of SPI_DQS signal, SPI0 starts to receive data when spi0_slv_st is in SPI_MEM_DIN state. It is used when there is no SPI_DQS signal or SPI_DQS signal is not stable. 0: SPI0 starts to store data at the positive and negative edge of SPI_DQS.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_CLK_DIFF_EN</name>
              <description>Set this bit to enable the differential SPI_CLK#.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_DQS_CA_IN</name>
              <description>Set this bit to enable the input of SPI_DQS signal in SPI phases of CMD and ADDR.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_HYPERBUS_DUMMY_2X</name>
              <description>Set this bit to enable the vary dummy function in SPI HyperBus mode, when SPI0 accesses flash or SPI1 accesses flash or sram.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_CLK_DIFF_INV</name>
              <description>Set this bit to invert SPI_DIFF when accesses to external RAM. .</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_OCTA_RAM_ADDR</name>
              <description>Set this bit to enable octa_ram address out when accesses to external RAM, which means ADDR_OUT[31:0] = {spi_usr_addr_value[25:4], 6'd0, spi_usr_addr_value[3:1], 1'b0}.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_HYPERBUS_CA</name>
              <description>Set this bit to enable HyperRAM address out when accesses to external RAM, which means ADDR_OUT[31:0] = {spi_usr_addr_value[19:4], 13'd0, spi_usr_addr_value[3:1]}.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_FMEM_PMS0_ATTR</name>
          <description>MSPI flash PMS section $n attribute register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000001B</resetValue>
          <fields>
            <field>
              <name>SPI_FMEM_PMS0_RD_ATTR</name>
              <description>1: SPI1 flash PMS section 0 read accessible. 0: Not allowed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS0_WR_ATTR</name>
              <description>1: SPI1 flash PMS section 0 write accessible. 0: Not allowed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS0_ECC</name>
              <description>SPI1 flash PMS section 0 ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section 0 is configured by registers SPI_FMEM_PMS0_ADDR_REG and SPI_FMEM_PMS0_SIZE_REG.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS0_NONSECURE_RD_ATTR</name>
              <description>1: SPI1 flash  non-secure PMS section 0 read accessible. 0: Not allowed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS0_NONSECURE_WR_ATTR</name>
              <description>1: SPI1 flash non-secure PMS section 0 write accessible. 0: Not allowed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS0_NONSECURE_ECC</name>
              <description>SPI1 flash non-secure PMS section 0 ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section 0 is configured by registers SPI_FMEM_PMS0_ADDR_REG and SPI_FMEM_PMS0_SIZE_REG.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_FMEM_PMS1_ATTR</name>
          <description>SPI1 flash PMS section $n attribute register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000001B</resetValue>
          <fields>
            <field>
              <name>SPI_FMEM_PMS1_RD_ATTR</name>
              <description>1: SPI1 flash PMS section 1 read accessible. 0: Not allowed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS1_WR_ATTR</name>
              <description>1: SPI1 flash PMS section 1 write accessible. 0: Not allowed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS1_ECC</name>
              <description>SPI1 flash PMS section 1 ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section 1 is configured by registers SPI_FMEM_PMS1_ADDR_REG and SPI_FMEM_PMS1_SIZE_REG.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS1_NONSECURE_RD_ATTR</name>
              <description>1: SPI1 flash  non-secure PMS section 1 read accessible. 0: Not allowed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS1_NONSECURE_WR_ATTR</name>
              <description>1: SPI1 flash non-secure PMS section 1 write accessible. 0: Not allowed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS1_NONSECURE_ECC</name>
              <description>SPI1 flash non-secure PMS section 1 ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section 1 is configured by registers SPI_FMEM_PMS1_ADDR_REG and SPI_FMEM_PMS1_SIZE_REG.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_FMEM_PMS2_ATTR</name>
          <description>SPI1 flash PMS section $n attribute register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000001B</resetValue>
          <fields>
            <field>
              <name>SPI_FMEM_PMS2_RD_ATTR</name>
              <description>1: SPI1 flash PMS section 2 read accessible. 0: Not allowed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS2_WR_ATTR</name>
              <description>1: SPI1 flash PMS section 2 write accessible. 0: Not allowed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS2_ECC</name>
              <description>SPI1 flash PMS section 2 ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section 2 is configured by registers SPI_FMEM_PMS2_ADDR_REG and SPI_FMEM_PMS2_SIZE_REG.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS2_NONSECURE_RD_ATTR</name>
              <description>1: SPI1 flash  non-secure PMS section 2 read accessible. 0: Not allowed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS2_NONSECURE_WR_ATTR</name>
              <description>1: SPI1 flash non-secure PMS section 2 write accessible. 0: Not allowed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS2_NONSECURE_ECC</name>
              <description>SPI1 flash non-secure PMS section 2 ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section 2 is configured by registers SPI_FMEM_PMS2_ADDR_REG and SPI_FMEM_PMS2_SIZE_REG.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_FMEM_PMS3_ATTR</name>
          <description>SPI1 flash PMS section $n attribute register</description>
          <addressOffset>0x10C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000001B</resetValue>
          <fields>
            <field>
              <name>SPI_FMEM_PMS3_RD_ATTR</name>
              <description>1: SPI1 flash PMS section 3 read accessible. 0: Not allowed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS3_WR_ATTR</name>
              <description>1: SPI1 flash PMS section 3 write accessible. 0: Not allowed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS3_ECC</name>
              <description>SPI1 flash PMS section 3 ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section 3 is configured by registers SPI_FMEM_PMS3_ADDR_REG and SPI_FMEM_PMS3_SIZE_REG.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS3_NONSECURE_RD_ATTR</name>
              <description>1: SPI1 flash  non-secure PMS section 3 read accessible. 0: Not allowed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS3_NONSECURE_WR_ATTR</name>
              <description>1: SPI1 flash non-secure PMS section 3 write accessible. 0: Not allowed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PMS3_NONSECURE_ECC</name>
              <description>SPI1 flash non-secure PMS section 3 ECC mode, 1: enable ECC mode. 0: Disable it. The flash PMS section 3 is configured by registers SPI_FMEM_PMS3_ADDR_REG and SPI_FMEM_PMS3_SIZE_REG.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SPI_FMEM_PMS%s_ADDR</name>
          <description>SPI1 flash PMS section %s start address register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>S</name>
              <description>SPI1 flash PMS section %s start address value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SPI_FMEM_PMS%s_SIZE</name>
          <description>SPI1 flash PMS section %s start address register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001000</resetValue>
          <fields>
            <field>
              <name>SPI_FMEM_PMS_SIZE</name>
              <description>SPI1 flash PMS section %s address region is (SPI_FMEM_PMS%s_ADDR_S, SPI_FMEM_PMS%s_ADDR_S + SPI_FMEM_PMS%s_SIZE)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SMEM_PMS0_ATTR</name>
          <description>SPI1 flash PMS section $n start address register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000001B</resetValue>
          <fields>
            <field>
              <name>SPI_SMEM_PMS0_RD_ATTR</name>
              <description>1: SPI1 external RAM PMS section 0 read accessible. 0: Not allowed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS0_WR_ATTR</name>
              <description>1: SPI1 external RAM PMS section 0 write accessible. 0: Not allowed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS0_ECC</name>
              <description>SPI1 external RAM PMS section 0 ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section 0 is configured by registers SPI_SMEM_PMS0_ADDR_REG and SPI_SMEM_PMS0_SIZE_REG.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS0_NONSECURE_RD_ATTR</name>
              <description>1: SPI1 external RAM non-secure PMS section 0 read accessible. 0: Not allowed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS0_NONSECURE_WR_ATTR</name>
              <description>1: SPI1 external RAM non-secure PMS section 0 write accessible. 0: Not allowed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS0_NONSECURE_ECC</name>
              <description>SPI1 external RAM non-secure PMS section 0 ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section 0 is configured by registers SPI_SMEM_PMS0_ADDR_REG and SPI_SMEM_PMS0_SIZE_REG.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SMEM_PMS1_ATTR</name>
          <description>SPI1 external RAM PMS section $n attribute register</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000001B</resetValue>
          <fields>
            <field>
              <name>SPI_SMEM_PMS1_RD_ATTR</name>
              <description>1: SPI1 external RAM PMS section 1 read accessible. 0: Not allowed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS1_WR_ATTR</name>
              <description>1: SPI1 external RAM PMS section 1 write accessible. 0: Not allowed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS1_ECC</name>
              <description>SPI1 external RAM PMS section 1 ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section 1 is configured by registers SPI_SMEM_PMS1_ADDR_REG and SPI_SMEM_PMS1_SIZE_REG.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS1_NONSECURE_RD_ATTR</name>
              <description>1: SPI1 external RAM non-secure PMS section 1 read accessible. 0: Not allowed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS1_NONSECURE_WR_ATTR</name>
              <description>1: SPI1 external RAM non-secure PMS section 1 write accessible. 0: Not allowed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS1_NONSECURE_ECC</name>
              <description>SPI1 external RAM non-secure PMS section 1 ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section 1 is configured by registers SPI_SMEM_PMS1_ADDR_REG and SPI_SMEM_PMS1_SIZE_REG.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
