espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>SPI_SMEM_PMS2_ATTR</name>
          <description>SPI1 external RAM PMS section $n attribute register</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000001B</resetValue>
          <fields>
            <field>
              <name>SPI_SMEM_PMS2_RD_ATTR</name>
              <description>1: SPI1 external RAM PMS section 2 read accessible. 0: Not allowed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS2_WR_ATTR</name>
              <description>1: SPI1 external RAM PMS section 2 write accessible. 0: Not allowed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS2_ECC</name>
              <description>SPI1 external RAM PMS section 2 ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section 2 is configured by registers SPI_SMEM_PMS2_ADDR_REG and SPI_SMEM_PMS2_SIZE_REG.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS2_NONSECURE_RD_ATTR</name>
              <description>1: SPI1 external RAM non-secure PMS section 2 read accessible. 0: Not allowed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS2_NONSECURE_WR_ATTR</name>
              <description>1: SPI1 external RAM non-secure PMS section 2 write accessible. 0: Not allowed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS2_NONSECURE_ECC</name>
              <description>SPI1 external RAM non-secure PMS section 2 ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section 2 is configured by registers SPI_SMEM_PMS2_ADDR_REG and SPI_SMEM_PMS2_SIZE_REG.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SMEM_PMS3_ATTR</name>
          <description>SPI1 external RAM PMS section $n attribute register</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000001B</resetValue>
          <fields>
            <field>
              <name>SPI_SMEM_PMS3_RD_ATTR</name>
              <description>1: SPI1 external RAM PMS section 3 read accessible. 0: Not allowed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS3_WR_ATTR</name>
              <description>1: SPI1 external RAM PMS section 3 write accessible. 0: Not allowed.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS3_ECC</name>
              <description>SPI1 external RAM PMS section 3 ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section 3 is configured by registers SPI_SMEM_PMS3_ADDR_REG and SPI_SMEM_PMS3_SIZE_REG.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS3_NONSECURE_RD_ATTR</name>
              <description>1: SPI1 external RAM non-secure PMS section 3 read accessible. 0: Not allowed.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS3_NONSECURE_WR_ATTR</name>
              <description>1: SPI1 external RAM non-secure PMS section 3 write accessible. 0: Not allowed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PMS3_NONSECURE_ECC</name>
              <description>SPI1 external RAM non-secure PMS section 3 ECC mode, 1: enable ECC mode. 0: Disable it. The external RAM PMS section 3 is configured by registers SPI_SMEM_PMS3_ADDR_REG and SPI_SMEM_PMS3_SIZE_REG.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SPI_SMEM_PMS%s_ADDR</name>
          <description>SPI1 external RAM PMS section %s start address register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>S</name>
              <description>SPI1 external RAM PMS section %s start address value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SPI_SMEM_PMS%s_SIZE</name>
          <description>SPI1 external RAM PMS section %s start address register</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <resetValue>0x00001000</resetValue>
          <fields>
            <field>
              <name>SPI_SMEM_PMS_SIZE</name>
              <description>SPI1 external RAM PMS section %s address region is (SPI_SMEM_PMS%s_ADDR_S, SPI_SMEM_PMS%s_ADDR_S + SPI_SMEM_PMS%s_SIZE)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMS_REJECT</name>
          <description>SPI1 access reject register</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PM_EN</name>
              <description>Set this bit to enable SPI0/1 transfer permission control function.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMS_LD</name>
              <description>1: SPI1 write access error. 0: No write access error. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMS_ST</name>
              <description>1: SPI1 read access error. 0: No read access error. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMS_MULTI_HIT</name>
              <description>1: SPI1 access is rejected because of address miss. 0: No address miss error. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMS_IVD</name>
              <description>1: SPI1 access is rejected because of address multi-hit. 0: No address multi-hit error. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMS_REJECT_ADDR</name>
          <description>SPI1 access reject addr register</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REJECT_ADDR</name>
              <description>This bits show the first SPI1 access error address. It is cleared by when  SPI_MEM_PMS_REJECT_INT_CLR bit is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_CTRL</name>
          <description>MSPI ECC control register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <resetValue>0x01005000</resetValue>
          <fields>
            <field>
              <name>ECC_ERR_CNT</name>
              <description>This bits show the error times of MSPI ECC read. It is cleared by when  SPI_MEM_ECC_ERR_INT_CLR bit is set.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_FMEM_ECC_ERR_INT_NUM</name>
              <description>Set the error times of MSPI ECC read to generate MSPI SPI_MEM_ECC_ERR_INT interrupt.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_ECC_ERR_INT_EN</name>
              <description>Set this bit to calculate the error times of MSPI ECC read when accesses to flash.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_PAGE_SIZE</name>
              <description>Set the page size of the flash accessed by MSPI. 0: 256 bytes. 1: 512 bytes. 2: 1024 bytes. 3: 2048 bytes.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_FMEM_ECC_ADDR_EN</name>
              <description>Set this bit to enable MSPI ECC address conversion, no matter MSPI accesses to the ECC region or non-ECC region of flash. If there is no ECC region in flash, this bit should be 0. Otherwise, this bit should be 1.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USR_ECC_ADDR_EN</name>
              <description>Set this bit to enable ECC address convert in SPI0/1 USR_CMD transfer.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_CONTINUE_RECORD_ERR_EN</name>
              <description>1: The error information in SPI_MEM_ECC_ERR_BITS and SPI_MEM_ECC_ERR_ADDR is updated when there is an ECC error. 0: SPI_MEM_ECC_ERR_BITS and SPI_MEM_ECC_ERR_ADDR record the first ECC error information.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_ERR_BITS</name>
              <description>Records the first ECC error bit number in the 16 bytes(From 0~127, corresponding to byte 0 bit 0 to byte 15 bit 7)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_ERR_ADDR</name>
          <description>MSPI ECC error address register</description>
          <addressOffset>0x16C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ECC_ERR_ADDR</name>
              <description>This bits show the first MSPI ECC error address. It is cleared by when  SPI_MEM_ECC_ERR_INT_CLR bit is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_ERR_ADDR</name>
          <description>SPI0 AXI request error address.</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AXI_ERR_ADDR</name>
              <description>This bits show the first AXI write/read invalid error or AXI write flash error address. It is cleared by when SPI_MEM_AXI_WADDR_ERR_INT_CLR, SPI_MEM_AXI_WR_FLASH_ERR_IN_CLR or SPI_MEM_AXI_RADDR_ERR_IN_CLR bit is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SMEM_ECC_CTRL</name>
          <description>MSPI ECC control register</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <resetValue>0x00080000</resetValue>
          <fields>
            <field>
              <name>SPI_SMEM_ECC_ERR_INT_EN</name>
              <description>Set this bit to calculate the error times of MSPI ECC read when accesses to external RAM.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_PAGE_SIZE</name>
              <description>Set the page size of the external RAM accessed by MSPI. 0: 256 bytes. 1: 512 bytes. 2: 1024 bytes. 3: 2048 bytes.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SMEM_ECC_ADDR_EN</name>
              <description>Set this bit to enable MSPI ECC address conversion, no matter MSPI accesses to the ECC region or non-ECC region of external RAM. If there is no ECC region in external RAM, this bit should be 0. Otherwise, this bit should be 1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SMEM_AXI_ADDR_CTRL</name>
          <description>SPI0 AXI address control register</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <resetValue>0xFC000000</resetValue>
          <fields>
            <field>
              <name>ALL_FIFO_EMPTY</name>
              <description>The empty status of all AFIFO and SYNC_FIFO in MSPI module. 1: All AXI transfers and SPI0 transfers are done. 0: Others.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_RDATA_AFIFO_REMPTY</name>
              <description>1: RDATA_AFIFO is empty. 0: At least one AXI read transfer is pending.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_RADDR_AFIFO_REMPTY</name>
              <description>1: AXI_RADDR_CTL_AFIFO is empty. 0: At least one AXI read transfer is pending.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_WDATA_AFIFO_REMPTY</name>
              <description>1: WDATA_AFIFO is empty. 0: At least one AXI write transfer is pending.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_WBLEN_AFIFO_REMPTY</name>
              <description>1: WBLEN_AFIFO is empty. 0: At least one AXI write transfer is pending.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_ALL_AXI_TRANS_AFIFO_EMPTY</name>
              <description>This bit is set when WADDR_AFIFO, WBLEN_AFIFO, WDATA_AFIFO, AXI_RADDR_CTL_AFIFO and RDATA_AFIFO are empty and spi0_mst_st is IDLE.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_ERR_RESP_EN</name>
          <description>SPI0 AXI error response enable register</description>
          <addressOffset>0x17C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AW_RESP_EN_MMU_VLD</name>
              <description>Set this bit  to enable AXI response function for mmu valid err in axi write trans.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AW_RESP_EN_MMU_GID</name>
              <description>Set this bit  to enable AXI response function for mmu gid err in axi write trans.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AW_RESP_EN_AXI_SIZE</name>
              <description>Set this bit  to enable AXI response function for axi size err in axi write trans.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AW_RESP_EN_AXI_FLASH</name>
              <description>Set this bit  to enable AXI response function for axi flash err in axi write trans.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AW_RESP_EN_MMU_ECC</name>
              <description>Set this bit  to enable AXI response function for mmu ecc err in axi write trans.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AW_RESP_EN_MMU_SENS</name>
              <description>Set this bit  to enable AXI response function for mmu sens in err axi write trans.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AW_RESP_EN_AXI_WSTRB</name>
              <description>Set this bit  to enable AXI response function for axi wstrb err in axi write trans.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AR_RESP_EN_MMU_VLD</name>
              <description>Set this bit  to enable AXI response function for mmu valid err in axi read trans.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AR_RESP_EN_MMU_GID</name>
              <description>Set this bit  to enable AXI response function for mmu gid err in axi read trans.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AR_RESP_EN_MMU_ECC</name>
              <description>Set this bit  to enable AXI response function for mmu ecc err in axi read trans.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AR_RESP_EN_MMU_SENS</name>
              <description>Set this bit  to enable AXI response function for mmu sensitive err in axi read trans.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AR_RESP_EN_AXI_SIZE</name>
              <description>Set this bit  to enable AXI response function for axi size err in axi read trans.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING_CALI</name>
          <description>SPI0 flash timing calibration register</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>TIMING_CLK_ENA</name>
              <description>The bit is used to enable timing adjust clock for all reading operations.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_CALI</name>
              <description>The bit is used to enable timing auto-calibration for all reading operations.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTRA_DUMMY_CYCLELEN</name>
              <description>add extra dummy spi clock cycle length for spi clock calibration.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLL_TIMING_CALI</name>
              <description>Set this bit to enable DLL for timing calibration in DDR mode when accessed to flash.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATE</name>
              <description>Set this bit to update delay mode, delay num and extra dummy in MSPI.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
