espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>SLAVE</name>
          <description>SPI slave control register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <resetValue>0x02800000</resetValue>
          <fields>
            <field>
              <name>CLK_MODE</name>
              <description>Configures SPI clock mode.\\
0: SPI clock is off when CS becomes inactive.\\
1: SPI clock is delayed one cycle after CS becomes inactive.\\
2: SPI clock is delayed two cycles after CS becomes inactive.\\
3: SPI clock is always on.\\
Can be configured in CONF state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_MODE_13</name>
              <description>Configure clock mode.\\
0: Support SPI clock mode 0 or 2. See Table &lt;a href='table:clock_pol_slave'&gt;link&lt;/a&gt;.\\
1: Support SPI clock mode 1 or 3. See Table &lt;a href='table:clock_pol_slave'&gt;link&lt;/a&gt;.\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSCK_DATA_OUT</name>
              <description>Configures the edge of output data.\\
0: Output data at TSCK rising edge.\\
1: Output data at RSCK rising edge.\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLV_RDDMA_BITLEN_EN</name>
              <description>Configures whether or not to use SPI_SLV_DATA_BITLEN to store the data bit length of Rd_DMA transfer.\\
0: Not use\\
1: Use\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLV_WRDMA_BITLEN_EN</name>
              <description>Configures whether or not to use SPI_SLV_DATA_BITLEN to store the data bit length of Wr_DMA transfer.\\
0: Not use\\
1: Use\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLV_RDBUF_BITLEN_EN</name>
              <description>Configures whether or not to use SPI_SLV_DATA_BITLEN to store the data bit length of Rd_BUF transfer.\\
0: Not use\\
1: Use\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLV_WRBUF_BITLEN_EN</name>
              <description>Configures whether or not to use SPI_SLV_DATA_BITLEN to store the data bit length of Wr_BUF transfer.\\
0: Not use\\
1: Use\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLV_LAST_BYTE_STRB</name>
              <description>Represents the effective bit of the last received data byte in SPI slave FD and HD mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_SEG_MAGIC_VALUE</name>
              <description>Configures the magic value of BM table in DMA-controlled configurable segmented transfer.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Configures SPI work mode.\\
0: Master\\
1: Slave\\</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFT_RESET</name>
              <description>Configures whether to reset the SPI clock line, CS line, and data line via software.\\
0: Not reset\\
1: Reset\\
Can be configured in CONF state.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>USR_CONF</name>
              <description>Configures whether or not to enable the CONF state of current DMA-controlled configurable segmented transfer.\\
0: No effect, which means the current transfer is not a configurable segmented transfer.\\
1: Enable, which means a configurable segmented transfer is started.\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MST_FD_WAIT_DMA_TX_DATA</name>
              <description>Configures whether or not to wait DMA TX data gets ready before starting SPI transfer in master full-duplex transfer.\\
0: Not wait\\
1: Wait\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SLAVE1</name>
          <description>SPI slave control register 1</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SLV_DATA_BITLEN</name>
              <description>Configures the transferred data bit length in SPI slave full-/half-duplex modes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLV_LAST_COMMAND</name>
              <description>Configures the command value in slave mode.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLV_LAST_ADDR</name>
              <description>Configures the address value in slave mode.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_GATE</name>
          <description>SPI module clock and register clock control</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether or not to enable clock gate.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MST_CLK_ACTIVE</name>
              <description>Set this bit to power on the SPI module clock.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MST_CLK_SEL</name>
              <description>This bit is used to select SPI module clock source in master mode. 1: PLL_CLK_80M. 0: XTAL CLK.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
