espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register>
          <name>STATUS_11</name>
          <description>need_des</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PAD11_DATA</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PAD11_DEBOUNCE_CNT</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PAD11_NN_CNT</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_12</name>
          <description>need_des</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PAD12_DATA</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PAD12_DEBOUNCE_CNT</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PAD12_NN_CNT</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_13</name>
          <description>need_des</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PAD13_DATA</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PAD13_DEBOUNCE_CNT</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PAD13_NN_CNT</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_14</name>
          <description>need_des</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PAD14_DATA</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PAD14_DEBOUNCE_CNT</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PAD14_NN_CNT</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_15</name>
          <description>need_des</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>SLP_DATA</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLP_DEBOUNCE_CNT</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLP_NN_CNT</name>
              <description>need_des</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_16</name>
          <description>need_des</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APPROACH_PAD2_CNT</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROACH_PAD1_CNT</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APPROACH_PAD0_CNT</name>
              <description>need_des</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SLP_APPROACH_CNT</name>
              <description>need_des</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS_17</name>
          <description>need_des</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DCAP_LPF</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DRES_LPF</name>
              <description>need_des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DRV_LS</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DRV_HS</name>
              <description>need_des</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DBIAS</name>
              <description>need_des</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FREQ_SCAN_CNT</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHN_TMP_STATUS</name>
          <description>need_des</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PAD_INACTIVE_STATUS</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PAD_ACTIVE_STATUS</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
