espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
        <register derivedFrom="DMA.DATE">
          <name>DATE</name>
          <description>Date register</description>
          <addressOffset>0x80</addressOffset>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USB0</name>
      <description>USB OTG (On-The-Go)</description>
      <groupName>USB_OTGFS</groupName>
      <baseAddress>0x60040000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2A0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GOTGCTL</name>
          <description>OTG Control and Status Register The OTG Control and Status register controls the behavior and reflects the status of the OTG function of the controller.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00010000</resetValue>
          <fields>
            <field>
              <name>SESREQSCS</name>
              <description>Mode: Device only
Session Request Success (SesReqScs)
The core sets this bit when a session request initiation is successful.
 - 1'b0: Session request failure
 - 1'b1: Session request success</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SESREQ</name>
              <description>Mode: Device only
Session Request (SesReq)
The application sets this bit to initiate a session request on the USB. The application can clear this bit by writing a 0 when the Host Negotiation Success Status Change bit in the OTG Interrupt register (GOTGINT.HstNegSucStsChng) is SET. The core clears this bit when the HstNegSucStsChng bit is cleared.
If you use the USB 1.1 Full-Speed Serial Transceiver interface to initiate the session request, the application must wait until the VBUS discharges to 0.2 V, after the B-Session Valid bit in this register (GOTGCTL.BSesVld) is cleared. This discharge time varies between different PHYs and can be obtained from the PHY vendor.
 - 1'b0: No session request
 - 1'b1: Session request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBVALIDOVEN</name>
              <description>Mode: Host only
VBUS Valid Override Enable (VbvalidOvEn)
This bit is used to enable/disable the software to override the Bvalid signal using the GOTGCTL.VbvalidOvVal.
 - 1'b1 : Internally Bvalid received from the PHY is overridden with GOTGCTL.VbvalidOvVal.
 - 1'b0 : Override is disabled and bvalid signal from the respective PHY selected is used internally by the controller.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBVALIDOVVAL</name>
              <description>Mode: Host only
VBUS Valid OverrideValue (VbvalidOvVal)
This bit is used to set Override value for vbusvalid signal when GOTGCTL.VbvalidOvEn is set.
 - 1'b0 : vbusvalid value is 1'b0 when GOTGCTL.VbvalidOvEn =1
 - 1'b1 : vbusvalid value is 1'b1 when GOTGCTL.VbvalidOvEn =1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVALIDOVEN</name>
              <description>Mode: Host only
A-Peripheral Session Valid Override Enable (AvalidOvEn)
This bit is used to enable/disable the software to override the Avalid signal using the GOTGCTL.AvalidOvVal.
 - 1'b1: Internally Avalid received from the PHY is overridden with GOTGCTL.AvalidOvVal.
 - 1'b0: Override is disabled and avalid signal from the respective PHY selected is used internally by the core</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVALIDOVVAL</name>
              <description>Mode: Host only
A-Peripheral Session Valid OverrideValue (AvalidOvVal)
This bit is used to set Override value for Avalid signal when GOTGCTL.AvalidOvEn is set.
 - 1'b0 : Avalid value is 1'b0 when GOTGCTL.AvalidOvEn =1
 - 1'b1 : Avalid value is 1'b1 when GOTGCTL.AvalidOvEn =1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BVALIDOVEN</name>
              <description>Mode: Device only
B-Peripheral Session Valid Override Value (BvalidOvEn)
This bit is used to enable/disable the software to override the Bvalid signal using the GOTGCTL.BvalidOvVal.
 - 1'b1 : Internally Bvalid received from the PHY is overridden with GOTGCTL.BvalidOvVal.
 - 1'b0 : Override is disabled and bvalid signal from the respective PHY selected is used internally by the force</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BVALIDOVVAL</name>
              <description>Mode: Device only
B-Peripheral Session Valid OverrideValue (BvalidOvVal)
This bit is used to set Override value for Bvalid signal when GOTGCTL.BvalidOvEn is set.
 - 1'b0 : Bvalid value is 1'b0 when GOTGCTL.BvalidOvEn =1
 - 1'b1 : Bvalid value is 1'b1 when GOTGCTL.BvalidOvEn =1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSTNEGSCS</name>
              <description>Mode: HNP-capable Device
Host Negotiation Success (HstNegScs)
The controller sets this bit when host negotiation is successful. The controller clears this bit when the HNP Request (HNPReq) bit in this register is set.
 - 1'b0: Host negotiation failure
 - 1'b1: Host negotiation success</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HNPREQ</name>
              <description>Mode: HNP Capable OTG Device
HNP Request (HNPReq)
The application sets this bit to initiate an HNP request to the connected USB host. The application can clear this bit by writing a 0 when the Host Negotiation Success Status Change bit in the OTG Interrupt register (GOTGINT.HstNegSucStsChng) is SET. The controller clears this bit when the HstNegSucStsChng bit is cleared.
 - 1'b0: No HNP request
 - 1'b1: HNP request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSTSETHNPEN</name>
              <description>Mode: HNP Capable OTG Host
Host Set HNP Enable (HstSetHNPEn)
The application sets this bit when it has successfully enabled HNP (using the SetFeature.SetHNPEnable command) on the connected device.
 - 1'b0: Host Set HNP is not enabled
 - 1'b1: Host Set HNP is enabled</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVHNPEN</name>
              <description>Mode: HNP Capable OTG Device
 Device HNP Enabled (DevHNPEn)
The application sets this bit when it successfully receives a SetFeature.SetHNPEnable command from the connected USB host.
 - 1'b0: HNP is not enabled in the application
 - 1'b1: HNP is enabled in the application</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EHEN</name>
              <description>Mode: SRP Capable Host
Embedded Host Enable (EHEn)
It is used to select between OTG A Device state Machine and Embedded Host state machine.
 - 1'b0: OTG A Device state machine is selected
 - 1'b1: Embedded Host State Machine is selected
Note:
 This field is valid only in SRP-Capable OTG Mode (OTG_MODE=0,1).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBNCEFLTRBYPASS</name>
              <description>Mode: Host and Device
Debounce Filter Bypass
Bypass Debounce filters for avalid, bvalid, vbusvalid, sessend, iddig signals when enabled.
 - 1'b0: Disabled
 - 1'b1: Enabled


Note:  This register bit is valid only when debounce filters are present in core.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONIDSTS</name>
              <description>Mode: Host and Device
Connector ID Status (ConIDSts)
Indicates the connector ID status on a connect event.
 - 1'b0: The core is in A-Device mode.
 - 1'b1: The core is in B-Device mode.

