espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
The application uses this bit to select either a unidirectional or bidirectional USB 1.1 full-speed serial transceiver interface.
 - 1'b0: 6-pin unidirectional full-speed serial interface
 - 1'b1: 3-pin bidirectional full-speed serial interface
If a USB 1.1 Full-Speed Serial Transceiver interface was not selected, this bit is always 0, with Write Only access. If a USB 1.1 FS interface was selected, Then the application can Set this bit to select between the 3- and 6-pin interfaces, and access is Read and Write.

Note: For supporting the new 4-pin bi-directional interface, you need to select 6-pin unidirectional FS serial mode, and add an external control to convert it to a 4-pin interface.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYSEL</name>
              <description>PHYSel

Mode: Host and Device

USB 2.0 High-Speed PHY or USB 1.1 Full-Speed Serial Transceiver Select (PHYSel)
The application uses this bit to select either a high-speed UTMI+ or ULPI PHY, or a full-speed transceiver.
 - 1'b0: USB 2.0 high-speed UTMI+ or ULPI PHY
 - 1'b1: USB 1.1 full-speed serial transceiver
If a USB 1.1 Full-Speed Serial Transceiver interface was not selected in, this bit is always 0, with Write Only access.
If a high-speed PHY interface was not selected in, this bit is always 1, with Write Only access.
If both interface types were selected (parameters have non-zero values), the application uses this bit to select which interface is active, and access is Read and Write.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SRPCAP</name>
              <description>Mode: Host and Device
SRP-Capable (SRPCap)
The application uses this bit to control the controller's SRP capabilities. If the core operates as a non-SRP-capable B-device, it cannot request the connected A-device (host) to
activate VBUS and start a session.
 - 1'b0: SRP capability is not enabled.
 - 1'b1: SRP capability is enabled.
If SRP functionality is disabled by the software, the OTG signals on the PHY domain must be tied to the appropriate values.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HNPCAP</name>
              <description>Mode: Host and Device
HNP-Capable (HNPCap)
The application uses this bit to control the controller's HNP capabilities.
 - 1'b0: HNP capability is not enabled.
 - 1'b1: HNP capability is enabled.
If HNP functionality is disabled by the software, the OTG signals on the PHY domain must be tied to the appropriate values.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBTRDTIM</name>
              <description>Mode: Device only
USB Turnaround Time (USBTrdTim)
Sets the turnaround time in PHY clocks. Specifies the response time for a MAC request to the Packet FIFO Controller (PFC) to fetch data from the DFIFO (SPRAM). This must be programmed to
 - 4'h5: When the MAC interface is 16-bit UTMI+ .
 - 4'h9: When the MAC interface is 8-bit UTMI+ .
Note: The previous values are calculated for the minimum AHB frequency of 30 MHz. USB turnaround time is critical for certification where long cables and 5-Hubs are used. If you need the AHB to run at less than 30 MHz, and if USB turnaround time is not critical, these bits can be programmed to a larger value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TERMSELDLPULSE</name>
              <description>Mode: Device only
TermSel DLine Pulsing Selection (TermSelDLPulse)
This bit selects utmi_termselect to drive data line pulse during SRP.
 - 1'b0: Data line pulsing using utmi_txvalid (Default).
 - 1'b1: Data line pulsing using utmi_termsel.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IC_USBCAP</name>
              <description>Mode: Host and Device
IC_USB-Capable (IC_USBCap)
The application uses this bit to control the core's IC_USB capabilities.
 - 1'b0: IC_USB PHY Interface is not selected.
 - 1'b1: IC_USB PHY Interface is selected.
This bit is writable only if OTG_ENABLE_IC_USB=1 and OTG_FSPHY_INTERFACE!=0.
The reset value depends on the configuration parameter OTG_SELECT_IC_USB when OTG_ENABLE_IC_USB = 1. In all other cases, this bit is set to 1'b0 and the bit is read only.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXENDDELAY</name>
              <description>Mode: Device only
Tx End Delay (TxEndDelay)
Writing 1'b1 to this bit enables the controller to follow the TxEndDelay timings as per UTMI+ specification 1.05 section 4.1.5 for opmode signal during remote wakeup.
 - 1'b0 : Normal Mode.
 - 1'b1 : Tx End delay.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEHSTMODE</name>
              <description>Mode: Host and device
Force Host Mode (ForceHstMode)
Writing a 1 to this bit forces the core to host mode irrespective of utmiotg_iddig input pin.
 - 1'b0 : Normal Mode.
 - 1'b1 : Force Host Mode.
After setting the force bit, the application must wait at least 25 ms before the change to take effect. When the simulation is in scale down mode, waiting for 500 micro sec is sufficient. This bit is valid only when OTG_MODE = 0, 1 or 2. In all other cases, this bit reads 0.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCEDEVMODE</name>
              <description>Mode:Host and device
Force Device Mode (ForceDevMode)
Writing a 1 to this bit forces the controller to device mode irrespective of utmiotg_iddig input pin.
 - 1'b0 : Normal Mode.
 - 1'b1 : Force Device Mode.
After setting the force bit, the application must wait at least 25 ms before the change to take effect. When the simulation is in scale down mode, waiting for 500 micro sec is sufficient. This bit is valid only when OTG_MODE = 0, 1 or 2. In all other cases, this bit reads 0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORRUPTTXPKT</name>
              <description>Mode: Host and device
Corrupt Tx packet (CorruptTxPkt)
This bit is for debug purposes only. Never Set this bit to 1. The application should always write 1'b0 to this bit.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRSTCTL</name>
          <description>Reset Register The application uses this register to reset various hardware features inside the controller.</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>CSFTRST</name>
              <description>Mode: Host and Device
Core Soft Reset (CSftRst)
Resets the hclk and phy_clock domains as follows:
 - Clears the interrupts and all the CSR registers except the following register bits:
 -- PCGCCTL.RstPdwnModule
 -- PCGCCTL.GateHclk
 -- PCGCCTL.PwrClmp
 -- PCGCCTL.StopPPhyLPwrClkSelclk
 -- GUSBCFG.ForceDevMode
 -- GUSBCFG.ForceHstMode
 -- GUSBCFG.PhyLPwrClkSel
 -- GUSBCFG.DDRSel
 -- GUSBCFG.PHYSel
 -- GUSBCFG.FSIntf
 -- GUSBCFG.ULPI_UTMI_Sel
 -- GUSBCFG.TxEndDelay
 -- GUSBCFG.TermSelDLPulse
 -- GUSBCFG.ULPIClkSusM
 -- GUSBCFG.ULPIAutoRes
 -- GUSBCFG.ULPIFsLs
 -- GGPIO
 -- GPWRDN
 -- GADPCTL
 -- HCFG.FSLSPclkSel
 -- DCFG.DevSpd
 -- DCTL.SftDiscon
 - All module state machines
 - All module state machines (except the AHB Slave Unit) are reset to the IDLE state, and all the transmit FIFOs and the receive FIFO are flushed.
 - Any transactions on the AHB Master are terminated as soon as possible, after gracefully completing the last data phase of an AHB transfer. Any transactions on the USB are terminated immediately.
 - When Hibernation or ADP feature is enabled, the PMU module is not reset by the Core Soft Reset.
The application can write to this bit any time it wants to reset the core. This is a self-clearing bit and the core clears this bit after
all the necessary logic is reset in the core, which can take several clocks, depending on the current state of the core. Once this bit is cleared software must wait at least 3 PHY clocks before doing any access to the PHY domain (synchronization delay). Software must also must check that bit 31 of this register is 1 (AHB Master is IDLE) before starting any operation.

Typically software reset is used during software development and also when you dynamically change the PHY selection bits in the USB configuration registers listed above. When you change the PHY, the corresponding clock for the PHY is selected and used in the PHY domain. Once a new clock is selected, the PHY domain has to be reset for proper operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIUFSSFTRST</name>
              <description>Mode: Host and Device
PIU FS Dedicated Controller Soft Reset (PIUFSSftRst)

Resets the PIU FS Dedicated Controller
 All module state machines in FS Dedicated Controller of PIU are reset to the IDLE state. Used to reset the FS Dedicated controller in PIU in case of any PHY Errors like Loss of activity or Babble Error resulting in the PHY remaining in RX state for more than one frame boundary.
This is a self clearing bit and core clears this bit after all the necessary logic is reset in the core.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRMCNTRRST</name>
              <description>Mode: Host only
Host Frame Counter Reset (FrmCntrRst)
The application writes this bit to reset the (micro)Frame number counter inside the core. When the (micro)Frame counter is reset, the subsequent SOF sent out by the core has a (micro)Frame number of 0.
When application writes 1 to the bit, it might not be able to read back the value as it will get cleared by the core in a few clock cycles.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFFLSH</name>
              <description>Mode: Host and Device
RxFIFO Flush (RxFFlsh)
The application can flush the entire RxFIFO using this bit, but must first ensure that the core is not in the middle of a transaction.
The application must only write to this bit after checking that the controller is neither reading from the RxFIFO nor writing to the RxFIFO.

The application must wait until the bit is cleared before performing any other operations. This bit requires eight clocks (slowest of PHY or AHB clock) to clear.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFFLSH</name>
              <description>Mode: Host and Device
TxFIFO Flush (TxFFlsh)
This bit selectively flushes a single or all transmit FIFOs, but cannot do so If the core is in the midst of a transaction.
The application must write this bit only after checking that the core is neither writing to the TxFIFO nor reading from the TxFIFO.
Verify using these registers:
 - ReadNAK Effective Interrupt ensures the core is not reading from the FIFO
 - WriteGRSTCTL.AHBIdle ensures the core is not writing anything to the FIFO.
Flushing is normally recommended when FIFOs are reconfigured or when switching between Shared FIFO and Dedicated Transmit FIFO operation. FIFO flushing is also recommended during device endpoint disable. The application must wait until the core clears this bit before performing any operations. This bit takes eight clocks to clear, using the slower clock of phy_clk or hclk.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>Mode: Host and Device
TxFIFO Number (TxFNum)
This is the FIFO number that must be flushed using the TxFIFO Flush bit. This field must not be changed until the core clears the TxFIFO Flush bit.
 - 5'h0:
 -- Non-periodic TxFIFO flush in Host mode
 -- Non-periodic TxFIFO flush in device mode when in shared FIFO operation
 -- Tx FIFO 0 flush in device mode when in dedicated FIFO mode
 - 5'h1:
 -- Periodic TxFIFO flush in Host mode
 -- Periodic TxFIFO 1 flush in Device mode when in shared FIFO operation
 -- TXFIFO 1 flush in device mode when in dedicated FIFO mode
 - 5'h2:
 -- Periodic TxFIFO 2 flush in Device mode when in shared FIFO operation
 -- TXFIFO 2 flush in device mode when in dedicated FIFO mode
...
 - 5'hF
 -- Periodic TxFIFO 15 flush in Device mode when in shared FIFO operation
 -- TXFIFO 15 flush in device mode when in dedicated FIFO mode
 - 5'h10: Flush all the transmit FIFOs in device or host mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAREQ</name>
              <description>Mode: Host and Device
DMA Request Signal (DMAReq)
Indicates that the DMA request is in progress. Used for debug.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHBIDLE</name>
              <description>Mode: Host and Device
AHB Master Idle (AHBIdle)
Indicates that the AHB Master State Machine is in the IDLE condition.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GINTSTS</name>
          <description>Interrupt Register  This register interrupts the application for system-level events in the current mode (Device mode or Host mode). Some of the bits in this register are valid only in Host mode, while others are valid in Device mode only. This register also indicates the current mode. To clear the interrupt status bits of type R_SS_WC, the application must write 1'b1 into the bit. The FIFO status interrupts are read only; once software reads from or writes to the FIFO while servicing these interrupts, FIFO interrupt conditions are cleared automatically. The application must clear the GINTSTS register at initialization before unmasking the interrupt bit to avoid any interrupts generated prior to initialization.  Note: Read the reset value of GINTSTS.CurMod only after the following conditions:  - If IDDIG_FILTER is disabled, read only after PHY clock is stable.  - If IDDIG_FILTER is enabled, read only after the filter timer expires.</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x04000020</resetValue>
          <fields>
            <field>
              <name>CURMOD</name>
              <description>Mode: Host and Device
Current Mode of Operation (CurMod)
Indicates the current mode.
 - 1'b0: Device mode
 - 1'b1: Host mode


