espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
Range: 0-15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PARTIALPWRDN</name>
              <description>Enable Partial Power Down (PartialPwrDn)
 - 1'b0: Partial Power Down Not Enabled
 - 1'b1: Partial Power Down Enabled</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHBFREQ</name>
              <description>Minimum AHB Frequency Less Than 60 MHz (AhbFreq)
 - 1'b0: No
 - 1'b1: Yes</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HIBERNATION</name>
              <description>Enable Hibernation (Hibernation)
 - 1'b0: Hibernation feature not enabled
 - 1'b1: Hibernation feature enabled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTENDEDHIBERNATION</name>
              <description>Enable Hibernation
 - 1'b0: Extended Hibernation feature not enabled
 - 1'b1: Extended Hibernation feature enabled</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACGSUPT</name>
              <description>Active Clock Gating Support

This bit indicates that the controller supports the Dynamic (Switching) Power Reduction during periods
when there is no USB and AHB Traffic.
 - 1'b0:  Active Clock Gating is not enabled.
 - 1'b1:  Active Clock Gating Enabled.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENHANCEDLPMSUPT</name>
              <description>Enhanced LPM Support (EnhancedLPMSupt)

This bit indicates that the controller supports the following behavior:
L1 Entry Behavior based on FIFO Status
 - TX FIFO
     - Accept L1 Request even if ISOC OUT TX FIFO is not empty.
     - Reject L1 Request if Non-Periodic TX FIFO is not empty.
     - Ensure application can flush the TX FIFO while the Controller is in L1.
 - RX FIFO
     - Accept L1 Request even if RX FIFO (common to Periodic and Non-Periodic) is not empty.
     - Accept L1 Request but delay SLEEPM assertion until RX SINK Buffer is empty.

Prevent L1 Entry if a Control Transfer is in progress on any Control Endpoint.
Ability to Flush TxFIFO even if PHY Clock is gated.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHYDATAWIDTH</name>
              <description>UTMI+ PHY/ULPI-to-Internal UTMI+ Wrapper Data Width
(PhyDataWidth)&lt;vr&gt;When a ULPI PHY is used, an internal wrapper converts ULPI to
UTMI+.
 - 2'b00: 8 bits
 - 2'b01: 16 bits
 - 2'b10: 8/16 bits, software selectable
 - Others: Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUMCTLEPS</name>
              <description>Number of Device Mode Control Endpoints in Addition to
Endpoint 0 (NumCtlEps)
Range: 0-15</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDDGFLTR</name>
              <description>IDDIG Filter Enable (IddgFltr)
 - 1'b0: No filter
 - 1'b1: Filter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VBUSVALIDFLTR</name>
              <description>VBUS Valid Filter Enabled (VBusValidFltr)
 - 1'b0: No filter
 - 1'b1: Filter</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AVALIDFLTR</name>
              <description>a_valid Filter Enabled (AValidFltr)
 - 1'b0: No filter
 - 1'b1: Filter</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BVALIDFLTR</name>
              <description>b_valid Filter Enabled (BValidFltr)
 - 1'b0: No filter
 - 1'b1: Filter</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SESSENDFLTR</name>
              <description>session_end Filter Enabled (SessEndFltr)
 - 1'b0: No filter
 - 1'b1: Filter</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEDFIFOMODE</name>
              <description>Enable Dedicated Transmit FIFO for device IN Endpoints
(DedFifoMode)
 - 1'b0 : Dedicated Transmit FIFO Operation not enabled.
 - 1'b1 : Dedicated Transmit FIFO Operation enabled.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INEPS</name>
              <description>Number of Device Mode IN Endpoints Including Control Endpoints (INEps)
 - 0: 1 IN Endpoint
 - 1: 2 IN Endpoints
 ....
 - 15: 16 IN Endpoints</description>
              <bitOffset>26</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DESCDMAENABLED</name>
              <description>Scatter/Gather DMA configuration
 - 1'b0: Non-Scatter/Gather DMA configuration
 - 1'b1: Scatter/Gather DMA configuration</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DESCDMA</name>
              <description>Scatter/Gather DMA configuration
 - 1'b0: Non Dynamic configuration
 - 1'b1: Dynamic configuration
Note: This field is configured using the OTG_EN_DESC_DMA parameter.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GDFIFOCFG</name>
          <description>Global DFIFO Configuration Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00C80100</resetValue>
          <fields>
            <field>
              <name>GDFIFOCFG</name>
              <description>GDFIFOCfg

This field is for dynamic programming of the DFIFO Size. This value takes effect only when the application programs a non zero value to this register. The value programmed must conform to the guidelines described in 'FIFO RAM Allocation'. The core does not have any corrective logic if the FIFO sizes are programmed incorrectly.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPINFOBASEADDR</name>
              <description>EPInfoBaseAddr

This field provides the start address of the EP info controller.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPTXFSIZ</name>
          <description>Host Periodic Transmit FIFO Size Register  This register holds the size and the memory start address of the Periodic TxFIFO.  Note: Read the reset value of this register only after the following conditions:  - If IDDIG_FILTER is disabled, read only after PHY clock is stable.  - If IDDIG_FILTER is enabled, read only after the filter timer expires.</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x01000200</resetValue>
          <fields>
            <field>
              <name>PTXFSTADDR</name>
              <description>Host Periodic TxFIFO Start Address (PTxFStAddr)

