espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
This field is effective only when HCFG.Ena32KHzS is set.
It will control the resume period when the core resumes from suspend.
The core counts for 'ResValid' number of clock cycles to detect a
valid resume when this is set.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESCDMA</name>
              <description>Enable Scatter/gather DMA in Host mode (DescDMA)

When the Scatter/Gather DMA option selected during configuration of the RTL, the application can set this bit during initialization
to enable the Scatter/Gather DMA operation.

Note: This bit must be modified only once after a reset.

The following combinations are available for programming:
 - GAHBCFG.DMAEn=0,HCFG.DescDMA=0 =&gt; Slave mode
 - GAHBCFG.DMAEn=0,HCFG.DescDMA=1 =&gt; Invalid
 - GAHBCFG.DMAEn=1,HCFG.DescDMA=0 =&gt; Buffered DMA mode
 - GAHBCFG.DMAEn=1,HCFG.DescDMA=1 =&gt; Scatter/Gather DMA mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRLISTEN</name>
              <description>Frame List Entries(FrListEn)

The value in the register specifies the number of entries in the Frame list.
This field is valid only in Scatter/Gather DMA mode.
 - 2'b00: 8 Entries
 - 2'b01: 16 Entries
 - 2'b10: 32 Entries
 - 2'b11: 64 Entries</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERSCHEDENA</name>
              <description>Enable Periodic Scheduling (PerSchedEna):

Applicable in host DDMA mode only.
Enables periodic scheduling within the core. Initially, the bit is reset.
The core will not process any periodic channels.

As soon as this bit is set,
the core will get ready to start scheduling periodic channels and
sets HCFG.PerSchedStat. The setting of HCFG.PerSchedStat indicates the core
has enabled periodic scheduling. Once HCFG.PerSchedEna is set,
the application is not supposed to again reset the bit unless HCFG.PerSchedStat
is set.

As soon as this bit is reset, the core will get ready to
stop scheduling periodic channels and resets HCFG.PerSchedStat.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODECHTIMEN</name>
              <description>Mode Change Ready Timer Enable (ModeChTimEn)

This bit is used to enable/disable the Host core to wait  200 PHY clock cycles at the end of Resume to change the opmode signal to the PHY to 00
after Suspend or LPM.
 - 1'b0 : The Host core waits for either 200 PHY clock cycles or a linestate of SE0 at the end of resume to the change the opmode from 2'b10 to 2'b00
 - 1'b1 : The Host core waits only for a linstate of SE0 at the end of resume to change the opmode from 2'b10 to 2'b00.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFIR</name>
          <description>Host Frame Interval Register</description>
          <addressOffset>0x404</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000EA60</resetValue>
          <fields>
            <field>
              <name>FRINT</name>
              <description>Frame Interval (FrInt)

The value that the application programs to this field specifies
the interval between two consecutive SOFs (FS) or micro-
SOFs (HS) or Keep-Alive tokens (HS). This field contains the
number of PHY clocks that constitute the required frame
interval. The Default value set in this field  is for FS operation
when the PHY clock frequency is 60 MHz. The application can
write a value to this register only after the Port Enable bit of the
Host Port Control and Status register (HPRT.PrtEnaPort) has
been Set. If no value is programmed, the core calculates the
value based on the PHY clock specified in the FS/LS PHY
Clock Select field of the Host Configuration register
(HCFG.FSLSPclkSel). Do not change the value of this field
after the initial configuration.
 - 125 s * (PHY clock frequency for HS)
 - 1 ms * (PHY clock frequency for FS/LS)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HFIRRLDCTRL</name>
              <description>Reload Control (HFIRRldCtrl)

This bit allows dynamic reloading of the HFIR register during run time.
 - 1'b0 : The HFIR cannot be reloaded dynamically
 - 1'b1: the HFIR can be dynamically reloaded during runtime.
This bit needs to be programmed during initial configuration and its value should not be changed during runtime.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFNUM</name>
          <description>Host Frame Number/Frame Time Remaining Register  This register indicates the current frame number. It also indicates the time remaining (in terms of the number of PHY clocks) in the current (micro)frame.  Note: Read the reset value of this register only after the following conditions:  - If IDDIG_FILTER is disabled, read only when the PHY clock is stable.  - If IDDIG_FILTER is enabled, read only after the filter timer expires.</description>
          <addressOffset>0x408</addressOffset>
          <size>0x20</size>
          <resetValue>0x00003FFF</resetValue>
          <fields>
            <field>
              <name>FRNUM</name>
              <description>Frame Number (FrNum)

This field increments when a new SOF is transmitted on the
USB, and is reset to 0 when it reaches 16'h3FFF.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FRREM</name>
              <description>Frame Time Remaining (FrRem)

Indicates the amount of time remaining in the current
microframe (HS) or Frame (FS/LS), in terms of PHY clocks. This
field decrements on each PHY clock. When it reaches zero, this
field is reloaded with the value in the Frame Interval register and
a new SOF is transmitted on the USB.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPTXSTS</name>
          <description>Host Periodic Transmit FIFO/Queue Status Register</description>
          <addressOffset>0x410</addressOffset>
          <size>0x20</size>
          <resetValue>0x00080100</resetValue>
          <fields>
            <field>
              <name>PTXFSPCAVAIL</name>
              <description>Periodic Transmit Data FIFO Space Available (PTxFSpcAvail)

Indicates the number of free locations available to be written to in the Periodic TxFIFO.

