espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
This bit is valid only when Scatter/Gather DMA mode is enabled.
The core generates this interrupt when the descriptor accessed
is not ready for the Core to process. BNA will not be generated
for Isochronous channels.
For non Scatter/Gather DMA mode, this bit is reserved.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XCS_XACT_ERR</name>
              <description>Excessive Transaction Error (XCS_XACT_ERR)

This bit is valid only when Scatter/Gather DMA mode is enabled. The core sets this bit
when 3 consecutive transaction errors occurred on the USB bus. XCS_XACT_ERR will
not be generated for Isochronous channels.
For non Scatter/Gather DMA mode, this bit is reserved.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESC_LST_ROLLINTR</name>
              <description>Descriptor rollover interrupt (DESC_LST_ROLLIntr)

This bit is valid only when Scatter/Gather DMA mode is enabled. The core sets this bit
when the corresponding channel's descriptor list rolls over.
For non Scatter/Gather DMA mode, this bit is reserved.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCINTMSK4</name>
          <description>Host Channel $i Interrupt Mask Register  This register reflects the mask for each channel status described in the previous section.</description>
          <addressOffset>0x58C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XFERCOMPLMSK</name>
              <description>Transfer Completed Mask (XferComplMsk)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHHLTDMSK</name>
              <description>Channel Halted Mask (ChHltdMsk)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERRMSK</name>
              <description>AHB Error Mask (AHBErrMsk)
In  scatter/gather  DMA  mode  for  host,
interrupts will not be generated due to the corresponding bits set in
HCINTn.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAINTRMSK</name>
              <description>BNA  (Buffer  Not  Available)  Interrupt  mask  register  (BNAIntrMsk)
This bit is valid only when Scatter/Gather DMA mode is enabled.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESC_LST_ROLLINTRMSK</name>
              <description>Descriptor List rollover interrupt Mask register(DESC_LST_ROLLIntrMsk)
This bit is valid only when Scatter/Gather DMA mode is enabled.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCTSIZ4</name>
          <description>Host Channel 4 Transfer Size Register</description>
          <addressOffset>0x590</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XFERSIZE</name>
              <description>Transfer Size (XferSize)

For an OUT, this field is the number of data bytes the host sends during the transfer.

For an IN, this field is the buffer size that the application has Reserved for the transfer. The application is expected to program this field as an integer multiple of the maximum packet size for IN transactions (periodic and non-periodic).

The width of this counter is specified as Width of Transfer Size Counters during coreConsultant configuration (parameter OTG_TRANS_COUNT_WIDTH).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet Count (PktCnt)

This field is programmed by the application with the expected number of packets to be transmitted (OUT) or received (IN).

The host decrements this count on every successful transmission or reception of an OUT/IN packet. Once this count reaches zero, the application is interrupted to indicate normal completion.

The width of this counter is specified as Width of Packet Counters during coreConsultant configuration (parameter OTG_PACKET_COUNT_WIDTH).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>PID (Pid)

The application programs this field with the type of PID to use for the initial transaction. The host maintains this field for the rest of the transfer.
 - 2'b00: DATA0
 - 2'b01: DATA2
 - 2'b10: DATA1
 - 2'b11: MDATA (non-control)/SETUP (control)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOPNG</name>
              <description>Do Ping (DoPng)

This bit is used only for OUT transfers.
Setting this field to 1 directs the host to do PING protocol.

Note: Do not set this bit for IN transfers. If this bit is set for for IN transfers it disables the channel.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCDMA4</name>
          <description>Host Channel $i DMA Address Register  This register is used by the OTG host in the internal DMA mode to maintain the current buffer pointer for IN/OUT transactions. The starting DMA address must be DWORD-aligned.</description>
          <addressOffset>0x594</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>In Buffer DMA Mode:

[31:0]: DMA Address (DMAAddr)

This field holds the start address in the external memory from which the data for the endpoint must be fetched or to which it must be stored. This register is incremented on every AHB transaction.

Reset: X if not programmed as the register is in SPRAM.

In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:

