espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
This bit enables setting NAK for Bulk OUT endpoints after the transfer is completed for Device mode Descriptor DMA
 - 1'b0 : The core does not set NAK after Bulk OUT transfer complete
 - 1'b1  :  The core sets NAK after Bulk OUT transfer complete
It bit is one time programmable after reset like any other DCFG register bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XCVRDLY</name>
              <description>XCVRDLY

 Enables or disables delay between xcvr_sel and txvalid during device chirp</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRATICINTMSK</name>
              <description>Erratic Error Interrupt Mask</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DESCDMA</name>
              <description>Enable Scatter/gather DMA in device mode (DescDMA).

When the Scatter/Gather DMA option selected during configuration of the RTL, the application can Set this bit during initialization to enable the Scatter/Gather DMA operation.

Note: This bit must be modified only once after a reset. The following combinations are available for programming:
 - GAHBCFG.DMAEn=0,DCFG.DescDMA=0 =&gt; Slave mode
 - GAHBCFG.DMAEn=0,DCFG.DescDMA=1 =&gt; Invalid
 - GAHBCFG.DMAEn=1,DCFG.DescDMA=0 =&gt; Buffered DMA mode
 - GAHBCFG.DMAEn=1,DCFG.DescDMA=1 =&gt; Scatter/Gather DMA mode</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERSCHINTVL</name>
              <description>Periodic Scheduling Interval (PerSchIntvl)

PerSchIntvl must be programmed for Scatter/Gather DMA mode.

This field specifies the amount of time the Internal
DMA engine must allocate for fetching periodic IN endpoint data.
Based on the number of periodic endpoints, this value must be
specified as 25,50 or 75% of (micro)Frame.
 - When any periodic endpoints are active, the internal DMA engine allocates the specified amount of time in fetching periodic IN endpoint data .
 - When no periodic endpoints are active, Then the internal DMA engine services non-periodic endpoints, ignoring this field.
 - After the specified time within a (micro)Frame, the DMA switches to fetching for non-periodic endpoints.
 -- 2'b00: 25% of (micro)Frame.
 -- 2'b01: 50% of (micro)Frame.
 -- 2'b10: 75% of (micro)Frame.
 -- 2'b11: Reserved.
Reset: 2'b00</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESVALID</name>
              <description>Resume Validation Period (ResValid)

This field is effective only when DCFG.Ena32KHzSusp is set.
It controls the resume period when the core resumes from
suspend. The core counts for ResValid number of clock cycles
to detect a valid resume when this bit is set</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCTL</name>
          <description>Device Control Register</description>
          <addressOffset>0x804</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>RMTWKUPSIG</name>
              <description>Remote Wakeup Signaling (RmtWkUpSig)

When the application sets this bit, the core initiates remote
signaling to wake up the USB host. The application must Set this
bit to instruct the core to exit the Suspend state. As specified in
the USB 2.0 specification, the application must clear this bit
1-15 ms after setting it.


If LPM is enabled and the core is in the L1 (Sleep) state, when the application sets this bit, the core initiates L1 remote signaling to wake up the USB host. The application must set this bit to instruct the core to exit the Sleep state. As specified in the LPM specification, the hardware automatically clears this bit 50 microseconds (TL1DevDrvResume) after being set by the application. The application must not set this bit when GLPMCFG bRemoteWake from the previous LPM transaction is zero.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTDISCON</name>
              <description>Soft Disconnect (SftDiscon)

The application uses this bit to signal the controller to do a soft disconnect. As long as this bit is Set, the host does not see that the device is connected, and the device does not receive
signals on the USB. The core stays in the disconnected state until the application clears this bit.
 - 1'b0: Normal operation. When this bit is cleared after a soft disconnect, the core drives the phy_opmode_o signal on the
   UTMI+ to 2'b00, which generates a device connect event to the USB host. When the device is reconnected, the USB host restarts device enumeration.
 - 1'b1: The core drives the phy_opmode_o signal on the UTMI+ to 2'b01, which generates a device disconnect event to the USB host.
The following is the minimum duration under various conditions for which this bit must be set for the USB host to detect a device disconnect. To accommodate clock jitter, it is
recommended that the application adds some extra delay to the specified minimum duration.

For high speed, if the device state is,
 - Suspended, the minimum duration is 1ms + 2.5us
 - Idle, the minimum duration is 3ms + 2.5us
 - Not Idle or Suspended (performing transactions), the minimum duration 125 us
For full speed/low speed, if the device state is,
 - Suspended, the minimum duration is 1ms + 2.5us
 - Idle, the minimum duration is 2.5us
 - Not Idle or Suspended (performing transactions), the minimum duration 125 us
Note:
 - This bit can be also used for ULPI/FS Serial interfaces.
 - This bit is not impacted by a soft reset.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GNPINNAKSTS</name>
              <description>Global Non-periodic IN NAK Status (GNPINNakSts)
 - 1'b0: A handshake is sent out based on the data availability in the transmit FIFO.
 - 1'b1: A NAK handshake is sent out on all non-periodic IN endpoints, irrespective of the data availability in the transmit FIFO.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GOUTNAKSTS</name>
              <description>Global OUT NAK Status (GOUTNakSts)
 - 1'b0: A handshake is sent based on the FIFO Status and the NAK and STALL bit settings.
 - 1'b1: No data is written to the RxFIFO, irrespective of space availability. Sends a NAK handshake on all packets, except on SETUP transactions. All isochronous OUT packets are dropped.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TSTCTL</name>
              <description>Test Control (TstCtl)
 - 3'b000: Test mode disabled
 - 3'b001: Test_J mode
 - 3'b010: Test_K mode
 - 3'b011: Test_SE0_NAK mode
 - 3'b100: Test_Packet mode
 - 3'b101: Test_Force_Enable
 - Others: Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SGNPINNAK</name>
              <description>Set Global Non-periodic IN NAK (SGNPInNak)

