espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
Applies to non-control, non-isochronous IN and OUT endpoints only.

The application sets this bit to stall all tokens from the USB host to this endpoint. If a
NAK bit, Global Non-periodic IN NAK, or Global OUT NAK is set along with this bit, the
STALL bit takes priority. Only the application can clear this bit, never the core.

Applies to control endpoints only.

The application can only set this bit, and the core clears it, when a SETUP token is
received for this endpoint. If a NAK bit, Global Non-periodic IN NAK, or Global OUT
NAK is set along with this bit, the STALL bit takes priority. Irrespective of this bit's
setting, the core always responds to SETUP data packets with an ACK handshake.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TxFIFO Number (TxFNum)

Shared FIFO Operation non-periodic endpoints must set this bit to zero. Periodic
endpoints must map this to the corresponding Periodic TxFIFO number.
 - 4'h0: Non-Periodic TxFIFO
 - Others: Specified Periodic TxFIFO.number
Note: An interrupt IN endpoint can be configured as a non-periodic endpoint for
applications such as mass storage. The core treats an IN endpoint as a non-periodic
endpoint if the TxFNum field is set to 0. Otherwise, a separate periodic FIFO must be
allocated for an interrupt IN endpoint, and the number of this
FIFO must be programmed into the TxFNum field. Configuring an interrupt IN
endpoint as a non-periodic endpoint saves the extra periodic FIFO area.

Dedicated FIFO Operation: These bits specify the FIFO number associated with this
endpoint. Each active IN endpoint must be programmed to a separate FIFO number.
This field is valid only for IN endpoints.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNAK</name>
              <description>Clear NAK (CNAK)

A write to this bit clears the NAK bit for the endpoint.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNAK</name>
              <description>Set NAK (SNAK)

A write to this bit sets the NAK bit for the endpoint.

Using this bit, the application can control the transmission of NAK handshakes on an endpoint. The core can also Set this bit for an endpoint after a SETUP packet is received on that endpoint.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETD0PID</name>
              <description>SetD0PID
 - Set DATA0 PID (SetD0PID)
 -- Applies to interrupt/bulk IN and OUT endpoints only.
 -- Writing to this field sets the Endpoint Data PID (DPID) field in this register to DATA0.
 -- This field is applicable both for Scatter/Gather DMA mode and non-Scatter/Gather DMA mode.
In non-Scatter/Gather DMA mode: Set Even (micro)Frame (SetEvenFr)
 -- Applies to isochronous IN and OUT endpoints only.
 -- Writing to this field sets the Even/Odd (micro)Frame (EO_FrNum) field to even (micro)Frame.
When Scatter/Gather DMA mode is enabled, this field is reserved. The frame number in which to send data is in the transmit descriptor structure. The frame in which to
receive data is updated in receive descriptor structure.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SETD1PID</name>
              <description>SetD1PID
 - Set DATA1 PID (SetD1PID)
 -- Applies to interrupt and bulk IN and OUT endpoints only.
 -- Writing to this field sets the Endpoint Data PID (DPID) field in this register to DATA1.
 -- This field is applicable both for Scatter-Gather DMA mode and non Scatter-Gather DMA mode.
 - Set odd (micro)Frame (SetOddFr)
 -- Applies to isochronous IN and OUT endpoints only.
 -- Writing to this field sets the even and odd (micro)Frame (EO_FrNum) field to odd (micro)Frame.
 -- This field is not applicable for Scatter-Gather DMA mode.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDIS</name>
              <description>Endpoint Disable (EPDis)

Applies to IN and OUT endpoints.

The application sets this bit to stop transmitting/receiving data on an endpoint, even
before the transfer for that endpoint is complete. The application must wait for the
Endpoint Disabled interrupt before treating the endpoint as disabled. The core clears
this bit before setting the Endpoint Disabled interrupt. The application must set this bit
only if Endpoint Enable is already set for this endpoint.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPENA</name>
              <description>Endpoint Enable (EPEna)

Applies to IN and OUT endpoints.
 - When Scatter/Gather DMA mode is enabled,
 -- For IN endpoints this bit indicates that the descriptor structure and data buffer with data ready to transmit is setup.
 -- For OUT endpoint it indicates that the descriptor structure and data buffer to receive data is setup.
 - When Scatter/Gather DMA mode is enabled such as for buffer-pointer based DMA mode:
 -- For IN endpoints, this bit indicates that data is ready to be transmitted on the endpoint.
 -- For OUT endpoints, this bit indicates that the application has allocated the memory to start receiving data from the USB.
 - The core clears this bit before setting any of the following interrupts on this endpoint:
 -- SETUP Phase Done
 -- Endpoint Disabled
 -- Transfer Completed
Note: For control endpoints in DMA mode, this bit must be set to be able to transfer SETUP data packets in memory.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT5</name>
          <description>Device IN Endpoint 5 Interrupt Register  Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x9A8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000080</resetValue>
          <fields>
            <field>
              <name>XFERCOMPL</name>
              <description>Transfer Completed Interrupt (XferCompl)

Applies to IN and OUT endpoints.
 - When Scatter/Gather DMA mode is enabled
 -- For IN endpoint this field indicates that the requested data from the descriptor is moved from external system memory to internal FIFO.
 -- For OUT endpoint this field indicates that the requested data from the internal FIFO is moved to external system memory. This interrupt is generated only when the corresponding endpoint descriptor is closed, and the IOC bit for the corresponding descriptor is set.
 - When Scatter/Gather DMA mode is disabled, this field indicates that the programmed transfer is complete on the AHB as well as on the USB, for this endpoint.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDISBLD</name>
              <description>Endpoint Disabled Interrupt (EPDisbld)

Applies to IN and OUT endpoints.

This bit indicates that the endpoint is disabled per the application's request.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBERR</name>
              <description>AHB Error (AHBErr)

Applies to IN and OUT endpoints.

This is generated only in Internal DMA mode when there is an
AHB error during an AHB read/write. The application can read
the corresponding endpoint DMA address register to get the
error address.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>Timeout Condition (TimeOUT)
 - In shared TX FIFO mode, applies to non-isochronous IN endpoints only.
 - In dedicated FIFO mode, applies only to Control IN endpoints.
 - In Scatter/Gather DMA mode, the TimeOUT interrupt is not asserted.
Indicates that the core has detected a timeout condition on the USB for the last IN token on this endpoint.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTKNTXFEMP</name>
              <description>IN Token Received When TxFIFO is Empty (INTknTXFEmp)

