espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
Applies to OUT endpoints Only

This interrupt is valid only when thresholding is enabled. This interrupt is asserted when the
core detects an overflow or a CRC error for non-Isochronous OUT packet.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAINTR</name>
              <description>BNA (Buffer Not Available) Interrupt (BNAIntr)

This bit is valid only when Scatter/Gather DMA mode is enabled.

The core generates this interrupt when the descriptor accessed
is not ready for the Core to process, such as Host busy or DMA
done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTDRPSTS</name>
              <description>Packet Drop Status (PktDrpSts)

This bit indicates to the application that an ISOC OUT packet has been dropped. This
bit does not have an associated mask bit and does not generate an interrupt.

Dependency: This bit is valid in non Scatter/Gather DMA mode when periodic transfer
interrupt feature is selected.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBLEERR</name>
              <description>NAK Interrupt (BbleErr)

The core generates this interrupt when babble is received for the endpoint.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKINTRPT</name>
              <description>NAK Interrupt (NAKInterrupt)

The core generates this interrupt when a NAK is transmitted or received by the device.

In case of isochronous IN endpoints the interrupt gets generated when a zero length
packet is transmitted due to un-availability of data in the TXFifo.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NYETINTRPT</name>
              <description>NYET Interrupt (NYETIntrpt)

The core generates this interrupt when a NYET response is transmitted for a non isochronous OUT endpoint.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STUPPKTRCVD</name>
              <description>Setup Packet Received

Applicable for Control OUT Endpoints in only in the Buffer DMA Mode

Set by the controller, this bit indicates that this buffer holds 8 bytes of
setup data. There is only one Setup packet per buffer. On receiving a
Setup packet, the controller closes the buffer and disables the
corresponding endpoint. The application has to re-enable the endpoint to
receive any OUT data for the Control Transfer and reprogram the buffer
start address.

Note: Because of the above behavior, the controller can receive any
number of back to back setup packets and one buffer for every setup
packet is used.
 - 1'b0: No Setup packet received
 - 1'b1: Setup packet received
Reset: 1'b0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPTSIZ5</name>
          <description>Device OUT Endpoint 5 Transfer Size Register</description>
          <addressOffset>0xBB0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XFERSIZE</name>
              <description>Transfer Size (XferSize)

Indicates the transfer size in bytes for endpoint 0. The core
interrupts the application only after it has exhausted the transfer
size amount of data. The transfer size can be Set to the
maximum packet size of the endpoint, to be interrupted at the
end of each packet.

The core decrements this field every time a packet is read from
the RxFIFO and written to the external memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet Count (PktCnt)
This field is decremented to zero after a packet is written into the RxFIFO.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDPID</name>
              <description>RxDPID

Applies to isochronous OUT endpoints only.

This is the data PID received in the last packet for this endpoint.
 - 2'b00: DATA0
 - 2'b01: DATA2
 - 2'b10: DATA1
 - 2'b11: MDATA
SETUP Packet Count (SUPCnt)

Applies to control OUT Endpoints only.

This field specifies the number of back-to-back SETUP data
packets the endpoint can receive.
 - 2'b01: 1 packet
 - 2'b10: 2 packets
 - 2'b11: 3 packets</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPDMA5</name>
          <description>Device OUT Endpoint 5 DMA Address Register</description>
          <addressOffset>0xBB4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>Holds the start address of the external memory for storing or fetching endpoint
data.

Note: For control endpoints, this field stores control OUT data packets as well as
SETUP transaction data packets. When more than three SETUP packets are
received back-to-back, the SETUP data packet in the memory is overwritten.

This register is incremented on every AHB transaction. The application can give
only a DWORD-aligned address.
 - When Scatter/Gather DMA mode is not enabled, the application programs the start address value in this field.
 - When Scatter/Gather DMA mode is enabled, this field indicates the base pointer for the descriptor list.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPDMAB5</name>
          <description>Device OUT Endpoint 5 Buffer Address Register</description>
          <addressOffset>0xBBC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMABUFFERADDR</name>
              <description>Holds the current buffer address.This register is updated as and when the data
transfer for the corresponding end point is in progress.

This register is present only in Scatter/Gather DMA mode. Otherwise this field is reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPCTL6</name>
          <description>Device Control OUT Endpoint 6 Control Register</description>
          <addressOffset>0xBC0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MPS</name>
              <description>Maximum Packet Size (MPS)

The application must program this field with the maximum packet size for the current
logical endpoint. This value is in bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBACTEP</name>
              <description>USB Active Endpoint (USBActEP)

Indicates whether this endpoint is active in the current configuration and interface. The
core clears this bit for all endpoints (other than EP 0) after detecting a USB reset. After
receiving the SetConfiguration and SetInterface commands, the application must
program endpoint registers accordingly and set this bit.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPID</name>
              <description>Endpoint Data PID (DPID)

Applies to interrupt/bulk IN and OUT endpoints only.

