espressif/esp-bist/src/soc/esp32h4/esp32h4.svd
Applies to OUT endpoints Only

This interrupt is valid only when thresholding is enabled. This interrupt is asserted when the
core detects an overflow or a CRC error for non-Isochronous OUT packet.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BNAINTR</name>
              <description>BNA (Buffer Not Available) Interrupt (BNAIntr)

This bit is valid only when Scatter/Gather DMA mode is enabled.

The core generates this interrupt when the descriptor accessed
is not ready for the Core to process, such as Host busy or DMA
done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTDRPSTS</name>
              <description>Packet Drop Status (PktDrpSts)

This bit indicates to the application that an ISOC OUT packet has been dropped. This
bit does not have an associated mask bit and does not generate an interrupt.

Dependency: This bit is valid in non Scatter/Gather DMA mode when periodic transfer
interrupt feature is selected.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BBLEERR</name>
              <description>NAK Interrupt (BbleErr)

The core generates this interrupt when babble is received for the endpoint.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKINTRPT</name>
              <description>NAK Interrupt (NAKInterrupt)

The core generates this interrupt when a NAK is transmitted or received by the device.

In case of isochronous IN endpoints the interrupt gets generated when a zero length
packet is transmitted due to un-availability of data in the TXFifo.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NYETINTRPT</name>
              <description>NYET Interrupt (NYETIntrpt)

The core generates this interrupt when a NYET response is transmitted for a non isochronous OUT endpoint.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STUPPKTRCVD</name>
              <description>Setup Packet Received

Applicable for Control OUT Endpoints in only in the Buffer DMA Mode

Set by the controller, this bit indicates that this buffer holds 8 bytes of
setup data. There is only one Setup packet per buffer. On receiving a
Setup packet, the controller closes the buffer and disables the
corresponding endpoint. The application has to re-enable the endpoint to
receive any OUT data for the Control Transfer and reprogram the buffer
start address.

Note: Because of the above behavior, the controller can receive any
number of back to back setup packets and one buffer for every setup
packet is used.
 - 1'b0: No Setup packet received
 - 1'b1: Setup packet received
Reset: 1'b0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPTSIZ6</name>
          <description>Device OUT Endpoint 6 Transfer Size Register</description>
          <addressOffset>0xBD0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XFERSIZE</name>
              <description>Transfer Size (XferSize)

Indicates the transfer size in bytes for endpoint 0. The core
interrupts the application only after it has exhausted the transfer
size amount of data. The transfer size can be Set to the
maximum packet size of the endpoint, to be interrupted at the
end of each packet.

The core decrements this field every time a packet is read from
the RxFIFO and written to the external memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet Count (PktCnt)
This field is decremented to zero after a packet is written into the RxFIFO.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDPID</name>
              <description>RxDPID

Applies to isochronous OUT endpoints only.

This is the data PID received in the last packet for this endpoint.
 - 2'b00: DATA0
 - 2'b01: DATA2
 - 2'b10: DATA1
 - 2'b11: MDATA
SETUP Packet Count (SUPCnt)

Applies to control OUT Endpoints only.

This field specifies the number of back-to-back SETUP data
packets the endpoint can receive.
 - 2'b01: 1 packet
 - 2'b10: 2 packets
 - 2'b11: 3 packets</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPDMA6</name>
          <description>Device OUT Endpoint 6 DMA Address Register</description>
          <addressOffset>0xBD4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>Holds the start address of the external memory for storing or fetching endpoint
data.

Note: For control endpoints, this field stores control OUT data packets as well as
SETUP transaction data packets. When more than three SETUP packets are
received back-to-back, the SETUP data packet in the memory is overwritten.

This register is incremented on every AHB transaction. The application can give
only a DWORD-aligned address.
 - When Scatter/Gather DMA mode is not enabled, the application programs the start address value in this field.
 - When Scatter/Gather DMA mode is enabled, this field indicates the base pointer for the descriptor list.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPDMAB6</name>
          <description>Device OUT Endpoint 6 Buffer Address Register</description>
          <addressOffset>0xBDC</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMABUFFERADDR</name>
              <description>Holds the current buffer address.This register is updated as and when the data
transfer for the corresponding end point is in progress.

This register is present only in Scatter/Gather DMA mode. Otherwise this field is reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCGCCTL</name>
          <description>Power and Clock Gating Control Register</description>
          <addressOffset>0xE00</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>STOPPCLK</name>
              <description>Stop Pclk (StopPclk)
 - The application sets this bit to stop the PHY clock (phy_clk) when the USB is suspended, the session is not valid, or the device is disconnected.
 - The application clears this bit when the USB is resumed or a new session starts.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GATEHCLK</name>
              <description>Gate Hclk (GateHclk)
 - The application sets this bit to gate hclk to modules other than the AHB Slave and Master and wakeup logic when the USB is suspended or the session is not valid.
 - The application clears this bit when the USB is resumed or a new session starts.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWRCLMP</name>
              <description>Power Clamp (PwrClmp)

This bit is valid only in Partial Power-Down mode
 - The application sets this bit before the power is turned off to clamp the signals between the power-on modules and the power-off modules.
 - The application clears the bit to disable the clamping before the power is turned on.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTPDWNMODULE</name>
              <description>Reset Power-Down Modules (RstPdwnModule)

This bit is valid only in Partial Power-Down mode.
 - The application sets this bit when the power is turned off.
 - The application clears this bit after the power is turned on and the PHY clock is up.

Note: The R/W of all core registers are possible only when this bit is set to 1b0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYSLEEP</name>
              <description>PHY In Sleep

Indicates that the PHY is in Sleep State.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1SUSPENDED</name>
              <description>L1 Deep Sleep

Indicates that the PHY is in deep sleep when in L1 state.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESETAFTERSUSP</name>
              <description>Reset after suspend

Applicable in Partial power-down mode

